<?php

namespace App\Console\Commands;

use App\Models\File;
use App\Models\InstitutionLevel;
use App\Models\Pris;
use App\Models\StrategicDocuments\Institution;
use App\Models\Tag;
use App\Services\FileOcr;
use Carbon\Carbon;
use Illuminate\Console\Command;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Log;
use Illuminate\Support\Facades\Storage;

class seedFixInstitutionPris extends Command
{
    /**
     * The name and signature of the console command.
     * @var string
     */
    protected $signature = 'old:fix_pris_institution';

    /**
     * The console command description.
     *
     * @var string
     */
    protected $description = 'Fix missing or wrong institutions in PRIS';

    /**
     * Execute the console command.
     *
     * @return int
     */
    public function handle()
    {
        //Create default institution
        $institutionForMapping = [];
        $dInstitution = Institution::where('email', '=', 'magdalena.mitkova+egov@asap.bg')->withTrashed()->first();
        $multiImporters = [
            'МВнР МИЕ' => [
                'importer' => [],
                'institutions_id' => [127],
            ],
            'МВнР МК' => [
                'importer' => [],
                'institutions_id' => [127,136],
            ],
            'МВнР МТСП' => [
                'importer' => [],
                'institutions_id' => [127,144],
            ],
            'МВнР МО' => [
                'importer' => [],
                'institutions_id' => [127, 140],
            ],
            'МВнР МФ МТ' => [
                'importer' => [],
                'institutions_id' => [127,146],
            ],
            'МВнР МТ МИЕ' => [
                'importer' => [],
                'institutions_id' => [127],
            ],
            'МИЕ МВнР' => [
                'importer' => [],
                'institutions_id' => [0, 127],
            ],
            'МК МВнР' => [
                'importer' => [],
                'institutions_id' => [136, 127],
            ],
            'МТС и МФ' => [
                'importer' => [],
                'institutions_id' => [143, 146],
            ],
            'МИ МТСП' => [
                'importer' => [],
                'institutions_id' => [144],
            ],
            'МИ МЕЕР' => [
                'importer' => [],
                'institutions_id' => [],
            ],
            'МО МРРБ' => [
                'importer' => [],
                'institutions_id' => [140,142],
            ],
            'МИ МЗ' => [
                'importer' => [],
                'institutions_id' => [132],
            ],
            'МРРБ МТСП МИЕ' => [
                'importer' => [],
                'institutions_id' => [142, 144],
            ],
            'МТСП МФ' => [
                'importer' => [],
                'institutions_id' => [144, 146],
            ],
            'МО МФ' => [
                'importer' => [],
                'institutions_id' => [140, 146],
            ],
            'МП МО' => [
                'importer' => [],
                'institutions_id' => [141, 140],
            ],
            'МО МИЕ' => [
                'importer' => [],
                'institutions_id' => [140],
            ],
            'МРРБ МО' => [
                'importer' => [],
                'institutions_id' => [142, 140],
            ],
            'МК МФ' => [
                'importer' => [],
                'institutions_id' => [136, 146],
            ],
            'МРРБ МФ' => [
                'importer' => [],
                'institutions_id' => [142, 146],
            ],
            'МЗ МОН МЗП' => [
                'importer' => [],
                'institutions_id' => [132,138],
            ],
            'МК МОН' => [
                'importer' => [],
                'institutions_id' => [136,138],
            ],
            'МИ МОН' => [
                'importer' => [],
                'institutions_id' => [138],
            ],
            'МЕВ МВР' => [
                'importer' => [],
                'institutions_id' => [129],
            ],
            'МЗ и МП' => [
                'importer' => [],
                'institutions_id' => [132,141],
            ],
            'МЗ МДПБА' => [
                'importer' => [],
                'institutions_id' => [132],
            ],
            'МЗ МРРБ' => [
                'importer' => [],
                'institutions_id' => [132,142],
            ],
        ];
        $importers = [
            'МЕ' => [
                'importer' => '',
                'institution_id' => 131,
            ],
            'МЗем' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МЗем.' => [
                'importer' => '',
                'institution_id' => null,
            ],
            //Министерство на енергетиката и енергийните ресурси
            'МЕРР' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МИР' => [
                'importer' => '',
                'institution_id' => 135,
            ],
            ':FIL' => [
                'importer' => ':FIL',
                'institution_id' => null,
            ],
            ':RE' => [
                'importer' => ':RE',
                'institution_id' => null,
            ],
            'ДА' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'ДАЕЕР' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'ДАИТС' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'ЕВ' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'М3' => [
                'importer' => '',
                'institution_id' => 132,
            ],
            'МВнР' => [
                'importer' => '',
                'institution_id' => 127,
            ],
            'МВнр' => [
                'importer' => '',
                'institution_id' => 127,
            ],
            'МвНР' => [
                'importer' => '',
                'institution_id' => 127,
            ],
            'МвнР' => [
                'importer' => '',
                'institution_id' => 127,
            ],
            'МВНР' => [
                'importer' => '',
                'institution_id' => 127,
            ],
            'МВР' => [
                'importer' => '',
                'institution_id' => 129,
            ],
            'МВр' => [
                'importer' => '',
                'institution_id' => 129,
            ],
            'МДА' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МДААР' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МДПБА' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МЕВ' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МЕЕР' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МЗ' => [
                'importer' => '',
                'institution_id' => 132,
            ],
            'Мз' => [
                'importer' => '',
                'institution_id' => 132,
            ],
            'МЗГ' => [
                'importer' => '',
                'institution_id' => null,
            ],
            //Министерството на земеделието, горите и аграрната реформа
            'МЗГАР' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МЗГБ' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МЗГП' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МЗП' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МЗХ' => [
                'importer' => '',
                'institution_id' => 133,
            ],
            'МЗХГ' => [
                'importer' => '',
                'institution_id' => 133,
            ],
            'МИ' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МИЕ' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МИЕТ' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МЕУ' => [
                'importer' => '',
                'institution_id' => 130,
            ],
            'МИС' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МК' => [
                'importer' => '',
                'institution_id' => 136,
            ],
            'МКТ' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'ММС' => [
                'importer' => '',
                'institution_id' => 136,
            ],
            'МНО' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МО' => [
                'importer' => '',
                'institution_id' => 140,
            ],
            'мо' => [
                'importer' => '',
                'institution_id' => 140,
            ],
            'МОМН' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МОН' => [
                'importer' => '',
                'institution_id' => 138,
            ],
            'МОСВ' => [
                'importer' => '',
                'institution_id' => 139,
            ],
            'МП' => [
                'importer' => '',
                'institution_id' => 141,
            ],
            'мп' => [
                'importer' => '',
                'institution_id' => 141,
            ],
            'МППЕИ' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МПр' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МРРБ' => [
                'importer' => '',
                'institution_id' => 142,
            ],
            'МС' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МТ' => [
                'importer' => '',
                'institution_id' => 144,
            ],
            'МТИТС' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МТС' => [
                'importer' => '',
                'institution_id' => 143,
            ],
            'МTC' => [
                'importer' => '',
                'institution_id' => 143,
            ],
            'МТС_' => [
                'importer' => '',
                'institution_id' => 143,
            ],
            //Министерство на труда и социалните грижи
            'МТСГ' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МТСП' => [
                'importer' => '',
                'institution_id' => 144,
            ],
            'МТТ' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МФ' => [
                'importer' => '',
                'institution_id' => 146,
            ],
            'мф' => [
                'importer' => '',
                'institution_id' => 146,
            ],
            'Мф' => [
                'importer' => '',
                'institution_id' => 146,
            ],
            'МФВС' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'МИИ' => [
                'importer' => '',
                'institution_id' => null,
            ],
            'Мо' => [
                'importer' => '',
                'institution_id' => 140,
            ],
            'министър без портфейл' => [
                'importer' => 'министър без портфейл',
                'institution_id' => null,
            ],
            'министър без портфейл (Ал. Праматарски)' => [
                'importer' => 'министър без портфейл (Ал. Праматарски)',
                'institution_id' => null,
            ],
            'министър без портфейл (Б. Димитров)' => [
                'importer' => 'министър без портфейл (Б. Димитров)',
                'institution_id' => null,
            ],
            'министър без портфейл (М. Кунева)' => [
                'importer' => 'министър без портфейл (М. Кунева)',
                'institution_id' => null,
            ],
            'министър без портфейл (Н. Моллов)' => [
                'importer' => 'министър без портфейл (Н. Моллов)',
                'institution_id' => null,
            ],
            'министър без портфейл (Ф. Хюсменова)' => [
                'importer' => 'министър без портфейл (Ф. Хюсменова)',
                'institution_id' => null,
            ],
            'министър-председателят' => [
                'importer' => 'министър-председателят',
                'institution_id' => 126,
            ],
            'зам.мин.-предс. МВнР' => [
                'importer' => 'зам. министър-председателят',
                'institution_id' => 127,
            ],
            'зам. министър-председателят' => [
                'importer' => 'зам. министър-председателят',
                'institution_id' => null,
            ],
            'зам. министър-председателят и председател на ЦКБППМН' => [
                'importer' => 'зам. министър-председателят и председател на ЦКБППМН',
                'institution_id' => null,
            ],
            'и.д. главен секретар на МС' => [
                'importer' => 'и.д. главен секретар на МС',
                'institution_id' => null,
            ],
            'заместник министър-председател и министър на външните работи' => [
                'importer' => 'заместник министър-председател и министър на външните работи',
                'institution_id' => null,
            ],
            'министър-председател и министър на външните работи' => [
                'importer' => 'министър-председател и министър на външните работи',
                'institution_id' => null,
            ],
            'заместник министър-председател по икономическите политики и министър на транспорта и съобщенията' => [
                'importer' => 'заместник министър-председател по икономическите политики и министър на транспорта и съобщенията',
                'institution_id' => null,
            ],
            'заместник министър-председател по обществения ред и сигурност и министър на вътрешните работи' => [
                'importer' => 'заместник министър-председател по обществения ред и сигурност и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'замeестник министър-председател по обществения ред и сигурност и министър на вътрешните работи' => [
                'importer' => 'замeестник министър-председател по обществения ред и сигурност и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'заместник министър-председател по икономическите политики и министър на транспорта и съобщенията; МРРБ' => [
                'importer' => 'заместник министър-председател по икономическите политики и министър на транспорта и съобщенията',
                'institution_id' => null,
            ],
            'заместник министър-председателят по социалните политики и министър на труда и социалната политика' => [
                'importer' => 'заместник министър-председателят по социалните политики и министър на труда и социалната политика',
                'institution_id' => null,
            ],
            'заместник министър- председател по социалните политики и министър на труда и социалната политика' => [
                'importer' => 'заместник министър- председател по социалните политики и министър на труда и социалната политика',
                'institution_id' => null,
            ],
            'заместник министър-председател по социалните политики и министър на труда и социалната политика' => [
                'importer' => 'заместник министър-председател по социалните политики и министър на труда и социалната политика',
                'institution_id' => null,
            ],
            'заместник министър- председател по икономиката и индустрията и министър на икономиката и индустрият' => [
                'importer' => 'заместник министър- председател по икономиката и индустрията и министър на икономиката и индустрият',
                'institution_id' => null,
            ],
            'заместник министър-председател по еврофондовете министър на финансите' => [
                'importer' => 'заместник министър-председател по еврофондовете министър на финансите',
                'institution_id' => null,
            ],
            'заместник министър-председател по еврофодновете и министър на финансите' => [
                'importer' => 'заместник министър-председател по еврофодновете и министър на финансите',
                'institution_id' => null,
            ],
            'заместник министър председател по еврофондовете и министър на финансите' => [
                'importer' => 'заместник министър председател по еврофондовете и министър на финансите',
                'institution_id' => null,
            ],
            'заместник министър-председател по еврофондовете и министър на финансите' => [
                'importer' => 'заместник министър-председател по еврофондовете и министър на финансите',
                'institution_id' => null,
            ],
            'замeстник министър-председател по ефективно управление' => [
                'importer' => 'замeстник министър-председател по ефективно управление',
                'institution_id' => null,
            ],
            'заместнек министър-председател по ефективно управление' => [
                'importer' => 'заместнек министър-председател по ефективно управление',
                'institution_id' => null,
            ],
            'замаместник министър-председател по еврофондовете и министър на финансите' => [
                'importer' => 'замаместник министър-председател по еврофондовете и министър на финансите',
                'institution_id' => null,
            ],
            'заместник министър-председател по ефективно управление' => [
                'importer' => 'заместник министър-председател по ефективно управление',
                'institution_id' => null,
            ],
            'заместник министър-председател по икономиката и министър на икономиката и индустрията' => [
                'importer' => 'заместник министър-председател по икономиката и министър на икономиката и индустрията',
                'institution_id' => null,
            ],
            'заместник министър-председател по регионалното развитие и благоустройството и министър на регионалното развитие и благоустройството' => [
                'importer' => 'заместник министър-председател по регионалното развитие и благоустройството и министър на регионалното развитие и благоустройството',
                'institution_id' => null,
            ],
            'заместник министър-председател по икономиката и индустрията и министър на икономиката и индустрията' => [
                'importer' => 'заместник министър-председател по икономиката и индустрията и министър на икономиката и индустрията',
                'institution_id' => null,
            ],
            'заместнек министър-председател по еврофондовете и министър на финансите' => [
                'importer' => 'заместнек министър-председател по еврофондовете и министър на финансите',
                'institution_id' => null,
            ],
            'заместник министър-председател по климатичните политики и министър на околната среда и водите' => [
                'importer' => 'заместник министър-председател по климатичните политики и министър на околната среда и водите',
                'institution_id' => null,
            ],
            'заместник министърпредседател по климатични политики и министър на околната среда и водите' => [
                'importer' => 'заместник министърпредседател по климатични политики и министър на околната среда и водите',
                'institution_id' => null,
            ],
            'заместник министър-председател по климатични политики и министър на околната среда и водите' => [
                'importer' => 'заместник министър-председател по климатични политики и министър на околната среда и водите',
                'institution_id' => null,
            ],
            'заместник министър-председател по обществен ред и сигурност и министър на отбраната' => [
                'importer' => 'заместник министър-председател по обществен ред и сигурност и министър на отбраната',
                'institution_id' => null,
            ],
            'зам. министър-председател по икономическите и социалните политики и министър на труда и социалната политика' => [
                'importer' => 'зам. министър-председател по икономическите и социалните политики и министър на труда и социалната политика',
                'institution_id' => null,
            ],
            'заместник министър-председател по икономическите и социалните политики и министър на труда и социалната политика;' => [
                'importer' => 'заместник министър-председател по икономическите и социалните политики и министър на труда и социалната политика;',
                'institution_id' => null,
            ],
            'заместник министър-председателят по управление на европейските средства' => [
                'importer' => 'заместник министър-председателят по управление на европейските средства',
                'institution_id' => null,
            ],
            'заместник министър-председател по управление на европейските средства' => [
                'importer' => 'заместник министър-председател по управление на европейските средства',
                'institution_id' => null,
            ],
            'заместник министър-председател по обществен ред и сигурност и министър на вътрешните работи' => [
                'importer' => 'заместник министър-председател по обществен ред и сигурност и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'замeстник министър-председател' => [
                'importer' => 'замeстник министър-председател',
                'institution_id' => null,
            ],
            'зам. министър председател по икономическата и демографската политика и министър на туризма' => [
                'importer' => 'зам. министър председател по икономическата и демографската политика и министър на туризма',
                'institution_id' => null,
            ],
            'заместник министър председател по икономическата и демографската политика и министър на туризма' => [
                'importer' => 'заместник министър председател по икономическата и демографската политика и министър на туризма',
                'institution_id' => null,
            ],
            'заместник министър-председател' => [
                'importer' => 'заместник министър-председател',
                'institution_id' => null,
            ],
            'заместник министър-председател по икономическата и демографската политика и министър на туризма' => [
                'importer' => 'заместник министър-председател по икономическата и демографската политика и министър на туризма',
                'institution_id' => null,
            ],
            'заместник министър-председател по икономическата и демографската политика' => [
                'importer' => 'заместник министър-председател по икономическата и демографската политика',
                'institution_id' => null,
            ],
            'заместник министър председател по правосъдната реформа и министър на външните работи' => [
                'importer' => 'заместник министър председател по правосъдната реформа и министър на външните работи',
                'institution_id' => null,
            ],
            'заместник министър председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'заместник министър председател по обществения ред и сигурността и министър на отбраната',
                'institution_id' => null,
            ],
            'заместник министър-председател по икономическата демографската политика' => [
                'importer' => 'заместник министър-председател по икономическата демографската политика',
                'institution_id' => null,
            ],
            'заместник министър-председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'заместник министър-председател по обществения ред и сигурността и министър на отбраната',
                'institution_id' => null,
            ],
            'Заместник министър-председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'Заместник министър-председател по обществения ред и сигурността и министър на отбраната',
                'institution_id' => null,
            ],
            'замстник министър-председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'замстник министър-председател по обществения ред и сигурността и министър на отбраната',
                'institution_id' => null,
            ],
            'замeстник министър-председател по икономическата и демографската политикаа' => [
                'importer' => 'замeстник министър-председател по икономическата и демографската политика',
                'institution_id' => null,
            ],
            'замeтник министър-председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'замeтник министър-председател по обществения ред и сигурността и министър на отбраната',
                'institution_id' => null,
            ],
            'земестник министър-председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'земестник министър-председател по обществения ред и сигурността и министър на отбраната',
                'institution_id' => null,
            ],
            'заместник-министър председател' => [
                'importer' => 'заместник-министър председател',
                'institution_id' => null,
            ],
            'заместник министър-председател по правосъдната реформа и министър на външните' => [
                'importer' => 'заместник министър-председател по правосъдната реформа и министър на външните',
                'institution_id' => null,
            ],
            'заместник министър-председател по правосъдната реформа и министър на външните работи' => [
                'importer' => 'заместник министър-председател по правосъдната реформа и министър на външните работи',
                'institution_id' => null,
            ],
            'замeстник министър-председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'замeстник министър-председател по обществения ред и сигурността и министър на отбраната',
                'institution_id' => null,
            ],
            'заместник министър-председателят по правосъдната реформа и министър на външните работи' => [
                'importer' => 'заместник министър-председателят по правосъдната реформа и министър на външните работи',
                'institution_id' => null,
            ],
            'заместник министър-председател по социални политики и министър на здравеопазване' => [
                'importer' => 'заместник министър-председател по социални политики и министър на здравеопазване',
                'institution_id' => null,
            ],
            'заместник министър-председател  по подготовката на българското председателство на Съвета на ЕС - 2018' => [
                'importer' => 'заместник министър-председател  по подготовката на българското председателство на Съвета на ЕС - 2018',
                'institution_id' => null,
            ],
            'министър-председател по вътрешен ред и сигурност и министър на отбраната' => [
                'importer' => 'министър-председател по вътрешен ред и сигурност и министър на отбраната',
                'institution_id' => null,
            ],
            'заместник министър-председател по подготовка на българското председателство на Съвета на ЕС - 2018' => [
                'importer' => 'заместник министър-председател по подготовка на българското председателство на Съвета на ЕС - 2018',
                'institution_id' => null,
            ],
            'заместник министър-председател по европейските фондове' => [
                'importer' => 'заместник министър-председател по европейските фондове',
                'institution_id' => null,
            ],
            'заместник министър-председател по подготовката на българското председателство на Съвета на ЕС-2018' => [
                'importer' => 'заместник министър-председател по подготовката на българското председателство на Съвета на ЕС-2018',
                'institution_id' => null,
            ],
            'заместник министър-председател по вътрешен ред и сигурност и министър на отбраната' => [
                'importer' => 'заместник министър-председател по вътрешен ред и сигурност и министър на отбраната',
                'institution_id' => null,
            ],
            'заместник министър-председател по подготовката на българското председателство на Съвета на ЕС - 2018' => [
                'importer' => 'заместник министър-председател по подготовката на българското председателство на Съвета на ЕС - 2018',
                'institution_id' => null,
            ],
            'заместник министър-председател по социални политики и министър на здравеопазването' => [
                'importer' => 'заместник министър-председател по социални политики и министър на здравеопазването',
                'institution_id' => null,
            ],
            'заместник министър-председател по коалиционна поли¬тика и държавна администрация и министър на вътрешните работи' => [
                'importer' => 'заместник министър-председател по коалиционна поли¬тика и държавна администрация и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'заместник министър-председател по европейските фондове и икономическа политика' => [
                'importer' => 'заместник министър-председател по европейските фондове и икономическа политика',
                'institution_id' => null,
            ],
            'Министър-председател' => [
                'importer' => 'Министър-председател',
                'institution_id' => null,
            ],
            'заместник министър-председател по координация на европейските политикии институционалните въпроси и министър на образованието и науката' => [
                'importer' => 'заместник министър-председател по координация на европейските политикии институционалните въпроси и министър на образованието и науката',
                'institution_id' => null,
            ],
            'заместник министър-председател по координация на европейските политики и институционалние въпроси и министър на образованието и науката' => [
                'importer' => 'заместник министър-председател по координация на европейските политики и институционалние въпроси и министър на образованието и науката',
                'institution_id' => null,
            ],
            'замесник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи' => [
                'importer' => 'замесник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'заместник министър-председателят по коалиционна политика и държавна администрация и министър на вътрешните работи' => [
                'importer' => 'заместник министър-председателят по коалиционна политика и държавна администрация и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'замeстник министър-председател по координация на европейските политики и институционалните въпроси и министър на образованието и науката' => [
                'importer' => 'замeстник министър-председател по координация на европейските политики и институционалните въпроси и министър на образованието и науката',
                'institution_id' => null,
            ],
            'замаместник министър-председател по координация на европейските политики и институционалните въпроси и министър на образованието и науката' => [
                'importer' => 'замаместник министър-председател по координация на европейските политики и институционалните въпроси и министър на образованието и науката',
                'institution_id' => null,
            ],
            'заместник министър-председателят по демографската и социалната политика и министър на труда и социалната политика' => [
                'importer' => 'заместник министър-председателят по демографската и социалната политика и министър на труда и социалната политика',
                'institution_id' => null,
            ],
            'зам. министър-председател по координация на европейските политики и институционалните въпроси и министър на образованието и науката' => [
                'importer' => 'зам. министър-председател по координация на европейските политики и институционалните въпроси и министър на образованието и науката',
                'institution_id' => null,
            ],
            'заместник министър-председател по координация на европейските политики и институционалните въпроси и министър на образованието и науката' => [
                'importer' => 'заместник министър-председател по координация на европейските политики и институционалните въпроси и министър на образованието и науката',
                'institution_id' => null,
            ],
            'заместник министър-председателят по координация на европейските политики и институционалните въпроси и министър на образованието и науката' => [
                'importer' => 'заместник министър-председателят по координация на европейските политики и институционалните въпроси и министър на образованието и науката',
                'institution_id' => null,
            ],
            'заместник министър-председателят по координация на европейските политики и инсти-туционалните въпроси' => [
                'importer' => 'заместник министър-председателят по координация на европейските политики и инсти-туционалните въпроси',
                'institution_id' => null,
            ],
            'заместник министър-председател по демографската и социалната политика и министър на труда и социалната политика' => [
                'importer' => 'заместник министър-председател по демографската и социалната политика и министър на труда и социалната политика',
                'institution_id' => null,
            ],
            'заместник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи' => [
                'importer' => 'заместник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'заместник. министър-председател по европейските фондове и икономическата политика' => [
                'importer' => 'заместник. министър-председател по европейските фондове и икономическата политика',
                'institution_id' => null,
            ],
            'замeстник министър-председател по демографската и социалната политика и министър на труда и социалната политика' => [
                'importer' => 'замeстник министър-председател по демографската и социалната политика и министър на труда и социалната политика',
                'institution_id' => null,
            ],
            'замeстник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи' => [
                'importer' => 'замeстник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'заместник министър-председател по координация на европейските политики и институционалните въпроси' => [
                'importer' => 'заместник министър-председател по координация на европейските политики и институционалните въпроси',
                'institution_id' => null,
            ],
            'заместник министър-председателят по коалиционна политика и държавна администрация' => [
                'importer' => 'заместник министър-председателят по коалиционна политика и държавна администрация',
                'institution_id' => null,
            ],
            'заместник министър-председателят по координация на европейските политики и институционалните въпроси' => [
                'importer' => 'заместник министър-председателят по координация на европейските политики и институционалните въпроси',
                'institution_id' => null,
            ],
            'заместник министър-председателят по европейските фондове и икономическата политика' => [
                'importer' => 'заместник министър-председателят по европейските фондове и икономическата политика',
                'institution_id' => null,
            ],
            'заместник министър-председател по коалиционна политика и държавна администрация' => [
                'importer' => 'заместник министър-председател по коалиционна политика и държавна администрация',
                'institution_id' => null,
            ],
            'заместник министър-председател по европейските фондове и икономическата политика' => [
                'importer' => 'заместник министър-председател по европейските фондове и икономическата политика',
                'institution_id' => null,
            ],
            'заместник. министър-председател по социална политика и министър на труда и социалната политика' => [
                'importer' => 'заместник. министър-председател по социална политика и министър на труда и социалната политика',
                'institution_id' => null,
            ],
            'заместник министър-председател по управление на средствата от Европейския съюз' => [
                'importer' => 'заместник министър-председател по управление на средствата от Европейския съюз',
                'institution_id' => null,
            ],
            'замeстник министър-председател по социална политика и министър на труда и социалната политика' => [
                'importer' => 'замeстник министър-председател по социална политика и министър на труда и социалната политика',
                'institution_id' => null,
            ],
            'заместник министър-председателят по управление на средствата от Европейския съюз' => [
                'importer' => 'заместник министър-председателят по управление на средствата от Европейския съюз',
                'institution_id' => null,
            ],
            'заместник министър-председателят по правосъдие' => [
                'importer' => 'заместник министър-председателят по правосъдие',
                'institution_id' => null,
            ],
            'заместник министър-председател по правосъдие' => [
                'importer' => 'заместник министър-председател по правосъдие',
                'institution_id' => null,
            ],
            'заместник министър председател по икономическа политика' => [
                'importer' => 'заместник министър председател по икономическа политика',
                'institution_id' => null,
            ],
            'заместник министър-председател по социална политика и министър на труда и социалната политика' => [
                'importer' => 'заместник министър-председател по социална политика и министър на труда и социалната политика',
                'institution_id' => null,
            ],
            'заместник министър-председателят по социална политика и министър на труда и социалната политика' => [
                'importer' => 'заместник министър-председателят по социална политика и министър на труда и социалната политика',
                'institution_id' => null,
            ],
            'вътрешен ред и сигурност и министър на правосъдието' => [
                'importer' => 'вътрешен ред и сигурност и министър на правосъдието',
                'institution_id' => null,
            ],
            'заместник министър-председателят по пръвосъдие' => [
                'importer' => 'заместник министър-председателят по пръвосъдие',
                'institution_id' => null,
            ],
            'министър на регионалното развитие и министър на инвестиционното проектиране' => [
                'importer' => 'министър на регионалното развитие и министър на инвестиционното проектиране',
                'institution_id' => null,
            ],
            'заместник министър-председател по икономическа политика' => [
                'importer' => 'заместник министър-председател по икономическа политика',
                'institution_id' => null,
            ],
            'заместни министър-председател и министър на правосъдието' => [
                'importer' => 'заместни министър-председател и министър на правосъдието',
                'institution_id' => null,
            ],
            'замeстник министър-председател и министър на правосъдието' => [
                'importer' => 'замeстник министър-председател и министър на правосъдието',
                'institution_id' => null,
            ],
            'заместник-министърът и министър на вътрешните работи' => [
                'importer' => 'заместник-министърът и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'заместник-министър председателят и министър на вътрешните работи' => [
                'importer' => 'заместник-министър председателят и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'заместник министър-председателят по икономическото развитие' => [
                'importer' => 'заместник министър-председателят по икономическото развитие',
                'institution_id' => null,
            ],
            'замeстник министър-председател по икономическото развитие' => [
                'importer' => 'замeстник министър-председател по икономическото развитие',
                'institution_id' => null,
            ],
            'заместник министър-председателят и министър на правосъдието' => [
                'importer' => 'заместник министър-председателят и министър на правосъдието',
                'institution_id' => null,
            ],
            'замстник министър-председателят и министър на вътрешните работи' => [
                'importer' => 'замстник министър-председателят и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'заместник министър-председателят и министър на вътрешните работи' => [
                'importer' => 'заместник министър-председателят и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'заместник-министър председателят и министър на правосъдието' => [
                'importer' => 'заместник-министър председателят и министър на правосъдието',
                'institution_id' => null,
            ],
            'заместник министър-председател и министър на правосъдието' => [
                'importer' => 'заместник министър-председател и министър на правосъдието',
                'institution_id' => null,
            ],
            'зам. министър-председателят и министър на вътрешните работи' => [
                'importer' => 'зам. министър-председателят и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'зам. министър-председателят по икономическото развитие' => [
                'importer' => 'зам. министър-председателят по икономическото развитие',
                'institution_id' => null,
            ],
            'зам. министър-председателят и министър на правосъдието' => [
                'importer' => 'зам. министър-председателят и министър на правосъдието',
                'institution_id' => null,
            ],
            'зам. министър-председател и министър на правосъдието' => [
                'importer' => 'зам. министър-председател и министър на правосъдието',
                'institution_id' => null,
            ],
            'заместник министър-председател и министър на вътрешните работи' => [
                'importer' => 'заместник министър-председател и министър на вътрешните работи',
                'institution_id' => null,
            ],
            'заместник министър-председател по икономическото развитие' => [
                'importer' => 'заместник министър-председател по икономическото развитие',
                'institution_id' => null,
            ],
            'министър-председателят и министър на външните работи М. Райков' => [
                'importer' => 'министър-председателят и министър на външните работи М. Райков',
                'institution_id' => null,
            ],
            'министър-председателят и министър на външните работи' => [
                'importer' => 'министър-председателят и министър на външните работи',
                'institution_id' => null,
            ],
            'миншстэр-председателят' => [
                'importer' => 'миншстър-председателят',
                'institution_id' => null,
            ],
            'м-р Б. Нанев' => [
                'importer' => 'м-р Б. Нанев',
                'institution_id' => null,
            ],
            'м-р Б. Димитров' => [
                'importer' => 'м-р Б. Димитров',
                'institution_id' => null,
            ],
            'зам. министър-председателят М. Плугчиева' => [
                'importer' => 'зам. министър-председателят М. Плугчиева',
                'institution_id' => null,
            ],
            'министър- председателят' => [
                'importer' => 'министър- председателят',
                'institution_id' => null,
            ],
            'зам. мин.-председател' => [
                'importer' => 'зам. мин.-председател',
                'institution_id' => null,
            ],
            'Зам. министър-председател' => [
                'importer' => 'Зам. министър-председател',
                'institution_id' => null,
            ],
            'заместник министър-председателят' => [
                'importer' => 'заместник министър-председателят',
                'institution_id' => null,
            ],
            'министър- председател' => [
                'importer' => 'министър- председател',
                'institution_id' => null,
            ],
            'зам. мин. -предс.' => [
                'importer' => 'зам. мин. -предс.',
                'institution_id' => null,
            ],
            'зам. мин. - председателят' => [
                'importer' => 'зам. мин. - председателят',
                'institution_id' => null,
            ],
            'зам.мин.-председат.' => [
                'importer' => 'зам.мин.-председат.',
                'institution_id' => null,
            ],
            'Заместник министър-председател' => [
                'importer' => 'Заместник министър-председател',
                'institution_id' => null,
            ],
            'зам. министър-председателя' => [
                'importer' => 'зам. министър-председателя',
                'institution_id' => null,
            ],
            'зам. мин.-председ.' => [
                'importer' => 'зам. мин.-председ.',
                'institution_id' => null,
            ],
            'зам м-предс.' => [
                'importer' => 'зам м-предс.',
                'institution_id' => null,
            ],
            'м-р ф. Хюсменова' => [
                'importer' => 'м-р ф. Хюсменова',
                'institution_id' => null,
            ],
            'Пламен Панайотов' => [
                'importer' => 'Пламен Панайотов',
                'institution_id' => null,
            ],
            'Пл. Панайотов' => [
                'importer' => 'Пл. Панайотов',
                'institution_id' => null,
            ],
            'вицепремиер' => [
                'importer' => 'вицепремиер',
                'institution_id' => null,
            ],
            'М-ра без портфейл Ф. Хюсменова' => [
                'importer' => 'М-ра без портфейл Ф. Хюсменова',
                'institution_id' => null,
            ],
            'Вицепремиерът Пламен Панайотов' => [
                'importer' => 'Вицепремиерът Пламен Панайотов',
                'institution_id' => null,
            ],
            'м-р Моллов' => [
                'importer' => 'м-р Моллов',
                'institution_id' => null,
            ],
            'м-рът на труда и соц.политика' => [
                'importer' => 'м-рът на труда и соц.политика',
                'institution_id' => null,
            ],
            'М-во на промишлеността' => [
                'importer' => 'М-во на промишлеността',
                'institution_id' => null,
            ],
            'м-р Ф.Хюсменова' => [
                'importer' => 'м-р Ф.Хюсменова',
                'institution_id' => null,
            ],
            'Зм. мин.-предс.' => [
                'importer' => 'Зм. мин.-предс.',
                'institution_id' => null,
            ],
            'зам. мин.-председателя' => [
                'importer' => 'зам. мин.-председателя',
                'institution_id' => null,
            ],
            'Зам. министър-председателя' => [
                'importer' => 'Зам. министър-председателя',
                'institution_id' => null,
            ],
            'Вицепремиер Пл.Панайотов' => [
                'importer' => 'Вицепремиер Пл.Панайотов',
                'institution_id' => null,
            ],
            'м-р Фелиз Хюсменова' => [
                'importer' => 'м-р Фелиз Хюсменова',
                'institution_id' => null,
            ],
            'Зам. министър-председателят' => [
                'importer' => 'Зам. министър-председателят',
                'institution_id' => null,
            ],
            'Министър-председателят на РБ' => [
                'importer' => 'Министър-председателят на РБ',
                'institution_id' => null,
            ],
            'Министърът на държ. администр.' => [
                'importer' => 'Министърът на държ. администр.',
                'institution_id' => null,
            ],
            'М-рът на държ. адм.' => [
                'importer' => 'М-рът на държ. адм.',
                'institution_id' => null,
            ],
            'Министърът на държавната адм.' => [
                'importer' => 'Министърът на държавната адм.',
                'institution_id' => null,
            ],
            'М-р Ал. Праматарски' => [
                'importer' => 'М-р Ал. Праматарски',
                'institution_id' => null,
            ],
            'м-р Александър Праматарски' => [
                'importer' => 'м-р Александър Праматарски',
                'institution_id' => null,
            ],
            'мин.-председател' => [
                'importer' => 'мин.-председател',
                'institution_id' => null,
            ],
            'министър-председател' => [
                'importer' => 'министър-председател',
                'institution_id' => null,
            ],
            'м-р Емилия Масларова' => [
                'importer' => 'м-р Емилия Масларова',
                'institution_id' => null,
            ],
            'зам.мин.-председ.' => [
                'importer' => 'зам.мин.-председ.',
                'institution_id' => null,
            ],
            'зам.мин.-председател' => [
                'importer' => 'зам.мин.-председател',
                'institution_id' => null,
            ],
            'зам.мин.-предс.' => [
                'importer' => 'зам.мин.-предс.',
                'institution_id' => null,
            ],
            'мин.- председателя' => [
                'importer' => 'мин.- председателя',
                'institution_id' => null,
            ],
            'зам. мин.-предс.' => [
                'importer' => 'зам. мин.-предс.',
                'institution_id' => null,
            ],
            'Мин.- председателя' => [
                'importer' => 'Мин.- председателя',
                'institution_id' => null,
            ],
            'Мин.-председателя' => [
                'importer' => 'Мин.-председателя',
                'institution_id' => null,
            ],
            'мин-председателя' => [
                'importer' => 'мин-председателя',
                'institution_id' => null,
            ],
            'Зам-мин предс.' => [
                'importer' => 'Зам-мин предс.',
                'institution_id' => null,
            ],
            'зам.мин-предс.' => [
                'importer' => 'зам.мин-предс.',
                'institution_id' => null,
            ],
            'зам.мин-председателя' => [
                'importer' => 'зам.мин-председателя',
                'institution_id' => null,
            ],
            'ЗАМ МИНИСТЪР-ПРЕДСЕДАТЕЛЯ МЕВ' => [
                'importer' => 'ЗАМ МИНИСТЪР-ПРЕДСЕДАТЕЛЯ МЕВ',
                'institution_id' => null,
            ],
            'МИНИСТЪР-ПРЕДСЕДАТЕЛЯ' => [
                'importer' => 'МИНИСТЪР-ПРЕДСЕДАТЕЛЯ',
                'institution_id' => null,
            ],
            'зам.министър-председател' => [
                'importer' => 'зам.министър-председател',
                'institution_id' => null,
            ],
            'зам. мин.-председателят' => [
                'importer' => 'зам. мин.-председателят',
                'institution_id' => null,
            ],
            'Заместник мин.-председателят' => [
                'importer' => 'Заместник мин.-председателят',
                'institution_id' => null,
            ],
            'зам.мин.-председателят' => [
                'importer' => 'зам.мин.-председателят',
                'institution_id' => null,
            ],
            'Зам.мин.-председател' => [
                'importer' => 'Зам.мин.-председател',
                'institution_id' => null,
            ],
            'Министър-председателя' => [
                'importer' => 'Министър-председателя',
                'institution_id' => null,
            ],
            'М-р без портфейл Ф. Хюсменова' => [
                'importer' => 'М-р без портфейл Ф. Хюсменова',
                'institution_id' => null,
            ],
            'м-р без портфейл' => [
                'importer' => 'м-р без портфейл',
                'institution_id' => null,
            ],
            'Вицепремиер Пл. Панайотов' => [
                'importer' => 'Вицепремиер Пл. Панайотов',
                'institution_id' => null,
            ],
            'Зам.мин.-председателят' => [
                'importer' => 'Зам.мин.-председателят',
                'institution_id' => null,
            ],
            'зам.министър-председателят' => [
                'importer' => 'зам.министър-председателят',
                'institution_id' => null,
            ],
            'зам.-министър-председателят' => [
                'importer' => 'зам.-министър-председателят',
                'institution_id' => null,
            ],
            'М-р Ф. Хюсменова' => [
                'importer' => 'М-р Ф. Хюсменова',
                'institution_id' => null,
            ],
            'м-р Ф. Хюсменова' => [
                'importer' => 'м-р Ф. Хюсменова',
                'institution_id' => null,
            ],
            'М-р Д. Калчев' => [
                'importer' => 'М-р Д. Калчев',
                'institution_id' => null,
            ],
            'М-р М. Кунева' => [
                'importer' => 'М-р М. Кунева',
                'institution_id' => null,
            ],
            'м-р Д. Калчев' => [
                'importer' => 'м-р Д. Калчев',
                'institution_id' => null,
            ],
            'м-р М. Кунев' => [
                'importer' => 'м-р М. Кунев',
                'institution_id' => null,
            ],
            'м-р Д.Калчев' => [
                'importer' => 'м-р Д.Калчев',
                'institution_id' => null,
            ],
            'М-рът на държ. администрация' => [
                'importer' => 'М-рът на държ. администрация',
                'institution_id' => null,
            ],
            'М-р Н. Моллов' => [
                'importer' => 'М-р Н. Моллов',
                'institution_id' => null,
            ],
            'м-рът на държ. адм.' => [
                'importer' => 'м-рът на държ. адм.',
                'institution_id' => null,
            ],
            'министърът на държ.администр.' => [
                'importer' => 'министърът на държ.администр.',
                'institution_id' => null,
            ],
            'м-рът на държ. администрация' => [
                'importer' => 'м-рът на държ. администрация',
                'institution_id' => null,
            ],
            'министърът на държ.администрац' => [
                'importer' => 'министърът на държ.администрац',
                'institution_id' => null,
            ],
            'м-р Н. Моллов' => [
                'importer' => 'м-р Н. Моллов',
                'institution_id' => null,
            ],
            'Министър-председателят' => [
                'importer' => 'Министър-председателят',
                'institution_id' => null,
            ],
            'министър Ал. Праматарски' => [
                'importer' => 'министър Ал. Праматарски',
                'institution_id' => null,
            ],
            'м-р Ал. Праматарски' => [
                'importer' => 'м-р Ал. Праматарски',
                'institution_id' => null,
            ],
            'м-р А. Праматарски' => [
                'importer' => 'м-р А. Праматарски',
                'institution_id' => null,
            ],
            'м-во на правосъдието' => [
                'importer' => 'м-во на правосъдието',
                'institution_id' => null,
            ],
            'А. Праматарски' => [
                'importer' => 'А. Праматарски',
                'institution_id' => null,
            ],
            'М-во на правосъдието' => [
                'importer' => 'М-во на правосъдието',
                'institution_id' => null,
            ],
            'м-р Праматарски' => [
                'importer' => 'м-р Праматарски',
                'institution_id' => null,
            ],
            'и.д.главен секретар на МС' => [
                'importer' => 'и.д.главен секретар на МС',
                'institution_id' => null,
            ],


        ];

        //records per query
        $step = 50;
        //max id in old db
        $maxOldId = DB::connection('pris')->select('select max(archimed.e_items.id) from archimed.e_items');
        //start from this id in old database
        $currentStep = 1;

        if( (int)$maxOldId[0]->max ) {
            $maxOldId = (int)$maxOldId[0]->max;

            while ($currentStep < $maxOldId) {
                echo "FromId: ".$currentStep.' to Id: '.($currentStep + $step).PHP_EOL;
                $oldDbResult = DB::connection('pris')->select('select
                                pris.id as old_id,
                                pris."xml" as to_parse_xml_details
                            FROM archimed.e_items pris
                            where true
                                -- and pris.id = 24778
                                and pris.id >= ' . $currentStep . '
                                and pris.id < ' . ($currentStep + $step) . '
                                and pris.itemtypeid <> 5017 -- skip law records
                                -- and documents.lastrevision = \'Y\' -- get final versions
                            group by pris.id
                            order by pris.id asc');


                if (sizeof($oldDbResult)) {
                    DB::beginTransaction();
                    foreach ($oldDbResult as $item) {
                        $pris = null;
                        try {
                            $importerStr = [];
                            $importerInstitutions = [];
                            $xml = simplexml_load_string($item->to_parse_xml_details);
                            $json = json_encode($xml, JSON_UNESCAPED_UNICODE);
                            $data = json_decode($json, true);

                            if(isset($data['DocumentContent']) && isset($data['DocumentContent']['Attribute']) && sizeof($data['DocumentContent']['Attribute'])) {
                                $attributes = $data['DocumentContent']['Attribute'];
                                foreach ($attributes as $att) {
                                    //importer
                                    //institution_id
                                    if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Вносител') {
                                        $val = isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value']) ? $att['Value']['Value'] : (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value']) ? $att['Value'] : null);
                                        if(!empty($val)) {
                                            $val = str_replace('"', '', $val);
                                            $val = str_replace(['\n\r', '\n', '\r'], ' ', $val);
                                            $explode = explode(',', $val);
                                            foreach ($explode as $e) {
                                                $missing = 0;
                                                //mapping
                                                if(isset($importers[trim($e)])) {
                                                    if(!is_null($importers[trim($e)]['importer'])) {
                                                        $importerStr[]= $importers[trim($e)]['importer'];
                                                    } else {
                                                        $missing += 1;
                                                    }
                                                    if(!is_null($importers[trim($e)]['institution_id'])) {
                                                        $importerInstitutions[] = $importers[trim($e)]['institution_id'];
                                                    } else{
                                                        $missing += 1;
                                                    }
                                                } else if (isset($multiImporters[trim($e)])){
                                                    if(sizeof($multiImporters[trim($e)]['importer'])) {
                                                        $importerStr = array_merge($importerStr,$multiImporters[trim($e)]['importer']);
                                                    } else{
                                                        $missing += 1;
                                                    }
                                                    if(sizeof($multiImporters[trim($e)]['institutions_id'])) {
                                                        $importerInstitutions = array_merge($importerInstitutions, $multiImporters[trim($e)]['institutions_id']);
                                                    } else{
                                                        $missing += 1;
                                                    }
                                                } else{
                                                    $missing = 2;
                                                }

                                                if($missing == 2) {
                                                    $institutionForMapping[trim($e)] = trim($e);
                                                }
                                            }

                                        }
                                    }
                                }

                                $pris = Pris::where('old_id', '=', (int)$item->old_id)->first();
                                if($pris) {
                                    $pris->importer = sizeof($importerStr) ? implode(', ', $importerStr) : '';
                                    if(isset($importerInstitutions) && sizeof($importerInstitutions)) {
                                        $this->comment('PRIS with old id (' . $item->old_id . ') institutions are updated');
                                        $pris->institutions()->sync($importerInstitutions);
                                    } else{
                                        $this->comment('PRIS with old id (' . $item->old_id . ') No institution');
                                        $pris->institutions()->sync([$dInstitution->id]);
                                    }
                                    $pris->save();
                                } else{
                                    $this->comment('Can\'t find PRIS with old id (' . $item->old_id . ')');
                                }

                            }

                            DB::commit();
                        } catch (\Exception $e) {
                            Log::error('Error Migration Fix pris institution: ' . $e);
                            DB::rollBack();
                            dd($item ?? 'no old data', $importerInstitutions ?? 'no institutions');
                        }
                    }
                }
                $currentStep += $step;
            }
        }

        if(sizeof($institutionForMapping)) {
            $fp = fopen('institutions_for_mapping_last_pris.csv', 'w');
            foreach ($institutionForMapping as $fields) {
                fputcsv($fp, [$fields]);
            }
            fclose($fp);
        }
    }
}
