<?php

namespace App\Console\Commands;

use App\Models\CustomActivity;
use App\Models\File;
use App\Models\InstitutionLevel;
use App\Models\Pris;
use App\Models\StrategicDocuments\Institution;
use App\Models\Tag;
use App\Services\FileOcr;
use Carbon\Carbon;
use Illuminate\Console\Command;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Log;
use Illuminate\Support\Facades\Storage;

class seedOldLastPris extends Command
{
    /**
     * The name and signature of the console command.
     * @var string
     */
    protected $signature = 'old:pris';

    /**
     * The console command description.
     *
     * @var string
     */
    protected $description = 'Migrate last PRIS data to application';

    /**
     * Execute the console command.
     *
     * @return int
     */
    public function handle()
    {
        activity()->disableLogging();

        $this->info('Start at '.date('Y-m-d H:i:s'));
        file_put_contents('institutions_for_mapping_last_pris.txt', '');

        //Check how many are old pris
//        select count(ei.id) from e_items ei where ei.itemtypeid <> 5017;

        $institutionForMapping = [];
        $locales = config('available_languages');

        //Create default institution
        $diEmail = 'magdalena.mitkova+egov@asap.bg';
        $dInstitution = Institution::where('email', '=', $diEmail)->withTrashed()->first();
        if(!$dInstitution) {
            $insLevel = InstitutionLevel::create([
                'system_name' => 'default'
            ]);
            if(!$insLevel) {
                $this->error('Cant create default institution');
            }
            if($insLevel) {
                foreach ($locales as $locale) {
                    $insLevel->translateOrNew($locale['code'])->name = 'Default Level';
                }
                $insLevel->save();
            }

            $dInstitution = Institution::create([
                'email' => $diEmail,
                'institution_level_id' => $insLevel->id
            ]);

            if(!$dInstitution) {
                $this->error('Cant create default institution');
            }
            foreach ($locales as $locale) {
                $dInstitution->translateOrNew($locale['code'])->name = 'Default';
            }
            $dInstitution->save();
        }

        $ourTags = Tag::with(['translation'])->get()->pluck('id', 'translation.label')->toArray();
        $ourPris = Pris::whereNotNull('old_id')->get()->pluck('id', 'old_id')->toArray();

        $legalTypeDocs = [
            5017 => 7, //'Заповед',
            5018 => 2, //'Решение',
            5019 => 1, //'Постановление',
            5020 => 5, //'Протокол',
            5021 => 4, //'Разпореждане',
            5022 => 6, //'Стенограма',
            //Production
            5028 => 14, //'Закон',
            5029 => 9, //'Доклад',
            5030 => 10, //'Указ',
            5031 => 11, //'Писмо',
            5032 => 12, //'Предложение',
            5033 => 13, //'Конституция',
            //Local
//            5028 => 46, //'Закон',
//            5029 => 41, //'Доклад',
//            5030 => 42, //'Указ',
//            5031 => 43, //'Писмо',
//            5032 => 44, //'Предложение',
//            5033 => 45, //'Конституция',
        ];

        //If category is 'Протокол' and doc_num is float and doc_num is < 100, then we should move document to 'Протоколни решения',
        $protocolsId = 5;
        $protocolDecisionsId = 3;

        $importers = [
            'МВнР, МРР' => [
                'importer' => 'Министерство на външните работи, Министерство на регионалното развитие',
                'institution_id' => [128, 0]
            ],
            'МРР, МО, МИЕ' => [
                'importer' => 'Министерство на регионалното развитие, Министерство на отбраната, Министерство на икономиката и енергетиката',
                'institution_id' => [0, 140, 0]
            ],
            'МЗ, МРР' => [
                'importer' => 'Министерство на здравеопазването, Министерство на регионалното развитие',
                'institution_id' => [132, 0]
            ],
            'ММС, МРР' => [
                'importer' => 'Министерство на младежта и спорта, Министерство на регионалното развитие',
                'institution_id' => [137, 0]
            ],
            'МФ,  МРР' => [
                'importer' => 'Министерство на финансите, Министерство на регионалното развитие',
                'institution_id' => [146, 0]
            ],
            'МК,  МРР' => [
                'importer' => 'Министерство на културата, Министерство на регионалното развитие',
                'institution_id' => [136, 0]
            ],
            'МРР, МО' => [
                'importer' => 'Министерство на регионалното развитие, Министерство на отбраната',
                'institution_id' => [0, 140]
            ],
            'ЗМПИР, МТСП' => [
                'importer' => 'Заместник министър-председател по икономическото развитие, Министерство на труда и социалната политика',
                'institution_id' => [127, 144]
            ],
            'МРР, МК' => [
                'importer' => 'Министерство на регионалното развитие, Министерство на културата',
                'institution_id' => [0, 136]
            ],
            'МЗПИР, МИЕ' => [
                'importer' => 'Заместник министър-председател по икономическото развитие, Министерство на икономиката и енергетиката',
                'institution_id' => [127, 0]
            ],
            'МО, МРР' => [
                'importer' => 'Министерство на отбраната, Министерство на регионалното развитие',
                'institution_id' => [140, 0]
            ],
            'ЗМП, МП' => [
                'importer' => 'Заместник министър-председател, Министерство на правосъдието',
                'institution_id' => [127, 141]
            ],
            'ЗМП, МВР' => [
                'importer' => 'Заместник министър-председател, Министерство на вътрешните работи',
                'institution_id' => [127, 129]
            ],
            'МРР, МЗХ' => [
                'importer' => 'Министерство на регионалното развитие, Министерство на земеделието и храните',
                'institution_id' => [0, 133]
            ],
            'МРР, МИЕ' => [
                'importer' => 'Министерство на регионалното развитие, Министерство на икономиката и енергетиката',
                'institution_id' => [0, 0]
            ],
            'МВР, МРР' => [
                'importer' => 'Министерство на вътрешните работи, Министерство на регионалното развитие',
                'institution_id' => [129, 0]
            ],
            'МЗХ, МРР' => [
                'importer' => 'Министерство на земеделието и храните, Министерство на регионалното развитие',
                'institution_id' => [133, 0]
            ],
            'МК, МРР' => [
                'importer' => 'Министерство на културата, Министерство на регионалното развитие',
                'institution_id' => [136, 0]
            ],
            'МФ, МРР' => [
                'importer' => 'Министерство на финансите, Министерство на регионалното развитие',
                'institution_id' => [146, 0]
            ],
            'МРР, МИП' => [
                'importer' => 'Министерство на регионалното развитие, Министерство на инвестиционното проектиране',
                'institution_id' => [0, 0]
            ],
            'МИЕ, МРР' => [
                'importer' => 'Министерство на икономиката и енергетиката, Министерство на регионалното развитие',
                'institution_id' => [0, 0]
            ],
            'МРР, МФ' => [
                'importer' => 'Министерство на регионалното развитие, Министерство на финансите',
                'institution_id' => [0, 146]
            ],
            'МИЕТ, МРЕП' => [
                'importer' => 'Министерство на икономиката, енергетиката и туризма, Министър за развитие на електронното правителство',
                'institution_id' => [0, 0]
            ],
            'МУСЕС, МТИТС' => [
                'importer' => 'Министър по управление на средставата от Европейския съюз, Министерство на транспорта, информационните технологии и съобщенията',
                'institution_id' => [0, 0]
            ],
            'МИЕТ, МУСЕС' => [
                'importer' => 'Министерство на икономиката, енергетиката и туризма, Министър по управление на средставата от Европейския съюз',
                'institution_id' => [0, 0]
            ],
            'МТИТС, МУСЕС' => [
                'importer' => 'Министерство на транспорта, информационните технологии и съобщенията, Министър по управление на средставата от Европейския съюз',
                'institution_id' => [0, 0]
            ],
            'ВОМН, МРРБ' => [
                'importer' => 'Министерство на образованието, младежта и науката, Министерство на регионалното развитие и благоустройството',
                'institution_id' => [0, 142]
            ],
            'МРРБ МО' => [
                'importer' => 'Министерство на регионалното развитие и благоустройството, Министерство на отбраната',
                'institution_id' => [142, 140]
            ],
            'МЗ МОН МЗП' => [
                'importer' => 'Министерство на здравеопазването, Министерство на образованието и науката, Министерство на земеделието и продоволствието',
                'institution_id' => [132, 138, 0]
            ],
            'МИС МФ' => [
                'importer' => 'Министерство на извънредните ситуации, Министерство на финансите',
                'institution_id' => [0, 146]
            ],
            'МФ МРРБ МТ' => [
                'importer' => 'Министерство на финансите, Министерство на регионалното развитие и благоустройството, Министерство на туризма',
                'institution_id' => [146, 142, 145]
            ],
            'МРРБ МФ' => [
                'importer' => 'Министерство на регионалното развитие и благоустройството, Министерство на финансите',
                'institution_id' => [142, 146]
            ],
            'МВнР МТ МИЕ' => [
                'importer' => 'Министерство на външните работи, Министерство на туризма, Министерство на икономиката и енергетиката',
                'institution_id' => [128, 145, 0]
            ],
            'МРРБ МТСП МИЕ' => [
                'importer' => 'Министерство на регионалното развитие и благоустройството, Министерство на труда и социалната политика, Министерство на икономиката и енергетиката',
                'institution_id' => [142, 144, 0]
            ],
            'МВнР МФ МТ' => [
                'importer' => 'Министерство на външните работи, Министерство на финансите, Министерство на туризма',
                'institution_id' => [128, 146, 145]
            ],
            'МВнР МО' => [
                'importer' => 'Министерство на външните работи, Министерство на отбраната',
                'institution_id' => [128, 140]
            ],
            'МО МИЕ' => [
                'importer' => 'Министерство на отбраната, Министерство на икономиката и енергетиката',
                'institution_id' => [140, 0]
            ],
            'МВнР МТСП' => [
                'importer' => 'Министерство на външните работи, Министерство на труда и социалната политика',
                'institution_id' => [128, 144]
            ],
            'МП МО' => [
                'importer' => 'Министерство на правосъдието, Министерство на отбраната',
                'institution_id' => [141, 140]
            ],
            'МЗ МРРБ' => [
                'importer' => 'Министерство на здравеопазването, Министерство на регионалното развитие и благоустройството',
                'institution_id' => [132, 142]
            ],
            'МО МФ' => [
                'importer' => 'Министерство на отбраната, Министерство на финансите',
                'institution_id' => [140, 146]
            ],
            'МВнР МК' => [
                'importer' => 'Министерство на външните работи, Министерство на културата',
                'institution_id' => [128, 136]
            ],
            'МВнР МИЕ' => [
                'importer' => 'Министерство на външните работи, Министерство на икономиката и енергетиката',
                'institution_id' => [128, 0]
            ],
            'МЕВ МВР' => [
                'importer' => 'Министър по европейските въпроси, Министерство на вътрешните работи',
                'institution_id' => [0, 129]
            ],
            'МЗ МДПБА' => [
                'importer' => 'Министерство на здравеопазването, Министерство на държавната политика при бедствия и аварии',
                'institution_id' => [132, 0]
            ],
            'МК МВнР' => [
                'importer' => 'Министерство на културата, Министерство на външните работи',
                'institution_id' => [136, 128]
            ],
            'МК МОН' => [
                'importer' => 'Министерство на културата, Министерство на образованието и науката',
                'institution_id' => [136, 138]
            ],
            'МИЕ МВнР' => [
                'importer' => 'Министерство на икономиката и енергетиката, Министерство на външните работи',
                'institution_id' => [0, 128]
            ],
            'МТСП МФ' => [
                'importer' => 'Министерство на труда и социалната политика, Министерство на финансите',
                'institution_id' => [144, 146]
            ],
            'МИ МОН' => [
                'importer' => 'Министерство на икономиката, Министерство на образованието и науката',
                'institution_id' => [0, 138]
            ],
            'МТС и МФ' => [
                'importer' => 'Министерство на транспорта и съобщенията, Министерство на финансите',
                'institution_id' => [143, 146]
            ],
            'МК МФ' => [
                'importer' => 'Министерство на културата, Министерство на финансите',
                'institution_id' => [136, 146]
            ],
            'МЗ и МП' => [
                'importer' => 'Министерство на здравеопазването, Министерство на правосъдието',
                'institution_id' => [132, 141]
            ],
            'МИ МТСП' => [
                'importer' => 'Министерство на икономиката, Министерство на труда и социалната политика',
                'institution_id' => [0, 144]
            ],
            'МИ МЕЕР' => [
                'importer' => 'Министерство на икономиката, Министерство на енергетиката и енергийните ресурси',
                'institution_id' => [0, 0]
            ],
            'МО МРРБ' => [
                'importer' => 'Министерство на отбраната, Министерство на регионалното развитие и благоустройството',
                'institution_id' => [140, 142]
            ],
            'МИ МЗ' => [
                'importer' => 'Министерство на икономиката, Министерство на здравеопазването',
                'institution_id' => [0, 132]
            ],
            'заместник министър-председателят и министър на вътрешните работи, МИП' => [
                'importer' => 'заместник министър-председателят и министър на вътрешните работи, Министерство на инвестиционното проектиране',
                'institution_id' => [127, 0]
            ],
            'заместник министър-председател и министър на правосъдието, МРР, МИП' => [
                'importer' => 'заместник министър-председател и министър на правосъдието, Министерство на регионалното развитие, Министерство на инвестиционното проектиране',
                'institution_id' => [127, 0, 0]
            ],
            'ЗМПИР, заместник министър-председателят и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председател по икономическото развитие, заместник министър-председателят и министър на вътрешните работи',
                'institution_id' => [127]
            ],
            'ЗМПИР, заместник министър-председателят и министър на правосъдието' => [
                'importer' => 'Заместник министър-председател по икономическото развитие, заместник министър-председателят и министър на правосъдието',
                'institution_id' => [127]
            ],
            ':FIL' => [
                'importer' => ':FIL',
                'institution_id' => null,
            ],
            ':RE' => [
                'importer' => ':RE',
                'institution_id' => null,
            ],
            'ДА' => [
                'importer' => 'ДА',
                'institution_id' => null,
            ],
            'ДАЕЕР' => [
                'importer' => 'ДАЕЕР',
                'institution_id' => null,
            ],
            'ДАИТС' => [
                'importer' => 'Държавна агенция по информационни технологии и съобщения',
                'institution_id' => null,
            ],
            'ЕВ' => [
                'importer' => 'ЕВ',
                'institution_id' => null,
            ],
            'зам. министър-председателят и председател на ЦКБППМН' => [
                'importer' => 'Заместник министър-председателят и председател на ЦКБППМН',
                'institution_id' => null,
            ],
            'и.д. главен секретар на МС' => [
                'importer' => 'и.д. главен секретар на Министерски съвет и неговата администрация',
                'institution_id' => null,
            ],
            'М3' => [
                'importer' => 'Министерство на здравеопазването',
                'institution_id' => 132,
            ],
            'МВнР' => [
                'importer' => 'Министерство на външните работи',
                'institution_id' => 128,
            ],
            'МВНР' => [
                'importer' => 'Министерство на външните работи',
                'institution_id' => 128,
            ],
            'МвНР' => [
                'importer' => 'Министерство на външните работи',
                'institution_id' => 128,
            ],
            'МВнр' => [
                'importer' => 'Министерство на външните работи',
                'institution_id' => 128,
            ],
            'МвнР' => [
                'importer' => 'Министерство на външните работи',
                'institution_id' => 128,
            ],
            'МВР' => [
                'importer' => 'Министерство на вътрешните работи',
                'institution_id' => 129,
            ],
            'МВр' => [
                'importer' => 'Министерство на вътрешните работи',
                'institution_id' => 129,
            ],
            'МДА' => [
                'importer' => 'Министър на държавната администрация',
                'institution_id' => 127,
            ],
            'МДААР' => [
                'importer' => 'МДААР',
                'institution_id' => null,
            ],
            'МДПБА' => [
                'importer' => 'Министерство на държавната политика при бедствия и аварии',
                'institution_id' => null,
            ],
            'МЕВ' => [
                'importer' => 'Министър по европейските въпроси',
                'institution_id' => null,
            ],
            'МЕЕР' => [
                'importer' => 'Министерство на енергетиката и енергийните ресурси',
                'institution_id' => null,
            ],
            'МЗ' => [
                'importer' => 'Министерство на здравеопазването',
                'institution_id' => 132,
            ],
            'Мз' => [
                'importer' => 'Министерство на здравеопазването',
                'institution_id' => 132,
            ],
            'МЗем' => [
                'importer' => 'Министерство на земеделието',
                'institution_id' => 133,
            ],
            'МЗГ' => [
                'importer' => 'Министерство на земеделието и горите',
                'institution_id' => null,
            ],
            'МЗГАР' => [
                'importer' => 'Министерство на земеделието, горите и аграрната реформа',
                'institution_id' => null,
            ],
            'МЗГБ' => [
                'importer' => 'Министерство на земеделието и горите',
                'institution_id' => null,
            ],
            'МЗГП' => [
                'importer' => 'МЗГП',
                'institution_id' => null,
            ],
            'МЗП' => [
                'importer' => 'Министерство на земеделието и продоволствието',
                'institution_id' => null,
            ],
            'МЗХ' => [
                'importer' => 'Министерство на земеделието и храните',
                'institution_id' => 133,
            ],
            'мзх' => [
                'importer' => 'Министерство на земеделието и храните',
                'institution_id' => 133,
            ],
            'МЗХГ' => [
                'importer' => 'Министерство на земеделието, храните и горите',
                'institution_id' => null,
            ],
            'МИ' => [
                'importer' => 'Министерство на икономиката',
                'institution_id' => null,
            ],
            'МИЕ' => [
                'importer' => 'Министерство на икономиката и енергетиката',
                'institution_id' => null,
            ],
            'МИЕТ' => [
                'importer' => 'Министерство на икономиката, енергетиката и туризма',
                'institution_id' => null,
            ],
            'МИС' => [
                'importer' => 'Министерство на извънредните ситуации',
                'institution_id' => null,
            ],
            'МБПСЕС' => [
                'importer' => 'Министерство на българското председателство на Съвета на ЕС',
                'institution_id' => null,
            ],
            'МК' => [
                'importer' => 'Министерство на културата',
                'institution_id' => 136,
            ],
            'МКТ' => [
                'importer' => 'МКТ',
                'institution_id' => null,
            ],
            'ММС' => [
                'importer' => 'Министерство на младежта и спорта',
                'institution_id' => 137,
            ],
            'ММСМС-ДирЕИОМФИ' => [
                'importer' => 'Министерство на младежта и спорта',
                'institution_id' => 137,
            ],
            'МНО' => [
                'importer' => 'МНО',
                'institution_id' => null,
            ],
            'МО' => [
                'importer' => 'Министерство на отбраната',
                'institution_id' => 140,
            ],
            'Мо' => [
                'importer' => 'Министерство на отбраната',
                'institution_id' => 140,
            ],
            'мо' => [
                'importer' => 'Министерство на отбраната',
                'institution_id' => 140,
            ],
            'МОМН' => [
                'importer' => 'Министерство на образованието, младежта и науката',
                'institution_id' => null,
            ],
            'МОН' => [
                'importer' => 'Министерство на образованието и науката',
                'institution_id' => 138,
            ],
            'МОСВ' => [
                'importer' => 'Министерство на околната среда и водите',
                'institution_id' => 139,
            ],
            'МП' => [
                'importer' => 'Министерство на правосъдието',
                'institution_id' => 141,
            ],
            'мп' => [
                'importer' => 'Министерство на правосъдието',
                'institution_id' => 141,
            ],
            'МИР' => [
                'importer' => 'Министерство на иновациите и растежа',
                'institution_id' => 135,
            ],
            'М-во на правосъдието' => [
                'importer' => 'М-во на правосъдието',
                'institution_id' => 141,
            ],
            'м-во на правосъдието' => [
                'importer' => 'М-во на правосъдието',
                'institution_id' => 141,
            ],
            'МППЕИ' => [
                'importer' => 'Министерство на правосъдието и правната евроинтеграция',
                'institution_id' => null,
            ],
            'МПр' => [
                'importer' => 'МПр',
                'institution_id' => null,
            ],
            'МРРБ' => [
                'importer' => 'Министерство на регионалното развитие и благоустройството',
                'institution_id' => 142,
            ],
            'мррб' => [
                'importer' => 'Министерство на регионалното развитие и благоустройството',
                'institution_id' => 142,
            ],
            'МС' => [
                'importer' => 'Министерски съвет и неговата администрация',
                'institution_id' => 127,
            ],
            'МТ' => [
                'importer' => 'Министерство на туризма',
                'institution_id' => 145,
            ],
            'МТИТС' => [
                'importer' => 'Министерство на транспорта, информационните технологии и съобщенията',
                'institution_id' => null,
            ],
            'МТС' => [
                'importer' => 'Министерство на транспорта и съобщенията',
                'institution_id' => 143,
            ],
            'МТС_' => [
                'importer' => 'Министерство на транспорта и съобщенията',
                'institution_id' => 143,
            ],
            'МТСГ' => [
                'importer' => 'МТСГ',
                'institution_id' => null,
            ],
            'МТСП' => [
                'importer' => 'Министерство на труда и социалната политика',
                'institution_id' => 144,
            ],
            'МТТ' => [
                'importer' => 'Министерство на търговията и туризма',
                'institution_id' => null,
            ],
            'МФ' => [
                'importer' => 'Министерство на финансите',
                'institution_id' => 146,
            ],
            'мф' => [
                'importer' => 'Министерство на финансите',
                'institution_id' => 146,
            ],
            'МФВС' => [
                'importer' => 'Министерство на физическото възпитание и спорта',
                'institution_id' => null,
            ],
            'МИИ' => [
                'importer' => 'МИИ',
                'institution_id' => 134,
            ],
            'министър без портфейл' => [
                'importer' => 'министър без портфейл',
                'institution_id' => null,
            ],
            'министър без портфейл (Ал. Праматарски)' => [
                'importer' => 'министър без портфейл (Ал. Праматарски)',
                'institution_id' => null,
            ],
            'министър без портфейл (Б. Димитров)' => [
                'importer' => 'министър без портфейл (Б. Димитров)',
                'institution_id' => null,
            ],
            'министър без портфейл (М. Кунева)' => [
                'importer' => 'министър без портфейл (М. Кунева)',
                'institution_id' => null,
            ],
            'министър без портфейл (Н. Моллов)' => [
                'importer' => 'министър без портфейл (Н. Моллов)',
                'institution_id' => null,
            ],
            'министър без портфейл (Ф. Хюсменова)' => [
                'importer' => 'министър без портфейл (Ф. Хюсменова)',
                'institution_id' => null,
            ],
            'министър-председателят' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'министър-председателя' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'Министър-председателят' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'Министър-председател' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'мин.-председателят' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'Министър-председателя' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'МИНИСТЪР-ПРЕДСЕДАТЕЛЯ' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'мин-председателя' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'Мин.-председателя' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'Мин.- председателя' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'мин.- председателя' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'миншстэр-председателят' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'министър-председател' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'мин.-председател' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'МИНИСТЪР-ПРЕДСЕДАТЕЛЯТ' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'министър- председател' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'министър- председателят' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'Министър-председателят на РБ' => [
                'importer' => 'Министър-председателят',
                'institution_id' => 127,
            ],
            'министърът на държ.администрац' => [
                'importer' => 'Министърът на държ.администрация',
                'institution_id' => 127,
            ],
            'Министърът на държавната адм.' => [
                'importer' => 'Министърът на държ.администрация',
                'institution_id' => 127,
            ],
            'Министърът на държ. администр.' => [
                'importer' => 'Министърът на държ.администрация',
                'institution_id' => 127,
            ],
            'М-рът на държ. адм.' => [
                'importer' => 'Министърът на държ.администрация',
                'institution_id' => 127,
            ],
            'м-рът на държ. администрация' => [
                'importer' => 'Министърът на държ.администрация',
                'institution_id' => 127,
            ],
            'министърът на държ.администр.' => [
                'importer' => 'Министърът на държ.администрация',
                'institution_id' => 127,
            ],
            'м-рът на държ. адм.' => [
                'importer' => 'Министърът на държ.администрация',
                'institution_id' => 127,
            ],
            'М-рът на държ. администрация' => [
                'importer' => 'Министърът на държ.администрация',
                'institution_id' => 127,
            ],
            'зам. министър-председател' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам.-министър-председателят' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам. министър-председателят М. Плугчиева' => [
                'importer' => 'Заместник министър-председателят М. Плугчиева',
                'institution_id' => 127,
            ],
            'заместник министър-председател' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам.министър-председателят' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам. министър-председателят' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'Зам.мин.-председателят' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'заместник-министър председател' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'Зам.мин.-председател' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам.мин.-председателят' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'Заместник мин.-председателят' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам. мин.-председателят' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам.министър-председател' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам м-предс.' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам. министър-председателя' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам. мин.-председ.' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'Зам. министър-председателят' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам.мин-председателя' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам.мин.-председател' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам.мин.-председ.' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам. мин.-председател' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам.мин.-предс.' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам.мин-предс.' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'Зам-мин предс.' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'Зам. министър-председателя' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам. мин.-председателя' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'Зм. мин.-предс.' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'Зам. министър-председател' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'заместник министър-председателят' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'Заместник министър-председател' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам. мин. -предс.' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам. мин. - председателят' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам.мин.-председат.' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'зам. мин.-предс.' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'замeстник министър-председател' => [
                'importer' => 'Заместник министър-председателят',
                'institution_id' => 127,
            ],
            'м-р Ф. Хюсменова' => [
                'importer' => 'М-р Ф. Хюсменова',
                'institution_id' => 127,
            ],
            'М-р без портфейл Ф. Хюсменова' => [
                'importer' => 'М-р без портфейл Ф. Хюсменова',
                'institution_id' => 127,
            ],
            'М-ра без портфейл Ф. Хюсменова' => [
                'importer' => 'М-р без портфейл Ф. Хюсменова',
                'institution_id' => 127,
            ],
            'М-р Ф. Хюсменова' => [
                'importer' => 'М-р Ф. Хюсменова',
                'institution_id' => 127,
            ],
            'м-р Фелиз Хюсменова' => [
                'importer' => 'М-р Ф. Хюсменова',
                'institution_id' => 127,
            ],
            'м-р Ф.Хюсменова' => [
                'importer' => 'М-р Ф. Хюсменова',
                'institution_id' => 127,
            ],
            'м-р ф. Хюсменова' => [
                'importer' => 'М-р Ф. Хюсменова',
                'institution_id' => 127,
            ],
            'м-р Хюсменова' => [
                'importer' => 'М-р Ф. Хюсменова',
                'institution_id' => 127,
            ],
            'М-р М. Кунева' => [
                'importer' => 'М-р М. Кунева',
                'institution_id' => 127,
            ],
            'м-р М. Кунева' => [
                'importer' => 'М-р М. Кунева',
                'institution_id' => 127,
            ],
            'М-р Ал. Праматарски' => [
                'importer' => 'М-р Ал. Праматарски',
                'institution_id' => 127,
            ],
            'м-р Александър Праматарски' => [
                'importer' => 'М-р Александър Праматарски',
                'institution_id' => 127,
            ],
            'министър Ал. Праматарски' => [
                'importer' => 'М-р Александър Праматарски',
                'institution_id' => 127,
            ],
            'м-р Ал. Праматарски' => [
                'importer' => 'М-р Александър Праматарски',
                'institution_id' => 127,
            ],
            'м-р А. Праматарски' => [
                'importer' => 'М-р Александър Праматарски',
                'institution_id' => 127,
            ],
            'А. Праматарски' => [
                'importer' => 'М-р Александър Праматарски',
                'institution_id' => 127,
            ],
            'м-р Праматарски' => [
                'importer' => 'М-р Александър Праматарски',
                'institution_id' => 127,
            ],
            'м-р Б. Димитров' => [
                'importer' => 'М-р Б. Димитров',
                'institution_id' => 127,
            ],
            'м-р Б. Нанев' => [
                'importer' => 'М-р Б. Нанев',
                'institution_id' => 127,
            ],
            'М-р Д. Калчев' => [
                'importer' => 'М-р Д. Калчев',
                'institution_id' => 127,
            ],
            'м-р Д. Калчев' => [
                'importer' => 'М-р Д. Калчев',
                'institution_id' => 127,
            ],
            'м-р Д.Калчев' => [
                'importer' => 'М-р Д. Калчев',
                'institution_id' => 127,
            ],
            'м-р Емилия Масларова' => [
                'importer' => 'М-р Емилия Масларова',
                'institution_id' => 127,
            ],
            'м-р Моллов' => [
                'importer' => 'М-р Моллов',
                'institution_id' => 127,
            ],
            'М-р Н. Моллов' => [
                'importer' => 'М-р Моллов',
                'institution_id' => 127,
            ],
            'м-р Н. Моллов' => [
                'importer' => 'М-р Моллов',
                'institution_id' => 127,
            ],
            'заместник министър-председател по икономическото развитие' => [
                'importer' => 'Заместник министър-председателят по икономическото развитие',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по икономическото развитие;' => [
                'importer' => 'Заместник министър-председателят по икономическото развитие',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по икономическото развитие' => [
                'importer' => 'Заместник министър-председателят по икономическото развитие',
                'institution_id' => 127,
            ],
            'зам. министър-председателят по икономическото развитие' => [
                'importer' => 'Заместник министър-председателят по икономическото развитие',
                'institution_id' => 127,
            ],
            'замeстник министър-председател по икономическото развитие' => [
                'importer' => 'Заместник министър-председателят по икономическото развитие',
                'institution_id' => 127,
            ],
            'заместник министър-председател и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председателят и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'зам. министър-председател и министър на правосъдието' => [
                'importer' => 'Заместник министър-председателят и министър на правосъдието',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по пръвосъдие' => [
                'importer' => 'Заместник министър-председателят и министър на правосъдието',
                'institution_id' => 127,
            ],
            'заместни министър-председател и министър на правосъдието' => [
                'importer' => 'Заместник министър-председателят и министър на правосъдието',
                'institution_id' => 127,
            ],
            'заместник-министър председателят и министър на правосъдието' => [
                'importer' => 'Заместник министър-председателят и министър на правосъдието',
                'institution_id' => 127,
            ],
            'заместник министър-председателят и министър на правосъдието' => [
                'importer' => 'Заместник министър-председателят и министър на правосъдието',
                'institution_id' => 127,
            ],
            'замeстник министър-председател и министър на правосъдието' => [
                'importer' => 'Заместник министър-председателят и министър на правосъдието',
                'institution_id' => 127,
            ],
            'заместник министър-председател по правосъдие' => [
                'importer' => 'Заместник министър-председател по правосъдие',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по правосъдие' => [
                'importer' => 'Заместник министър-председател по правосъдие',
                'institution_id' => 127,
            ],
            'заместник министър-председател и министър на правосъдието' => [
                'importer' => 'Заместник министър-председателят и министър на правосъдието',
                'institution_id' => 127,
            ],
            'зам. министър-председателят и министър на правосъдието' => [
                'importer' => 'Заместник министър-председателят и министър на правосъдието',
                'institution_id' => 127,
            ],
            'вътрешен ред и сигурност и министър на правосъдието' => [
                'importer' => 'вътрешен ред и сигурност и министър на правосъдието',
                'institution_id' => 127,
            ],
            'министър-председател по вътрешен ред и сигурност и министър на отбраната' => [
                'importer' => 'Министър-председател по вътрешен ред и сигурност и министър на отбраната',
                'institution_id' => 127,
            ],
            'заместник министър-председател по вътрешен ред и сигурност и министър на отшбраната' => [
                'importer' => 'Заместник министър-председател по вътрешен ред и сигурност и министър на отбраната',
                'institution_id' => 127,
            ],
            'министър-председателят и министър на външните работи' => [
                'importer' => 'Министър-председателят и министър на външните работи',
                'institution_id' => 127,
            ],
            'министър-председателят и министър на външните работи М. Райков' => [
                'importer' => 'Министър-председателят и министър на външните работи',
                'institution_id' => 127,
            ],
            'зам. министър-председателят и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председателят и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'заместник министър-председателят и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председателят и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'замистник министър-председателят и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председателят и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'замстник министър-председателят и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председателят и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'заместник-министър председателят и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председателят и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'заместник министър-председател и министър на външните работи' => [
                'importer' => 'Заместник министър-председателят и министър на външните работи',
                'institution_id' => 127,
            ],
            'заместник-министърът и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председателят и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'заместник министър-председател по икономическа политика' => [
                'importer' => 'Заместник министър-председател по икономическа политика',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по икономическа политика' => [
                'importer' => 'Заместник министър-председател по икономическа политика',
                'institution_id' => 127,
            ],
            'заместник министър председател по икономическа политика' => [
                'importer' => 'Заместник министър-председател по икономическа политика',
                'institution_id' => 127,
            ],
            'заместник министър-председател по европейските фондове' => [
                'importer' => 'Заместник министър-председател по европейските фондове',
                'institution_id' => 127,
            ],
            'заместник министър-председател по европейските фондове и икономическа политика' => [
                'importer' => 'Заместник министър-председател по европейските фондове и икономическа политика',
                'institution_id' => 127,
            ],
            'заместник. министър-председател по европейските фондове и икономическата политика' => [
                'importer' => 'Заместник министър-председател по европейските фондове и икономическа политика',
                'institution_id' => 127,
            ],
            'заместник министър-председател по европейските фондове и икономическата политика' => [
                'importer' => 'Заместник министър-председател по европейските фондове и икономическа политика',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по европейските фондове и икономическата политика' => [
                'importer' => 'Заместник министър-председател по европейските фондове и икономическа политика',
                'institution_id' => 127,
            ],
            'замeестник министър-председател по обществения ред и сигурност и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председател по обществения ред и сигурност и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'заместник министър-председател по обществен ред и сигурност и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председател по обществения ред и сигурност и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'заместник министър-председател по обществения ред и сигурност и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председател по обществения ред и сигурност и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'заместник министър-председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'Заместник министър-председател по обществения ред и сигурност и министър на отбраната',
                'institution_id' => 127,
            ],
            'заместник министър-председател по обществен ред и сигурност и министър на отбраната' => [
                'importer' => 'Заместник министър-председател по обществения ред и сигурност и министър на отбраната',
                'institution_id' => 127,
            ],
            'Заместник министър-председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'Заместник министър-председател по обществения ред и сигурност и министър на отбраната',
                'institution_id' => 127,
            ],
            'замeстник министър-председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'Заместник министър-председател по обществения ред и сигурност и министър на отбраната',
                'institution_id' => 127,
            ],
            'заместник министър председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'Заместник министър-председател по обществения ред и сигурност и министър на отбраната',
                'institution_id' => 127,
            ],
            'замeтник министър-председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'Заместник министър-председател по обществения ред и сигурност и министър на отбраната',
                'institution_id' => 127,
            ],
            'замстник министър-председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'Заместник министър-председател по обществения ред и сигурност и министър на отбраната',
                'institution_id' => 127,
            ],
            'заместник министър председател по правосъдната реформа и министър на външните работи' => [
                'importer' => 'Заместник министър-председател по правосъдната реформа и сигурност и министър на външните работи',
                'institution_id' => 127,
            ],
            'замeстник министър-председател по правосъдната реформа и министър на външните работи' => [
                'importer' => 'Заместник министър-председател по правосъдната реформа и сигурност и министър на външните работи',
                'institution_id' => 127,
            ],
            'заместник министър-председател по правосъдната реформа и министър на външните работи' => [
                'importer' => 'Заместник министър-председател по правосъдната реформа и сигурност и министър на външните работи',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по правосъдната реформа и министър на външните работи' => [
                'importer' => 'Заместник министър-председател по правосъдната реформа и сигурност и министър на външните работи',
                'institution_id' => 127,
            ],
            'заместник министър - председател по обществения ред и сигурността и министър на отбраната' => [
                'importer' => 'Заместник министър-председател по обществения ред и сигурност и министър на отбраната',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по социална политика и министър на труда и социалната политика' => [
                'importer' => 'Заместник министър-председател по социална политика и министър на труда и социалната политика',
                'institution_id' => 127,
            ],
            'заместник. министър-председател по социална политика и министър на труда и социалната политика' => [
                'importer' => 'Заместник министър-председател по социална политика и министър на труда и социалната политика',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по социалните политики и министър на труда и социалната политика' => [
                'importer' => 'Заместник министър-председател по социална политика и министър на труда и социалната политика',
                'institution_id' => 127,
            ],
            'заместник министър- председател по социалните политики и министър на труда и социалната политика' => [
                'importer' => 'Заместник министър-председател по социална политика и министър на труда и социалната политика',
                'institution_id' => 127,
            ],
            'заместник министър-председател по социалните политики и министър на труда и социалната политика' => [
                'importer' => 'Заместник министър-председател по социална политика и министър на труда и социалната политика',
                'institution_id' => 127,
            ],
            'замeстник министър-председател по социална политика и министър на труда и социалната политика' => [
                'importer' => 'Заместник министър-председател по социална политика и министър на труда и социалната политика',
                'institution_id' => 127,
            ],
            'заместник министър-председател по социална политика и министър на труда и социалната политика' => [
                'importer' => 'Заместник министър-председател по социална политика и министър на труда и социалната политика',
                'institution_id' => 127,
            ],
            'зам. министър-председател по икономическите и социалните политики и министър на труда и социалната политика' => [
                'importer' => 'Заместник министър-председател по икономическите и социалните политики и министър на труда и социалната политика',
                'institution_id' => 127,
            ],
            'заместник министър-председател по икономическите и социалните политики и министър на труда и социалната политика;' => [
                'importer' => 'Заместник министър-председател по икономическите и социалните политики и министър на труда и социалната политика',
                'institution_id' => 127,
            ],
            'заместник министър-председател по икономическите и социалните политики и министър на труда и социалната политика' => [
                'importer' => 'Заместник министър-председател по икономическите и социалните политики и министър на труда и социалната политика',
                'institution_id' => 127,
            ],
            'заместник министър-председател по управление на средствата от Европейския съюз' => [
                'importer' => 'Заместник министър-председател по управление на средствата от Европейския съюз',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по управление на средствата от Европейския съюз' => [
                'importer' => 'Заместник министър-председател по управление на средствата от Европейския съюз',
                'institution_id' => 127,
            ],
            'замeстник министър-председател по управление на европейските средства' => [
                'importer' => 'Заместник министър-председател по управление на европейските средства',
                'institution_id' => 127,
            ],
            'заместник министър-председател по управление на европейските средства' => [
                'importer' => 'Заместник министър-председател по управление на европейските средства',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по управление на европейските средства' => [
                'importer' => 'Заместник министър-председател по управление на европейските средства',
                'institution_id' => 127,
            ],
            'заместник министър-председател по еврофондовете министър на финансите' => [
                'importer' => 'Заместник министър-председател по еврофондовете министър на финансите',
                'institution_id' => 127,
            ],
            'заместник министър председател по еврофондовете и министър на финансите' => [
                'importer' => 'Заместник министър-председател по еврофондовете министър на финансите',
                'institution_id' => 127,
            ],
            'заместник министър-председател по еврофондовете и министър на финансите' => [
                'importer' => 'Заместник министър-председател по еврофондовете министър на финансите',
                'institution_id' => 127,
            ],
            'заместнек министър-председател по еврофондовете и министър на финансите' => [
                'importer' => 'Заместник министър-председател по еврофондовете министър на финансите',
                'institution_id' => 127,
            ],
            'замаместник министър-председател по еврофондовете и министър на финансите' => [
                'importer' => 'Заместник министър-председател по еврофондовете министър на финансите',
                'institution_id' => 127,
            ],
            'зам. министър председател по икономическата и демографската политика и министър на туризма' => [
                'importer' => 'Заместник министър-председател по икономическата и демографската политика и министър на туризма',
                'institution_id' => 127,
            ],
            'заместник министър председател по икономическата и демографската политика и министър на туризма' => [
                'importer' => 'Заместник министър-председател по икономическата и демографската политика и министър на туризма',
                'institution_id' => 127,
            ],
            'заместник министър-председател по икономическата и демографската политика и министър на туризма' => [
                'importer' => 'Заместник министър-председател по икономическата и демографската политика и министър на туризма',
                'institution_id' => 127,
            ],
            'заместник министър-председател по икономическата и демографската политика' => [
                'importer' => 'Заместник министър-председател по икономическата и демографската политика',
                'institution_id' => 127,
            ],
            'заместник министър-председател по икономическата демографската политика' => [
                'importer' => 'Заместник министър-председател по икономическата и демографската политика',
                'institution_id' => 127,
            ],
            'замeстник министър-председател по икономическата и демографската политика' => [
                'importer' => 'Заместник министър-председател по икономическата и демографската политика',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по демографската и социалната политика и министър на труда и социалната политика' => [
                'importer' => 'Заместник министър-председател по демографската и социалната политика и министър на труда и социалната политикс',
                'institution_id' => 127,
            ],
            'заместник министър-председател по демографската и социалната политика и министър на труда и социалната политика' => [
                'importer' => 'Заместник министър-председател по демографската и социалната политика и министър на труда и социалната политикс',
                'institution_id' => 127,
            ],
            'замeстник министър-председател по демографската и социалната политика и министър на труда и социалната политика' => [
                'importer' => 'Заместник министър-председател по демографската и социалната политика и министър на труда и социалната политикс',
                'institution_id' => 127,
            ],
            'заместник министър-председател по икономическите политики и министър на транспорта и съобщенията' => [
                'importer' => 'Заместник министър-председател по икономическите политики и министър на транспорта и съобщенията',
                'institution_id' => 127,
            ],
            'заместник министър-председател по регионалното развитие и благоустройството и министър на регионалното развитие и благоустройството' => [
                'importer' => 'Заместник министър-председател по регионалното развитие и благоустройството и министър на регионалното развитие и благоустройството',
                'institution_id' => 127,
            ],
            'заместник министър- председател по икономиката и индустрията и министър на икономиката и индустрията' => [
                'importer' => 'Заместник министър-председател по икономиката и индустрията и министър на икономиката и индустрията',
                'institution_id' => 127,
            ],
            'заместник министър-председател по икономиката и министър на икономиката и индустрията' => [
                'importer' => 'Заместник министър-председател по икономиката и индустрията и министър на икономиката и индустрията',
                'institution_id' => 127,
            ],
            'заместник министър-председател по икономиката и индустрията и министър на икономиката и индустрията' => [
                'importer' => 'Заместник министър-председател по икономиката и индустрията и министър на икономиката и индустрията',
                'institution_id' => 127,
            ],
            'заместник министър-председател по климатичните политики и министър на околната среда и водите' => [
                'importer' => 'Заместник министър-председател по климатичните политики и министър на околната среда и водите',
                'institution_id' => 127,
            ],
            'заместник министърпредседател по климатични политики и министър на околната среда и водите' => [
                'importer' => 'Заместник министър-председател по климатичните политики и министър на околната среда и водите',
                'institution_id' => 127,
            ],
            'заместник министър-председател по климатични политики и министър на околната среда и водите' => [
                'importer' => 'Заместник министър-председател по климатичните политики и министър на околната среда и водите',
                'institution_id' => 127,
            ],
            'замесник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по коалиционна политика и държавна администрация и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'заместник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'заместник министър-председател по коалиционна поли¬тика и държавна администрация и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'замeстник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи' => [
                'importer' => 'Заместник министър-председател по коалиционна политика и държавна администрация и министър на вътрешните работи',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по коалиционна политика и държавна администрация' => [
                'importer' => 'Заместник министър-председател по коалиционна политика и държавна администрация',
                'institution_id' => 127,
            ],
            'заместник министър-председател по коалиционна политика и държавна администрация' => [
                'importer' => 'Заместник министър-председател по коалиционна политика и държавна администрация',
                'institution_id' => 127,
            ],
            'заместник министър-председател по координация на европейските политикии институционалните въпроси и министър на образованието и науката' => [
                'importer' => 'Заместник министър-председател по координация на европейските политики институционалните въпроси и министър на образованието и науката',
                'institution_id' => 127,
            ],
            'заместник министър-председател по координация на европейските политики и институционалние въпроси и министър на образованието и науката' => [
                'importer' => 'Заместник министър-председател по координация на европейските политики институционалните въпроси и министър на образованието и науката',
                'institution_id' => 127,
            ],
            'замeстник министър-председател по координация на европейските политики и институционалните въпроси и министър на образованието и науката' => [
                'importer' => 'Заместник министър-председател по координация на европейските политики институционалните въпроси и министър на образованието и науката',
                'institution_id' => 127,
            ],
            'замаместник министър-председател по координация на европейските политики и институционалните въпроси и министър на образованието и науката' => [
                'importer' => 'Заместник министър-председател по координация на европейските политики институционалните въпроси и министър на образованието и науката',
                'institution_id' => 127,
            ],
            'зам. министър-председател по координация на европейските политики и институционалните въпроси и министър на образованието и науката' => [
                'importer' => 'Заместник министър-председател по координация на европейските политики институционалните въпроси и министър на образованието и науката',
                'institution_id' => 127,
            ],
            'заместник министър-председател по координация на европейските политики и институционалните въпроси и министър на образованието и науката' => [
                'importer' => 'Заместник министър-председател по координация на европейските политики институционалните въпроси и министър на образованието и науката',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по координация на европейските политики и институционалните въпроси и министър на образованието и науката' => [
                'importer' => 'Заместник министър-председател по координация на европейските политики институционалните въпроси и министър на образованието и науката',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по координация на европейските политики и инсти-туционалните въпроси' => [
                'importer' => 'Заместник министър-председател по координация на европейските политики и институционалните въпроси',
                'institution_id' => 127,
            ],
            'заместник министър-председател по координация на европейските политики и институционалните въпроси' => [
                'importer' => 'Заместник министър-председател по координация на европейските политики и институционалните въпроси',
                'institution_id' => 127,
            ],
            'заместник министър-председателят по координация на европейските политики и институционалните въпроси' => [
                'importer' => 'Заместник министър-председател по координация на европейските политики и институционалните въпроси',
                'institution_id' => 127,
            ],
            'заместник министър-председател  по подготовката на българското председателство на Съвета на ЕС - 2018' => [
                'importer' => 'Заместник министър-председател по подготовката на българското председателство на Съвета на ЕС - 2018',
                'institution_id' => 127,
            ],
            'заместник министър-председател по подготовка на българското председателство на Съвета на ЕС - 2018' => [
                'importer' => 'Заместник министър-председател по подготовката на българското председателство на Съвета на ЕС - 2018',
                'institution_id' => 127,
            ],
            'заместник министър-председател по подготовката на българското председателство на Съвета на ЕС-2018' => [
                'importer' => 'Заместник министър-председател по подготовката на българското председателство на Съвета на ЕС - 2018',
                'institution_id' => 127,
            ],
            'заместник министър-председател по подготовката на българското председателство на Съвета на ЕС - 2018' => [
                'importer' => 'Заместник министър-председател по подготовката на българското председателство на Съвета на ЕС - 2018',
                'institution_id' => 127,
            ],
            'заместник министър-председател по подготовката на българското председателство' => [
                'importer' => 'Заместник министър-председател по подготовката на българското председателство',
                'institution_id' => 127,
            ],
            'заместник министър-председател по социални политики и министър на здравеопазването' => [
                'importer' => 'Заместник министър-председател по социални политики и министър на здравеопазването',
                'institution_id' => 127,
            ],
            'заместник министър-председател по социални политики и министър на здравеопазване' => [
                'importer' => 'Заместник министър-председател по социални политики и министър на здравеопазването',
                'institution_id' => 127,
            ],
            'министър на регионалното развитие и министър на инвестиционното проектиране' => [
                'importer' => 'Министър на регионалното развитие и министър на инвестиционното проектиране',
                'institution_id' => 127,
            ]
        ];

        $formatTimestamp = 'Y-m-d H:i:s';
        $formatDate = 'Y-m-d';
        //records per query
        $step = 50;
        //max id in old db
        $maxOldId = DB::connection('pris')->select('select max(archimed.e_items.id) from archimed.e_items');
        //start from this id in old database
        //$currentStep = DB::table('pris')->select(DB::raw('max(old_id) as max'))->first()->max + 1;
        $currentStep = 0;

        if( (int)$maxOldId[0]->max ) {
            $maxOldId = (int)$maxOldId[0]->max;
            try {
                while ($currentStep < $maxOldId) {
                    echo "FromId: ".$currentStep.PHP_EOL;
                    $oldDbResult = DB::connection('pris')->select('select
                                pris.id as old_id,
                                pris."number" as doc_num,
                                pris.parentid as parentdocumentid,
                                pris.rootid as rootdocumentid,
                                pris.masterid,
                                pris.state,
                                pris.xstate,
                                case when pris.islatestrevision = false then 0 else 1 end as last_version,
                                pris.itemtypeid as old_doc_type_id,
                                pris."xml" as to_parse_xml_details,
                                pris.activestate as active, -- check with distinct if only 0 and 1 // check also pris.state
                                pris.datepublished as published_at,
                                pris.datecreated as created_at,
                                pris.datemodified as updated_at,
                                sum(case when att.attachid is not null then 1 else 0 end) as has_files
                            FROM archimed.e_items pris
                            left join edocs.attachments att on att.documentid = pris.id
                            where true
                                and pris.id >= ' . $currentStep . '
                                and pris.id < ' . ($currentStep + $step) . '
                                and pris.itemtypeid <> 5017 -- skip law records
                                -- and pris.itemtypeid <> 5030 -- skip law records
                                -- and documents.lastrevision = \'Y\' -- get final versions
                            group by pris.id
                            order by pris.id asc');

                    if (sizeof($oldDbResult)) {
                        foreach ($oldDbResult as $item) {

                            $importerInstitutions = [];
                            $tags = [];
                            $newItemTags = [];//tags ids to connect to new item

                            $xml = simplexml_load_string($item->to_parse_xml_details);
                            $json = json_encode($xml, JSON_UNESCAPED_UNICODE);
                            $data = json_decode($json, true);

                            //Update existing
                            if(isset($ourPris) && sizeof($ourPris) && isset($ourPris[(int)$item->old_id])){
                                $this->comment('Pris with old id '.$item->old_id.' already exist');
                                $existPris = Pris::find($ourPris[(int)$item->old_id]);

                                if($existPris){
                                    $about = null;
                                    $legal_reason = null;
                                    $oldImporters = null;
                                    $importer = null;
                                    //Update version
                                    if($existPris->last_version != $item->last_version){
                                        $existPris->last_version = $item->last_version;
                                        $existPris->save();
                                    }

                                    if(isset($data['DocumentContent']) && isset($data['DocumentContent']['Attribute']) && sizeof($data['DocumentContent']['Attribute'])) {
                                        $attributes = $data['DocumentContent']['Attribute'];
                                        foreach ($attributes as $att) {
                                            //get about
                                            if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Относно') {
                                                if(isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value'])) {
                                                    $about = $att['Value']['Value'];
                                                } elseif (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value'])) {
                                                    $about = $att['Value'];
                                                }
                                            }

                                            //get about
                                            if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Правно основание') {
                                                if(isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value'])) {
                                                    $legal_reason = $att['Value']['Value'];
                                                } elseif (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value'])) {
                                                    $legal_reason = $att['Value'];
                                                }
                                            }

                                            //get tags
                                            if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Термини') {
                                                if(isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value'])) {
                                                    //echo "Tags: ".$att['Value']['Value'].PHP_EOL;
                                                    $tags = preg_split('/\r\n|\r|\n/', $att['Value']['Value']);
                                                } elseif (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value'])) {
                                                    //echo "Tags: ".$att['Value'].PHP_EOL;
                                                    $tags = preg_split('/\r\n|\r|\n/', $att['Value']);
                                                }
                                            }

                                            //importer
                                            //institution_id
                                            if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Вносител') {
                                                $val = isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value']) ? $att['Value']['Value'] : (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value']) ? $att['Value'] : null);
                                                if($val) {
                                                    $oldImporters = $val;
                                                    //echo "Importer: ".$att['Value']['Value'].PHP_EOL;
                                                    $importerStr = [];
                                                    $importerInstitutions = [];

                                                    $explode = explode(',', $val);
                                                    foreach ($explode as $e) {
                                                        if(isset($importers[trim($e)])) {
                                                            if(
                                                                (!is_array($importers[trim($e)]['institution_id']) && !is_null($importers[trim($e)]['institution_id']))
                                                                || (is_array($importers[trim($e)]['institution_id']) && sizeof($importers[trim($e)]['institution_id']) && array_sum($importers[trim($e)]['institution_id']) > 0)
                                                            ) {
                                                                if(is_array($importers[trim($e)]['institution_id'])){
                                                                    foreach ($importers[trim($e)]['institution_id'] as $i){
                                                                        if($i > 0){
                                                                            $importerInstitutions[] = $i;
                                                                        }
                                                                    }
                                                                } else{
                                                                    $importerInstitutions[] = $importers[trim($e)]['institution_id'];
                                                                }
                                                                $importerStr[] = $importers[trim($e)]['importer'];
                                                            } else{
                                                                $importerStr[] = $importers[trim($e)]['importer'];
                                                                if(!isset($institutionForMapping[trim($e)])) {
                                                                    //TODO for mapping
                                                                    file_put_contents('institutions_for_mapping_last_pris.txt', 'Missing ID in mapping: ' . $e . PHP_EOL, FILE_APPEND);
                                                                    $institutionForMapping[trim($e)] = trim($e);
                                                                }
                                                            }
                                                        } else{
//                                                    $valNoNeLine = str_replace(['\r\n', '\n\r','\n', '\r'], ';', $val);
                                                            $valNoNeLine = preg_replace("/[\r\n]+/", ";", $val);
                                                            $explodeByRow = explode(';', $valNoNeLine);
                                                            if(sizeof($explodeByRow)){
                                                                foreach ($explodeByRow as $eByRow){
                                                                    if (isset($importers[trim($eByRow)])) {
                                                                        $importerStr[] = $importers[trim($eByRow)]['importer'];
                                                                        if (
                                                                            (!is_array($importers[trim($eByRow)]['institution_id']) && !is_null($importers[trim($eByRow)]['institution_id']))
                                                                            || (is_array($importers[trim($eByRow)]['institution_id']) && sizeof($importers[trim($eByRow)]['institution_id']) && array_sum($importers[trim($eByRow)]['institution_id']) > 0)
                                                                        ) {
                                                                            if(is_array($importers[trim($eByRow)]['institution_id'])){
                                                                                foreach ($importers[trim($eByRow)]['institution_id'] as $i){
                                                                                    if($i > 0){
                                                                                        $importerInstitutions[] = $i;
                                                                                    }
                                                                                }
                                                                            } else{
                                                                                $importerInstitutions[] = $importers[trim($eByRow)]['institution_id'];
                                                                            }
                                                                        } else{
                                                                            if(!isset($institutionForMapping[trim($eByRow)])) {
                                                                                //TODO for mapping
                                                                                file_put_contents('institutions_for_mapping_last_pris.txt', 'Missing ID in mapping: ' . $eByRow . PHP_EOL, FILE_APPEND);
                                                                                $institutionForMapping[trim($eByRow)] = trim($eByRow);
                                                                            }
                                                                        }
                                                                    } else{
                                                                        //TODO for mapping
                                                                        if(!isset($institutionForMapping[trim($eByRow)])){
                                                                            file_put_contents('institutions_for_mapping_last_pris.txt', 'Missing in mapping: '.$eByRow.PHP_EOL, FILE_APPEND);
                                                                            $institutionForMapping[trim($eByRow)] = trim($eByRow);
                                                                        }
                                                                    }
                                                                }
                                                            } else{
                                                                //TODO for mapping
                                                                if(!isset($institutionForMapping[trim($e)])){
                                                                    file_put_contents('institutions_for_mapping_last_pris.txt', 'Missing in mapping: '.$e.PHP_EOL, FILE_APPEND);
                                                                    $institutionForMapping[trim($e)] = trim($e);
                                                                }
                                                            }
                                                        }
                                                    }
                                                    $importer = sizeof($importerStr) ? implode(', ', $importerStr) : '';
                                                }
                                            }
                                        }

                                        $existPris->update(['old_importers' => $oldImporters]);

                                        foreach ($locales as $locale) {
                                            $existPris->translateOrNew($locale['code'])->about = $about;
                                            $existPris->translateOrNew($locale['code'])->legal_reason = $legal_reason;
                                            $existPris->translateOrNew($locale['code'])->importer = $importer;
                                        }

                                        $existPris->save();

                                        if(isset($importerInstitutions) && sizeof($importerInstitutions)) {
                                            $existPris->institutions()->sync($importerInstitutions);
                                        }

                                        //3. Create connection pris - tags
//                                        if(sizeof($tags)) {
//                                            $newTags = array();
//                                            foreach ($tags as $tag) {
//                                                if(!isset($ourTags[$tag])) {
//                                                    //create tag
//                                                    $newTag = \App\Models\Tag::create();
//                                                    if( $newTag ) {
//                                                        foreach ($locales as $locale) {
//                                                            $newTag->translateOrNew($locale['code'])->label = $tag;
//                                                        }
//                                                    }
//                                                    $newTag->save();
//                                                    echo "Tag with name ".$tag." created successfully".PHP_EOL;
//                                                    $ourTags[$tag] = $newTag->id;
//                                                }
//                                                $newTags[] = '('.(int)$ourTags[$tag].', '.$existPris->id.')';
//                                            }
//
//                                            DB::statement('delete from pris_tag where pris_id ='.$existPris->id);
//                                            if(sizeof($newTags)) {
//                                                DB::statement('insert into pris_tag values '.implode(',', $newTags));
//                                                //$existPris->tags()->sync($newTags); //this is slow
//                                            }
//                                        }
                                    }
                                }
                                continue;
                            }

                            //Create model
                            $fileForExeption = null;

                            if(isset($data['DocumentContent']) && isset($data['DocumentContent']['Attribute']) && sizeof($data['DocumentContent']['Attribute'])) {
                                $attributes = $data['DocumentContent']['Attribute'];
                                //main record
                                $prepareNewPris = [
                                    'old_id' => $item->old_id,
                                    'doc_num' => $item->doc_num,
                                    'doc_date' => null,
                                    'old_doc_num' => $item->doc_num,
                                    'active' => $item->active,
                                    'legal_act_type_id' => $legalTypeDocs[$item->old_doc_type_id],
                                    'published_at' => Carbon::parse($item->published_at)->format($formatTimestamp),
                                    'created_at' => Carbon::parse($item->created_at)->format($formatTimestamp),
                                    'updated_at' => Carbon::parse($item->updated_at)->format($formatTimestamp),
                                    'institution_id' => null, // When old record do not have institution use our default : $dInstitution
                                    'version' => null, // TODO ??????
                                    'protocol' => null,
                                    'newspaper_number' => null,
                                    'newspaper_year' => null,
                                    'old_newspaper_full' => null,
                                    'old_connections' => null,
                                    'public_consultation_id' => null,
                                    'about' => '',
                                    'legal_reason' => '',
                                    'importer' => '',
                                    'state' => $item->state,
                                    'xstate' => $item->xstate,
                                    'last_version' => $item->last_version,
                                    'old_importers' => null,
                                ];
                                //Do something
                                //1. Parse tags and insert if need to
                                foreach ($attributes as $att) {
                                    //get tags
                                    if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Термини') {
                                        if(isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value'])) {
                                            //echo "Tags: ".$att['Value']['Value'].PHP_EOL;
                                            $tags = preg_split('/\r\n|\r|\n/', $att['Value']['Value']);
                                        } elseif (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value'])) {
                                            //echo "Tags: ".$att['Value'].PHP_EOL;
                                            $tags = preg_split('/\r\n|\r|\n/', $att['Value']);
                                        }
                                    }
                                    //get date
                                    if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Дата') {
                                        if(isset($att['Value']) && isset($att['Value']['Date']) && !empty($att['Value']['Date'])) {
                                            $prepareNewPris['doc_date'] = Carbon::parse($att['Value']['Date'])->format($formatDate);
                                        }
                                    }
                                    //get number
                                    if(empty($prepareNewPris['doc_num']) && isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Номер') {
                                        $val = isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value']) ? $att['Value']['Value'] : (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value']) ? $att['Value'] : null);
                                        if($val) {
                                            //echo "Doc Num: ".$att['Value']['Value'].PHP_EOL;
                                            $prepareNewPris['old_doc_num'] = $val;
                                            $docNum = explode('-', $val);
                                            $prepareNewPris['doc_num'] = sizeof($docNum) == 2 ? (int)$docNum[1] : $docNum[0];
                                        }
                                    }
                                    //get protocol
                                    if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Протокол') {
                                        if(isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value'])) {
                                            $prepareNewPris['protocol'] = is_array($att['Value']['Value']) ? (!empty($att['Value']['Value']) ? implode(';', $att['Value']['Value']) : null) : $att['Value']['Value'];
                                        } elseif (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value']) && !isset($att['Value']['Value'])) {
                                            $prepareNewPris['protocol'] = is_array($att['Value']) ? (!empty($att['Value']) ? implode(';', $att['Value']) : null) : $att['Value'];
                                        }
                                    }
                                    //newspaper num
                                    if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'ДВ брой') {
                                        if(isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value'])) {
                                            $prepareNewPris['newspaper_number'] = (int)$att['Value']['Value'];
                                        } elseif (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value'])) {
                                            $prepareNewPris['newspaper_number'] = (int)$att['Value'];
                                        }
                                    }
                                    //newspaper year
                                    if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'ДВ година') {
                                        if(isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value'])) {
                                            $prepareNewPris['newspaper_year'] = (int)$att['Value']['Value'];
                                        } elseif (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value'])) {
                                            $prepareNewPris['newspaper_year'] = (int)$att['Value'];
                                        }
                                    }
                                    //newspaper full
                                    if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Обнародвано в ДВ') {
                                        if(isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value'])) {
                                            $prepareNewPris['old_newspaper_full'] = $att['Value']['Value'];
                                        } elseif (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value'])) {
                                            $prepareNewPris['old_newspaper_full'] = $att['Value'];
                                        }
                                    }
                                    //importer
                                    //institution_id
                                    if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Вносител') {
                                        $val = isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value']) ? $att['Value']['Value'] : (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value']) ? $att['Value'] : null);
                                        if($val) {
                                            $prepareNewPris['old_importers'] = $val;
                                            //echo "Importer: ".$att['Value']['Value'].PHP_EOL;
                                            $importerStr = [];
                                            $importerInstitutions = [];

                                            $explode = explode(',', $val);
                                            foreach ($explode as $e) {
                                                if(isset($importers[trim($e)])) {
                                                    if(
                                                        (!is_array($importers[trim($e)]['institution_id']) && !is_null($importers[trim($e)]['institution_id']))
                                                        || (is_array($importers[trim($e)]['institution_id']) && sizeof($importers[trim($e)]['institution_id']) && array_sum($importers[trim($e)]['institution_id']) > 0)
                                                    ) {
                                                        if(is_array($importers[trim($e)]['institution_id'])){
                                                            foreach ($importers[trim($e)]['institution_id'] as $i){
                                                                if($i > 0){
                                                                    $importerInstitutions[] = $i;
                                                                }
                                                            }
                                                        } else{
                                                            $importerInstitutions[] = $importers[trim($e)]['institution_id'];
                                                        }
                                                        $importerStr[] = $importers[trim($e)]['importer'];
                                                    } else{
                                                        $importerStr[] = $importers[trim($e)]['importer'];
                                                        if(!isset($institutionForMapping[trim($e)])) {
                                                            //TODO for mapping
                                                            file_put_contents('institutions_for_mapping_last_pris.txt', 'Missing ID in mapping: ' . $e . PHP_EOL, FILE_APPEND);
                                                            $institutionForMapping[trim($e)] = trim($e);
                                                        }
                                                    }
                                                } else{
//                                                    $valNoNeLine = str_replace(['\r\n', '\n\r','\n', '\r'], ';', $val);
                                                    $valNoNeLine = preg_replace("/[\r\n]+/", ";", $val);
                                                    $explodeByRow = explode(';', $valNoNeLine);
                                                    if(sizeof($explodeByRow)){
                                                        foreach ($explodeByRow as $eByRow){
                                                            if (isset($importers[trim($eByRow)])) {
                                                                $importerStr[] = $importers[trim($eByRow)]['importer'];
                                                                if (
                                                                    (!is_array($importers[trim($eByRow)]['institution_id']) && !is_null($importers[trim($eByRow)]['institution_id']))
                                                                    || (is_array($importers[trim($eByRow)]['institution_id']) && sizeof($importers[trim($eByRow)]['institution_id']) && array_sum($importers[trim($eByRow)]['institution_id']) > 0)
                                                                ) {
                                                                    if(is_array($importers[trim($eByRow)]['institution_id'])){
                                                                        foreach ($importers[trim($eByRow)]['institution_id'] as $i){
                                                                            if($i > 0){
                                                                                $importerInstitutions[] = $i;
                                                                            }
                                                                        }
                                                                    } else{
                                                                        $importerInstitutions[] = $importers[trim($eByRow)]['institution_id'];
                                                                    }
                                                                } else{
                                                                    if(!isset($institutionForMapping[trim($eByRow)])) {
                                                                        //TODO for mapping
                                                                        file_put_contents('institutions_for_mapping_last_pris.txt', 'Missing ID in mapping: ' . $eByRow . PHP_EOL, FILE_APPEND);
                                                                        $institutionForMapping[trim($eByRow)] = trim($eByRow);
                                                                    }
                                                                }
                                                            } else{
                                                                //TODO for mapping
                                                                if(!isset($institutionForMapping[trim($eByRow)])){
                                                                    file_put_contents('institutions_for_mapping_last_pris.txt', 'Missing in mapping: '.$eByRow.PHP_EOL, FILE_APPEND);
                                                                    $institutionForMapping[trim($eByRow)] = trim($eByRow);
                                                                }
                                                            }
                                                        }
                                                    } else{
                                                        //TODO for mapping
                                                        if(!isset($institutionForMapping[trim($e)])){
                                                            file_put_contents('institutions_for_mapping_last_pris.txt', 'Missing in mapping: '.$e.PHP_EOL, FILE_APPEND);
                                                            $institutionForMapping[trim($e)] = trim($e);
                                                        }
                                                    }
                                                }
                                            }
                                            $prepareNewPris['importer'] = sizeof($importerStr) ? implode(', ', $importerStr) : '';
                                        }
                                    }
                                    //get about
                                    if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Относно') {
                                        if(isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value'])) {
                                            $prepareNewPris['about'] = $att['Value']['Value'];
                                        } elseif (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value'])) {
                                            $prepareNewPris['about'] = $att['Value'];
                                        }
                                    }
                                    //get about
                                    if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Правно основание') {
                                        if(isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value'])) {
                                            $prepareNewPris['legal_reason'] = $att['Value']['Value'];
                                        } elseif (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value'])) {
                                            $prepareNewPris['legal_reason'] = $att['Value'];
                                        }
                                    }
                                    //4. Parse id doc connections and create them in pris_change_pris
                                    //get old pris change pris
                                    if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Промени') {
                                        $val = isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value']) ? $att['Value']['Value'] : (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value']) ? $att['Value'] : null);
                                        if($val) {
                                            //echo "Changes: ".$att['Value']['Value'].PHP_EOL;
                                            $oldChanges = preg_split('/\r\n|\r|\n/', $val);
                                            $prepareNewPris['old_connections'] = sizeof($oldChanges) ? implode('; ', $oldChanges) : $oldChanges;
                                        }
                                    }

                                    if(isset($att['@attributes']) && isset($att['@attributes']['Name']) && $att['@attributes']['Name'] == 'Статус') {
                                        if(isset($att['Value']) && isset($att['Value']['Value']) && !empty($att['Value']['Value'])) {
                                            $prepareNewPris['connection_status'] = (int)$att['Value']['Value'];
                                        } elseif (isset($att['Value']) && !empty($att['Value']) && !isset($att['Value']['Value'])) {
                                            $prepareNewPris['connection_status'] = (int)$att['Value'];
                                        }
                                    }

                                }

                                //Legal type category correction if need to
                                if($prepareNewPris['legal_act_type_id'] == $protocolsId && str_contains($prepareNewPris['doc_num'], '.')) {
                                    $prepareNewPris['legal_act_type_id'] = $protocolDecisionsId;
                                }

                                //2. Create pris record and translations
                                $newItem = new Pris();
                                $newItem->fill($prepareNewPris);
                                $newItem->save();

                                if($newItem->id) {
                                    foreach ($locales as $locale) {
                                        $newItem->translateOrNew($locale['code'])->about = $prepareNewPris['about'];
                                        $newItem->translateOrNew($locale['code'])->legal_reason = $prepareNewPris['legal_reason'];
                                        $newItem->translateOrNew($locale['code'])->importer = $prepareNewPris['importer'];
                                    }
                                    $newItem->save();

                                    if(isset($importerInstitutions) && sizeof($importerInstitutions)) {
                                        $newItem->institutions()->sync($importerInstitutions);
                                    }
                                }

                                //3. Create connection pris - tags
//                                if($newItem && sizeof($tags)) {
//                                    $newItemTags = array();
//                                    foreach ($tags as $tag) {
//                                        if(!isset($ourTags[$tag])) {
//                                            //create tag
//                                            $newTag = \App\Models\Tag::create();
//                                            if( $newTag ) {
//                                                foreach ($locales as $locale) {
//                                                    $newTag->translateOrNew($locale['code'])->label = $tag;
//                                                }
//                                            }
//                                            $newTag->save();
//                                            echo "Tag with name ".$tag." created successfully".PHP_EOL;
//                                            $ourTags[$tag] = $newTag->id;
//                                        }
//                                        $newItemTags[] = '('.(int)$ourTags[$tag].', '.$newItem->id.')';
//                                    }
//
//                                    DB::statement('delete from pris_tag where pris_id ='.$newItem->id);
//                                    if(sizeof($newItemTags)) {
//                                        DB::statement('insert into pris_tag values '.implode(',', $newItemTags));
//                                        //$newItem->tags()->sync($newTags); //this is slow
//                                    }
//                                }
                            }
                            $this->comment('PRIS with old id (' . $item->old_id . ') is created');
                        }
                    }
                    $currentStep += $step;
                }
            } catch (\Exception $e) {
                Log::error('Migration old pris: ' . $e);
            }
        }
        $this->info('End at '.date('Y-m-d H:i:s'));
    }
}
