<?php

return [
    'institution' => 'Институция',
    'regulatory_act' => 'Нормативен акт',
    'not_included_in_program' => 'Не е включен в законодателна/оперативна програма на Министерския съвет',
    'included_in_program' => 'Включен е в законодателна/оперативна програма на Министерския съвет',
    'contact_person' => 'Лице за контакт',
    'phone_and_email' => 'Телефон и ел. поща',
    'problem_to_solve' => 'Проблем/проблеми за решаване',
    'goal' => 'Цел',
    'goals' => 'Цели',
    'interested_party' => 'Заинтересованa странa',
    'interested_parties' => 'Заинтересовани страни',
    'description' => 'Описание',
    'positive_impact' => 'Положителни (икономически/социални/екологични) въздействия',
    'negative_impact' => 'Отрицателни (икономически/социални/екологични) въздействия',
    'small_mid_impact' => 'Въздействия върху малките и средните предприятия',
    'admin_weight' => 'Административна тежест',
    'variant' => 'Вариант',
    'on_problem' => 'По проблем',
];