<?php

return [
    'no_replay' => 'Този имейл е автоматично генериран, моля не отговаряйте. В случай, че имейлът не е предназначен за Вас, моля да го игнорирате. Ако прецените, че е необходимо, може да се свържете с администратора на Портала за обществени консултации, чрез <a href="">секция „Контакти</a>“.',
    'adv_board_changes' => 'Промени в консултативен съвет',
    'adv_board_changes.extra_info' => 'В раздел „Консултативни съвети“ на Портала за обществени консултации е извършена промяна в съществуваща страница на следния консултативен съвет:',
    'adv_board_up_to_date' => 'Проверка актуалност Консултативни съвети',
    'adv_board_up_to_date.extra_info' => 'Следните съвети подлежат на проверка за актуалност на данните:',
    'adv_board_assigned' => 'Ассоцииране с Консултативен съвет',
    'adv_board_assigned.extra_info' => 'В раздел „Консултативни съвети“ на Портала за обществени консултации е създадена страница на следния консултативен съвет, към който сте асоцииран като модератор „Консултативен съвет“:',
    'legislative_initiative.closed.subject' => 'На Портала за обществени консултации - отменана законодателна инициатива',
    'legislative_initiative.closed.main_text' => 'На Портала за обществени консултации е отменана законодателна инициатива, към която вие сте изразили подкрепа. Информация за законодателната инициатива:',
    'legislative_initiative.success.subject' => 'На Портала за обществени консултации - законодателна инициатива получи подкрепа',
    'legislative_initiative.success.main_text' => 'На Портала за обществени консултации е създадено предложение за усъвършенстване на законодателството (наречена законодателна инициатива) във връзка с чл. 18 от Закона за нормативните актове. Инициативата е събрала определената от системата на Портала за обществени консултации подкрепа. Това съобщение е изпратено автоматично и следва да се разглежда като предложение по реда на Глава осма от Административнопроцесуалния кодекс. Информация за законодателната инициатива:',
];
