<?php return array (
  'manage.*'                 => 'Всички права',
  'manage.roles-permissions' => 'Права за предоставяне/отнемане на права на потребители и роли',
  'manage.users-roles'       => 'Права за регистриране/деактивиране и промяна на данни за потребители и роли',
  'manage.advisory'          => 'Права за управление „Обществени консултации“',
  'manage.strategic'         => 'Права за управление „Стратегически документи"',
  'manage.legal'             => 'Права за управление „Правна информация“',
  'manage.advisory-boards'   => 'Права за управление Раздел „Консултативни съвети“',
  'manage.advisory-board'    => 'Права за управление „Консултативен съвет“',
  'manage.partnership'       => 'Права за управление „Партньорство за открито управление',
);
