{
    "The :attribute трябва да съдържа поне една буква.": ":attribute трябва да съдържа поне една буква.",
    "The :attribute must contain at least one number.": ":attribute трябва да съдържа поне една цифра.",
    "The :attribute must contain at least one symbol.": ":attribute трябва да съдържа поне един символ.",
    "The :attribute must contain at least one uppercase and one lowercase letter.": ":attribute трябва да съдържа поне една главна и една малка буква.",
    "The given :attribute has appeared in a data leak. Please choose a different :attribute.": "given :attribute has appeared in a data leak. Please choose a different :attribute.",
    "List of individuals and legal entities": "Списък на физическите и юридическите лица, на които е възложено от държавата или общините да изработят проекти на нормативни актове, оценки на въздействието, както и размера на възнаграждението им.",
    "New public consultation was published": "Публикувана е нова обществена консултация",
    "Autogenerated email": "Този имейл е автоматично генериран, моля не отговаряйте. В случай, че имейлът не е предназначен за Вас, моля да го игнорирате. Ако прецените, че е необходимо, може да се свържете с администратора на Портала за обществени консултации, чрез секция „Контакти“",
    "Notification": "Известие",
    "Respected": "Уважаеми",
    "Consultation period": "Период на консултацията",
    "See the consultation": "Вижте консултацията",
    "New consultation comment": "Нов коментар по Обществена консултация",
    "New consultation": "Нова Обществена консултация",
    "Update consultation": "Обновена Обществена консултация",
    "New consultation admin text": "На Портала за обществени консултации е публикувана следната обществена консултация",
    "New consultation moderator text": "Беше създадена следната обществена консултация към вашата институция",
    "New consultation user text": "На Портала за обществени консултации е публикувана следната обществена консултация: Получавате това съобщение, защото сте абониран за нови консултации в определени категории. Ако желаете да промените своите абонаменти, моля натиснете",
    "Update consultation admin text": "На Портала за обществени консултации е обновена следната обществена консултация",
    "Update consultation moderator text": "Беше обновена следната обществена консултация",
    "Update consultation user text": "На Портала за обществени консултации е обновена следната обществена консултация: Получавате това съобщение, защото сте абониран за нови консултации в определени категории. Ако желаете да промените своите абонаменти, моля натиснете",
    "New consultation comment moderator text": "В създадената от Вас обществена консултация е добавен нов коментар. Съобразно вътрешната организация във Вашата институция, препратете този мейл на водещото звено, отговорно за изработване на акта.",
    "New consultation comment user text": "Към следната консултация, по която вие сте направил коментар, е добавен нов коментар от друг потребител.",
    "Link to the consultation on the Public Consultation Portal": "Линк към консултацията на Портала за обществени консултации",
    "All rights reserved.": "Всички права запазени",
    "You have subscribed successfully": "Вие се абонирахте успешно",
    "You have unsubscribed successfully": "Вие се отписахте успешно",
    "New public consultation was created": "На Портала за обществени консултации е публикувана следната обществена консултация",
    "Executors": "Списък на физическите и юридическите лица",
    "List of the preparers of evaluations under the ZNA": "Списък на изпълнителите по ЗНА",
    "Name of contractor": "Наименование на възложител",
    "Name of executor": "Наименование на изпълнител",
    "Order information": "Информация за поръчката",
    "Contract date": "Дата на договора",
    "Update a record": "Редактиране на запис",
    "Create a new record": "Добавяне на нов запис",
    "The new record was created successfully": "Новият запис беше създаден успешно",
    "The record was updated successfully": "Записът беше обновен успешно",
    "Hello!": "Здравейте!",
    "Regards": "Поздрави",
    "If you're having trouble clicking the \":actionText\" button, copy and paste the URL below\ninto your web browser:": "Ако имате проблем с отварянето на връзката \":actionText\", копирайте линка в браузера:",
    "See the strategic document": "Вижте стратегическия документ",
    "Link to the strategic document on the Public Consultation Portal": "Линк към стратегическия документ на Портала за обществени консултации",
    "New strategic document admin text": "На Портала за обществени консултации е публикуван следния стратегически документ",
    "New strategic document moderator text": "Беше създаден следния стратегически документ",
    "New strategic document user text": "Получавате това съобщение, защото сте абониран за нови стратегически докумнети по определени критерии. \n На Портала за обществени консултации е публикуван следния стратегически документ: \n",
    "Update strategic document admin text": "На Портала за обществени консултации е обновен следния стратегически документ",
    "Update strategic document moderator text": "Беше обновен следния стратегически документ",
    "Update strategic document user text": "Получавате това съобщение, защото сте абониран за промени в стратегически докумнети, по определени категории.\n На Портала за обществени консултации е обновен следния стратегически документ: \n",
    "New strategic document": "Нов стратегически документ",
    "Update strategic document": "Обновен стратегически документ",
    "Change subscriptions here": "Ако желаете да промените своите абонаменти, моля натиснете тук:",
    "Subscription's management": "Управление на абонаменти",
    "See the legislative initiative": "Вижте законодателната инициатива",
    "Link to the legislative initiative on the Public Consultation Portal": "Линк към законодателната инициатива на Портала за обществени консултации",
    "New legislative initiative admin text": "Беше създаден следната законодателна инициатива",
    "New legislative initiative moderator text": "Беше създаден следната законодателна инициатива",
    "New legislative initiative user text": "На Портала за обществени консултации е създадена нова за законодателна инициатива (промяна в нормативен акт), която започва да събира подкрепа. След генерирането на необходимата подкрепа, предложението ще бъде изпратено до отговорна институция за разглеждане. Информация за законодателната инициатива:",
    "Update legislative initiative admin text": "Беше обновена следната законодателна инициатива:",
    "Update legislative initiative moderator text": "Беше обновена следната законодателна инициатива",
    "Update legislative initiative user text": "На Портала за обществени консултации е обновена следната законодателна инициатива:",
    "New legislative initiative": "Нова законодателна инициатива",
    "Update legislative initiative": "Обновена законодателна инициатива",
    "You are receiving this email because we received a password reset request for your account.": "Получавате този имейл, защото получихме заявка за повторно задаване на парола за вашия акаунт.",
    "Reset Password Notification": "Промяна на парола",
    "If you did not request a password reset, no further action is required.": "Ако не сте поискали повторно задаване на парола, не са необходими допълнителни действия.",
    "This password reset link will expire in :count minutes.": "Връзка за повторно задаване на парола ще изтече след :count минути.",
    "Please click the button below to verify your email address.": "Моля, използвайте връзката по-долу (Потвърди ел. поща), за да потвърдите своя имейл адрес.",
    "Verify Email Address": "Потвърди ел. поща",
    "If you did not create an account, no further action is required.": "Ако не сте регистрирали този профил, не е необходимо да предприемате действия.",
    "Comment legislative initiative user text": "На Портал за обществени консултации е постъпил нов коментар по законодателна инициатива в която сте взели участие.",
    "Comment legislative initiative": "Нов коментар по законодателна инициaтива",
    "Public consultation expire soon in couple of days": "Уведомяваме Ви, че до крайния срок за становища по обществена консултация на Портала за обществени консултации, за която сте абониран/а, остават :days дни.",
    "Public consultation expire soon": "Краен срок за Обществена консултация"
}
