{
    "The :attribute трябва да съдържа поне една буква.": ":attribute трябва да съдържа поне една буква.",
    "The :attribute must contain at least one number.": ":attribute трябва да съдържа поне една цифра.",
    "The :attribute must contain at least one symbol.": ":attribute трябва да съдържа поне един символ.",
    "The :attribute must contain at least one uppercase and one lowercase letter.": ":attribute трябва да съдържа поне една главна и една малка буква.",
    "The given :attribute has appeared in a data leak. Please choose a different :attribute.": "given :attribute has appeared in a data leak. Please choose a different :attribute.",
    "List of individuals and legal entities": "Списък на физическите и юридическите лица, на които е възложено от държавата или общините да изработят проекти на нормативни актове, оценки на въздействието, както и размера на възнаграждението им.",
    "New public consultation was published": "Публикувана е нова обществена консултация",
    "Autogenerated email": "Този имейл е автоматично генериран, моля не отговаряйте. В случай, че имейлът не е предназначен за Вас, моля да го игнорирате. Ако прецените, че е необходимо, може да се свържете с администратора на Портала за обществени консултации, чрез секция „Контакти“",
    "Notification": "Известие",
    "Respected": "Уважаеми",
    "Consultation period": "Период на консултацията",
    "See the consultation": "Вижте консултацията",
    "New consultation admin text": "На Портала за обществени консултации е публикувана следната обществена консултация",
    "New consultation moderator text": "Беше създадена следната обществена консултация към вашата институция",
    "New consultation user text": "На Портала за обществени консултации е публикувана следната обществена консултация: Получавате това съобщение, защото сте абониран за нови консултации в определени категории. Ако желаете да промените своите абонаменти, моля натиснете",
    "New consultation comment moderator text": "В обществена консултация  към вашата институция е добавен нов коментар. Съобразно вътрешната организация във Вашата институция, препратете този мейл на водещото звено, отговорно за изработване на акта.",
    "New consultation comment user text": "Към следната консултация, по която вие сте направил коментар, е добавен нов коментар от друг потребител. Ако желаете да се отпишете от получаване на нотификация за нови коментари по тази консултация, моля натиснете",
    "Link to the consultation on the Public Consultation Portal": "Линк към консултацията на Портала за обществени консултации",
    "All rights reserved.": "Всички права запазени",
    "You have subscribed successfully": "Вие се абонирахте успешно",
    "You have unsubscribed successfully": "Вие се отписахте успешно",
    "New public consultation was created": "На Портала за обществени консултации е публикувана следната обществена консултация",
    "Executors": "Списък на физическите и юридическите лица",
    "List of the preparers of evaluations under the ZNA": "Списък на изпълнителите по ЗНА",
    "Name of contractor": "Наименование на възложител",
    "Name of executor": "Наименование на изпълнител",
    "Order information": "Информация за поръчката",
    "Contract date": "Дата на договора",
    "Update a record": "Редактиране на запис",
    "Create a new record": "Добавяне на нов запис",
    "The new record was created successfully": "Новият запис беше създаден успешно",
    "The record was updated successfully": "Записът беше обновен успешно",
    "Hello!": "Здравейте!",
    "Regards": "Поздрави",
    "If you're having trouble clicking the \":actionText\" button, copy and paste the URL below\ninto your web browser:": "Ако имате проблем с отварянето на връзката \":actionText\", копирайте линка в браузера:",
    "See the strategic document": "Вижте стратегическия документ",
    "Link to the strategic document on the Public Consultation Portal": "Линк към стратегическия документ на Портала за обществени консултации"
}
