<h3>3. {{ __('forms.goal_goals') }}</h3>
<p>
    <i>Посочете целите, които се поставят при регулирането на обществените отношения с проекта на нормативен акт, по конкретен и измерим начин и график за тяхното постигане. Какъв ефект би имала промяната и спрямо кого?
        <br>
        Целите са три групи - общи, конкретни и оперативни (Ръководство, РМС № 728 от 2019 г., стр. 23)</i>
</p>

@include('form_partials.shared.problem_goals')

<h3>4. Варианти на действие</h3>
<p><i>Опишете изследваните варианти за постигане на заложените цели за всеки от описаните проблеми, включително алтернативи на предприемането на нормативна промяна. Опишете накратко потенциалните рискове, свързани с вариантите, каква е вероятността те да настъпят и техния ефект, ако настъпят.</i></p>

@include('form_partials.shared.variant_simple')