<p>
    <b>(Образецът е одобрен от Съвета за административната реформа на 03 септември 2020 г.)</b>
</p>
<h3>{{ __('forms.form3') }}</h3>

<h4 class="mt-3">1. {{ __('forms.problem_to_solve') }}</h4>
<div class="row mb-3">
    <div class="col-sm-12">
        <h5 class="mt-3">1. {{ __('forms.problem_to_solve') }}</h5>
        <p>
            <i>1.1.	Описание на проблема/ите или въпросите, които се уреждат с проекта на нормативен акт (винаги, когато е възможно, проблемът трябва да има количествен показател (Ръководство, РМС № 728 от 2019 г., стр. 19)). Описание на причините за тяхното възникване;
            <br>
            1.2.	Описание на проблемите в прилагането на съществуващото законодателство;
            <br>
            1.3.	Описание на нововъзникналите обстоятелства.</i>
        </p>
        @include('form_partials.array_textarea', ['name' => 'problem_to_solve[]', 'buttonLabel' => 'custom.problem'])
    </div>
</div>

<h4>2. {{ __('forms.interested_parties') }}</h4>
<p>
    <i>
        Посочете всички потенциални засегнати и заинтересовани страни, върху които предложението ще окаже пряко или косвено въздействие (бизнес в дадена  област/всички предприемачи, неправителствени организации, граждани/техни представители, държавни органи, др.).
        <br>
        Когато заинтересованите страни се посочват по групи е необходимо да се посочи техният брой, за да се определи мащаба на въздействията.
    </i>
</p>
@include('form_partials.array_textarea_number', ['name' => 'interested_parties[]', 'buttonLabel' => 'forms.interested_party', 'class_textarea' => 'summernote'])
