@extends('layouts.site', ['fullwidth'=>true])
<style>
    .public-page {
        padding: 0px 0px !important;
    }
</style>
@section('pageTitle', 'Проект на Наредба за изменение и допълнение на Наредба № 46 от 30.11.2001 г. за железопътен превоз на опасни товари')

@section('content')
    <section>
        <div class="container-fluid">
            <div class="row edit-consultation m-0">
                <div class="col-md-12 text-end">
                    <button class="btn btn-sm btn-primary main-color mt-2">
                        <i class="fas fa-pen me-2 main-color"></i>Редактиране на консултация
                    </button>
                </div>
            </div>
        </div>
    </section>

    <div class="container-fluid px-0">
        <div class="row">
            <div class="col-lg-10 right-side-content">
                <div class="mt-5">
                    <div class="row mb-4">
                        <div class="col-md-12">
                            <h2 class="mb-3">Проект на Закон за изменение и допълнение на Закона за малките и средните
                                предприятия</h2>
                        </div>
                        <div class="col-md-12 text-старт">
                            <button class="btn btn-primary  main-color">
                                <i class="fa-solid fa-download main-color me-2"></i>Експорт
                            </button>
                            <button class="btn rss-sub main-color">
                                <i class="fas fa-square-rss text-warning me-2"></i>{{ __('custom.rss_subscribe') }}
                            </button>
                            <button class="btn rss-sub main-color">
                                <i class="fas fa-envelope me-2 main-color"></i>{{ __('custom.subscribe') }}
                            </button>
                        </div>
                    </div>

                    <div class="row mb-3">
                        <div class="col-md-4 ">
                            <h3 class="mb-2 fs-18">Откриване / Приключване <a href="#short-term"
                                                                              class="text-decoration-none">
                                    <i class="fa-solid fa-triangle-exclamation text-danger fs-5"
                                       title="По-кратък срок"></i>
                                </a></h3><a href="#short-term" class="text-decoration-none">
                            </a>
                            <span class="obj-icon-info">
                  <i class="far fa-calendar me-2 main-color" title="Дата на откриване"></i>16.11.2023 г. </span>
                            <span class="mx-2"> — </span>
                            <span class="obj-icon-info">
                  <i class="far fa-calendar-check me-2 main-color" title="Дата на приключване"></i>16.12.2023 г. </span>
                        </div>
                        <div class="col-md-4 ">
                            <h3 class="mb-2 fs-18">Целева група</h3>
                            <a href="#" class="main-color text-decoration-none">
                  <span class="obj-icon-info me-2">
                    <i class="fas fa-hashtag me-2 main-color" title="Номер на консултация "></i>Всички заинтересовани</span>
                            </a>
                        </div>
                        <div class="col-md-4 ">
                            <h3 class="mb-2 fs-18">Област на политика</h3>
                            <a href="#" class="main-color text-decoration-none">
                  <span class="obj-icon-info me-2">
                    <i class="fas fa-car me-2 main-color" title="Област на политика"></i>Бизнес среда</span>
                            </a>
                        </div>
                    </div>

                    <div class="row mt-4 mb-4">
                        <div class="col-md-12">
                            <p> Необходимостта от изменението на Закона за малките и средните предприятия произтича от
                                противоречието на действащата към момента разпоредба на чл. 4, ал. 7, приета с §34 от
                                Преходните и заключителните разпоредби на Закона на изменение и допълнение на Закона за
                                висшето образование (ДВ, бр.17 от 2016 г.). Извършеното с §34 допълнение на разпоредбата
                                със следния текст: „с изключение на случаите, когато лицата са висши училища или
                                изследователски центрове“ изменя дефиницията за МСП в противоречие на действащото
                                европейско законодателство. Проектът на Закон за изменение и допълнение на ЗМСП създава
                                необходимите условия, за да бъдат преодолени затрудненията, свързани с управлението на
                                европейски средства, чрез установяване на пълно съответствие на националното
                                законодателство с правилата за държавни помощи и в частност Регламент (ЕС) № 651/2014 от
                                17 юни 2014 година за обявяване на някои категории помощи за съвместими с вътрешния
                                пазар в приложение на членове 107 и 108 от Договора и Препоръка на Комисията от 6 май
                                2003 г. относно дефиницията на микропредприятията, малките и средните предприятия.</p>
                        </div>
                    </div>

                    <div class="row mb-4 mt-4">
                        <h3 class="mb-3">Документи</h3>

                        <div class="row table-light">
                            <div class="col-md-4">
                                <p class="fs-18 fw-600 main-color-light-bgr p-2 rounded mb-2">Пакет основни
                                    документи</p>
                                <ul class="list-group list-group-flush">
                                    <li class="list-group-item">
                                        <i class="fa-regular fa-file-pdf main-color me-2 fs-5"></i>
                                        <a href="#" class="main-color text-decoration-none" type="button"
                                           class="btn btn-primary" data-toggle="modal" data-target="#exampleModal">Документ
                                            1</a>
                                        <!-- Modal -->
                                        <div class="modal fade" id="exampleModal" tabindex="-1" role="dialog"
                                             aria-labelledby="exampleModalLabel" aria-hidden="true">
                                            <div class="modal-dialog file-display" role="document">
                                                <div class="modal-content">
                                                    <div class="modal-header">
                                                        <h5 class="modal-title" id="exampleModalLabel">Doklad_do_MS-ZMSPZZ20072023.pdf</h5>
                                                        <a type="button" class="close" data-dismiss="modal"
                                                           aria-label="Close">
                                  <span aria-hidden="true">
                                    <i class="fa-solid fa-xmark main-color fs-5"></i></span>
                                                        </a>
                                                    </div>
                                                    <div class="modal-body">
                                                        <div class="col-md-12">
                                                            <p> С проекта на наредба се предлагат: I. Промени, свързани
                                                                с въвеждането в националното законодателство на
                                                                Делегирана директива (ЕС) 2022/2407 на Комисията от 20
                                                                септември 2022 година за изменение на приложенията към
                                                                Директива 2008/68/ЕО на Европейския парламент и на
                                                                Съвета с оглед на адаптирането към научно-техническия
                                                                прогрес (ОВ L 317, 09/12/2022) (Делегирана директива
                                                                (ЕС) 2022/2407). Директива 2008/68/ЕО относно вътрешния
                                                                превоз на опасни товари (2008/68/ЕО) е въведена в
                                                                националното законодателство с Наредба № 46 от
                                                                30.11.2001 г. за железопътен превоз на опасни товари.
                                                                Съгласно чл. 8, параграф 1 от Директива 2008/68/ЕО,
                                                                Европейската комисия приема делегирани актове за
                                                                изменение на приложенията на директивата с цел отчитане
                                                                на измененията на ADR, RID и ADN, по-специално
                                                                свързаните с научния и техническия прогрес, включително
                                                                използването на технологии за локализиране и
                                                                проследяване. Приетите въз основа на цитирания текст
                                                                актове, въвеждащи изменения на приложенията към
                                                                Директива 2008/68/ЕО, са въведени в Наредба № 46, с
                                                                изключение на Делегирана директива (ЕС) 2022/2407.
                                                                Текстът, който следва да се транспонира от посочената
                                                                делегирана директива се съдържа в чл. 1, т. 2 от нея и
                                                                гласи: „в приложение II раздел II.1 се заменя със
                                                                следното: „II.1. RID </p>
                                                            <p>
                                                                <strong>Приложението към RID, приложимо от 1 януари 2023
                                                                    г., като се разбира, че където е уместно „RID
                                                                    договаряща държава" се заменя с „държава
                                                                    членка“.</strong>
                                                            </p>
                                                            <p> Подобен текст вече е транспониран и се съдържа в чл. 2,
                                                                ал. 1 от Наредба № 46. За да се транспонира Делегирана
                                                                директива (ЕС) 2022/2407 е необходимо да се добави
                                                                заглавието й в края на § 2 от Заключителните разпоредби
                                                                на действащата Наредба № 46, което се предлага в
                                                                параграф единствен от проекта на наредба. Предложеният
                                                                проект на Наредба за изменение и допълнение на Наредба №
                                                                46 не оказва пряко/или косвено въздействие върху
                                                                държавния бюджет. Не са необходими финансови и други
                                                                средства за прилагането на новата уредба. На основание
                                                                чл. 26, ал. 2-4 от Закона за нормативните актове
                                                                проектът на наредба, заедно с доклада към него, е
                                                                публикуван за обществено обсъждане на страницата на
                                                                Министерството на транспорта, информационните технологии
                                                                и съобщенията и на Портала за обществени консултации на
                                                                Министерски съвет. На заинтересованите лица е
                                                                предоставена възможност да се запознаят с проекта на
                                                                Наредба за изменение и допълнение на Наредба № 46 и да
                                                                представят писмени предложения или становища в 14-дневен
                                                                срок от публикуването им. </p>
                                                            <p>
                                                                <strong> Решението за определяне на по-кратък срок за
                                                                    обществено обсъждане на проекта на акт е взето в
                                                                    съответствие с изискванията на чл. 26, ал. 4,
                                                                    изречение второ от Закона за нормативните актове,
                                                                    като е съобразено, че публикуваният за обществено
                                                                    обсъждане проект на наредба включва разпоредби,
                                                                    които имат технически характер и чрез тях се въвежда
                                                                    изискването на чл. 1, параграф 2 от Делегирана
                                                                    директива (ЕС) 2022/2407, който регламентира
                                                                    актуалната редакция на правилата към RID – приложима
                                                                    от 1 януари 2023 г., която вече е в сила за
                                                                    Република България. </strong>
                                                            </p>
                                                            <p> В изпълнение на изискванията на чл. 3, ал. 4, т. 1 от
                                                                Постановление № 85 на Министерския съвет от 2007 г. за
                                                                координация по въпросите на Европейския съюз (обн., ДВ,
                                                                бр. 35 от 2007 г., изм., бр. 53 и 64 от 2008 г., бр. 34,
                                                                71, 78 и 83 от 2009 г., бр. 4, 5, 19 и 65 от 2010 г.,
                                                                попр., бр. 66 от 2010 г., изм., бр. 2 и 105 от 2011 г.,
                                                                доп., бр. 68 от 2012 г., изм., бр. 62, 65 и 80 от 2013
                                                                г., изм. и доп., бр. 53 от 2014 г., изм., бр. 76 от 2014
                                                                г., изм. и доп., бр. 94 от 2014 г., изм., бр. 101 от
                                                                2014 г., изм. и доп., бр. 6 от 2015 г., изм., бр. 36 от
                                                                2016 г., изм. и доп., бр. 79 от 2016 г., изм., бр. 7 и
                                                                12 от 2017 г., изм. и доп., бр. 39 от 2017 г., бр. 3 от
                                                                2019 г., изм., бр. 41 от 2021 г.) е изготвена таблица за
                                                                съответствие с Делегирана директива (ЕС) 2022/2407.
                                                                Проектът на наредба е съгласуван в рамките на Работна
                                                                група 9 „Транспортна политика“, за което е приложено
                                                                становище на работната група. </p>
                                                        </div>
                                                    </div>
                                                    <div class="modal-footer">
                                                        <button type="button" class="btn btn-primary">Изтегляне</button>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                        <!-- Modal END-->
                                    </li>

                                    <li class="list-group-item">
                                        <i class="fa-regular fa-file-pdf main-color me-2 fs-5"></i>
                                        <a href="#" class="main-color text-decoration-none" type="button"
                                           class="btn btn-primary" data-toggle="modal" data-target="#exampleModal2">Документ
                                            2</a>
                                        <!-- Modal -->
                                        <div class="modal fade" id="exampleModal2" tabindex="-1" role="dialog"
                                             aria-labelledby="exampleModalLabel2" aria-hidden="true">
                                            <div class="modal-dialog file-display" role="document">
                                                <div class="modal-content">
                                                    <div class="modal-header">
                                                        <h5 class="modal-title" id="exampleModalLabel2">ZID ZMSPMEIZZ2023.pdf</h5>
                                                        <a type="button" class="close" data-dismiss="modal"
                                                           aria-label="Close">
                                <span aria-hidden="true">
                                  <i class="fa-solid fa-xmark main-color fs-5"></i></span>
                                                        </a>
                                                    </div>
                                                    <div class="modal-body">
                                                        <div class="col-md-12">
                                                            <p> С проекта на наредба се предлагат: I. Промени, свързани
                                                                с въвеждането в националното законодателство на
                                                                Делегирана директива (ЕС) 2022/2407 на Комисията от 20
                                                                септември 2022 година за изменение на приложенията към
                                                                Директива 2008/68/ЕО на Европейския парламент и на
                                                                Съвета с оглед на адаптирането към научно-техническия
                                                                прогрес (ОВ L 317, 09/12/2022) (Делегирана директива
                                                                (ЕС) 2022/2407). Директива 2008/68/ЕО относно вътрешния
                                                                превоз на опасни товари (2008/68/ЕО) е въведена в
                                                                националното законодателство с Наредба № 46 от
                                                                30.11.2001 г. за железопътен превоз на опасни товари.
                                                                Съгласно чл. 8, параграф 1 от Директива 2008/68/ЕО,
                                                                Европейската комисия приема делегирани актове за
                                                                изменение на приложенията на директивата с цел отчитане
                                                                на измененията на ADR, RID и ADN, по-специално
                                                                свързаните с научния и техническия прогрес, включително
                                                                използването на технологии за локализиране и
                                                                проследяване. Приетите въз основа на цитирания текст
                                                                актове, въвеждащи изменения на приложенията към
                                                                Директива 2008/68/ЕО, са въведени в Наредба № 46, с
                                                                изключение на Делегирана директива (ЕС) 2022/2407.
                                                                Текстът, който следва да се транспонира от посочената
                                                                делегирана директива се съдържа в чл. 1, т. 2 от нея и
                                                                гласи: „в приложение II раздел II.1 се заменя със
                                                                следното: „II.1. RID </p>
                                                            <p>
                                                                <strong>Приложението към RID, приложимо от 1 януари 2023
                                                                    г., като се разбира, че където е уместно „RID
                                                                    договаряща държава" се заменя с „държава
                                                                    членка“.</strong>
                                                            </p>
                                                            <p> Подобен текст вече е транспониран и се съдържа в чл. 2,
                                                                ал. 1 от Наредба № 46. За да се транспонира Делегирана
                                                                директива (ЕС) 2022/2407 е необходимо да се добави
                                                                заглавието й в края на § 2 от Заключителните разпоредби
                                                                на действащата Наредба № 46, което се предлага в
                                                                параграф единствен от проекта на наредба. Предложеният
                                                                проект на Наредба за изменение и допълнение на Наредба №
                                                                46 не оказва пряко/или косвено въздействие върху
                                                                държавния бюджет. Не са необходими финансови и други
                                                                средства за прилагането на новата уредба. На основание
                                                                чл. 26, ал. 2-4 от Закона за нормативните актове
                                                                проектът на наредба, заедно с доклада към него, е
                                                                публикуван за обществено обсъждане на страницата на
                                                                Министерството на транспорта, информационните технологии
                                                                и съобщенията и на Портала за обществени консултации на
                                                                Министерски съвет. На заинтересованите лица е
                                                                предоставена възможност да се запознаят с проекта на
                                                                Наредба за изменение и допълнение на Наредба № 46 и да
                                                                представят писмени предложения или становища в 14-дневен
                                                                срок от публикуването им. </p>
                                                            <p>
                                                                <strong> Решението за определяне на по-кратък срок за
                                                                    обществено обсъждане на проекта на акт е взето в
                                                                    съответствие с изискванията на чл. 26, ал. 4,
                                                                    изречение второ от Закона за нормативните актове,
                                                                    като е съобразено, че публикуваният за обществено
                                                                    обсъждане проект на наредба включва разпоредби,
                                                                    които имат технически характер и чрез тях се въвежда
                                                                    изискването на чл. 1, параграф 2 от Делегирана
                                                                    директива (ЕС) 2022/2407, който регламентира
                                                                    актуалната редакция на правилата към RID – приложима
                                                                    от 1 януари 2023 г., която вече е в сила за
                                                                    Република България. </strong>
                                                            </p>
                                                            <p> В изпълнение на изискванията на чл. 3, ал. 4, т. 1 от
                                                                Постановление № 85 на Министерския съвет от 2007 г. за
                                                                координация по въпросите на Европейския съюз (обн., ДВ,
                                                                бр. 35 от 2007 г., изм., бр. 53 и 64 от 2008 г., бр. 34,
                                                                71, 78 и 83 от 2009 г., бр. 4, 5, 19 и 65 от 2010 г.,
                                                                попр., бр. 66 от 2010 г., изм., бр. 2 и 105 от 2011 г.,
                                                                доп., бр. 68 от 2012 г., изм., бр. 62, 65 и 80 от 2013
                                                                г., изм. и доп., бр. 53 от 2014 г., изм., бр. 76 от 2014
                                                                г., изм. и доп., бр. 94 от 2014 г., изм., бр. 101 от
                                                                2014 г., изм. и доп., бр. 6 от 2015 г., изм., бр. 36 от
                                                                2016 г., изм. и доп., бр. 79 от 2016 г., изм., бр. 7 и
                                                                12 от 2017 г., изм. и доп., бр. 39 от 2017 г., бр. 3 от
                                                                2019 г., изм., бр. 41 от 2021 г.) е изготвена таблица за
                                                                съответствие с Делегирана директива (ЕС) 2022/2407.
                                                                Проектът на наредба е съгласуван в рамките на Работна
                                                                група 9 „Транспортна политика“, за което е приложено
                                                                становище на работната група. </p>
                                                        </div>
                                                    </div>
                                                    <div class="modal-footer">
                                                        <button type="button" class="btn btn-primary">Изтегляне</button>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                        <!-- Modal END-->
                                    </li>

                                    <li class="list-group-item">
                                        <i class="fa-regular fa-file-pdf main-color me-2 fs-5"></i>
                                        <a href="#" class="main-color text-decoration-none" type="button"
                                           class="btn btn-primary" data-toggle="modal" data-target="#exampleModal3">Документ
                                            3</a>
                                        <!-- Modal -->
                                        <div class="modal fade" id="exampleModal3" tabindex="-1" role="dialog"
                                             aria-labelledby="exampleModalLabel3" aria-hidden="true">
                                            <div class="modal-dialog file-display" role="document">
                                                <div class="modal-content">
                                                    <div class="modal-header">
                                                        <h5 class="modal-title" id="exampleModalLabel">Motivi_ZMSPZZ2023.pdf</h5>
                                                        <a type="button" class="close" data-dismiss="modal"
                                                           aria-label="Close">
                              <span aria-hidden="true">
                                <i class="fa-solid fa-xmark main-color fs-5"></i></span>
                                                        </a>
                                                    </div>
                                                    <div class="modal-body">
                                                        <div class="col-md-12">
                                                            <p> С проекта на наредба се предлагат: I. Промени, свързани
                                                                с въвеждането в националното законодателство на
                                                                Делегирана директива (ЕС) 2022/2407 на Комисията от 20
                                                                септември 2022 година за изменение на приложенията към
                                                                Директива 2008/68/ЕО на Европейския парламент и на
                                                                Съвета с оглед на адаптирането към научно-техническия
                                                                прогрес (ОВ L 317, 09/12/2022) (Делегирана директива
                                                                (ЕС) 2022/2407). Директива 2008/68/ЕО относно вътрешния
                                                                превоз на опасни товари (2008/68/ЕО) е въведена в
                                                                националното законодателство с Наредба № 46 от
                                                                30.11.2001 г. за железопътен превоз на опасни товари.
                                                                Съгласно чл. 8, параграф 1 от Директива 2008/68/ЕО,
                                                                Европейската комисия приема делегирани актове за
                                                                изменение на приложенията на директивата с цел отчитане
                                                                на измененията на ADR, RID и ADN, по-специално
                                                                свързаните с научния и техническия прогрес, включително
                                                                използването на технологии за локализиране и
                                                                проследяване. Приетите въз основа на цитирания текст
                                                                актове, въвеждащи изменения на приложенията към
                                                                Директива 2008/68/ЕО, са въведени в Наредба № 46, с
                                                                изключение на Делегирана директива (ЕС) 2022/2407.
                                                                Текстът, който следва да се транспонира от посочената
                                                                делегирана директива се съдържа в чл. 1, т. 2 от нея и
                                                                гласи: „в приложение II раздел II.1 се заменя със
                                                                следното: „II.1. RID </p>
                                                            <p>
                                                                <strong>Приложението към RID, приложимо от 1 януари 2023
                                                                    г., като се разбира, че където е уместно „RID
                                                                    договаряща държава" се заменя с „държава
                                                                    членка“.</strong>
                                                            </p>
                                                            <p> Подобен текст вече е транспониран и се съдържа в чл. 2,
                                                                ал. 1 от Наредба № 46. За да се транспонира Делегирана
                                                                директива (ЕС) 2022/2407 е необходимо да се добави
                                                                заглавието й в края на § 2 от Заключителните разпоредби
                                                                на действащата Наредба № 46, което се предлага в
                                                                параграф единствен от проекта на наредба. Предложеният
                                                                проект на Наредба за изменение и допълнение на Наредба №
                                                                46 не оказва пряко/или косвено въздействие върху
                                                                държавния бюджет. Не са необходими финансови и други
                                                                средства за прилагането на новата уредба. На основание
                                                                чл. 26, ал. 2-4 от Закона за нормативните актове
                                                                проектът на наредба, заедно с доклада към него, е
                                                                публикуван за обществено обсъждане на страницата на
                                                                Министерството на транспорта, информационните технологии
                                                                и съобщенията и на Портала за обществени консултации на
                                                                Министерски съвет. На заинтересованите лица е
                                                                предоставена възможност да се запознаят с проекта на
                                                                Наредба за изменение и допълнение на Наредба № 46 и да
                                                                представят писмени предложения или становища в 14-дневен
                                                                срок от публикуването им. </p>
                                                            <p>
                                                                <strong> Решението за определяне на по-кратък срок за
                                                                    обществено обсъждане на проекта на акт е взето в
                                                                    съответствие с изискванията на чл. 26, ал. 4,
                                                                    изречение второ от Закона за нормативните актове,
                                                                    като е съобразено, че публикуваният за обществено
                                                                    обсъждане проект на наредба включва разпоредби,
                                                                    които имат технически характер и чрез тях се въвежда
                                                                    изискването на чл. 1, параграф 2 от Делегирана
                                                                    директива (ЕС) 2022/2407, който регламентира
                                                                    актуалната редакция на правилата към RID – приложима
                                                                    от 1 януари 2023 г., която вече е в сила за
                                                                    Република България. </strong>
                                                            </p>
                                                            <p> В изпълнение на изискванията на чл. 3, ал. 4, т. 1 от
                                                                Постановление № 85 на Министерския съвет от 2007 г. за
                                                                координация по въпросите на Европейския съюз (обн., ДВ,
                                                                бр. 35 от 2007 г., изм., бр. 53 и 64 от 2008 г., бр. 34,
                                                                71, 78 и 83 от 2009 г., бр. 4, 5, 19 и 65 от 2010 г.,
                                                                попр., бр. 66 от 2010 г., изм., бр. 2 и 105 от 2011 г.,
                                                                доп., бр. 68 от 2012 г., изм., бр. 62, 65 и 80 от 2013
                                                                г., изм. и доп., бр. 53 от 2014 г., изм., бр. 76 от 2014
                                                                г., изм. и доп., бр. 94 от 2014 г., изм., бр. 101 от
                                                                2014 г., изм. и доп., бр. 6 от 2015 г., изм., бр. 36 от
                                                                2016 г., изм. и доп., бр. 79 от 2016 г., изм., бр. 7 и
                                                                12 от 2017 г., изм. и доп., бр. 39 от 2017 г., бр. 3 от
                                                                2019 г., изм., бр. 41 от 2021 г.) е изготвена таблица за
                                                                съответствие с Делегирана директива (ЕС) 2022/2407.
                                                                Проектът на наредба е съгласуван в рамките на Работна
                                                                група 9 „Транспортна политика“, за което е приложено
                                                                становище на работната група. </p>
                                                        </div>
                                                    </div>
                                                    <div class="modal-footer">
                                                        <button type="button" class="btn btn-primary">Изтегляне</button>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </li>
                                    <!-- Modal END-->
                                </ul>
                            </div>

                            <div class="col-md-4">
                                <p class="fs-18 fw-600 main-color-light-bgr p-2 rounded mb-2">Консултационен
                                    документ</p>
                                <ul class="list-group list-group-flush">
                                    <li class="list-group-item">
                                        <i class="fa-regular fa-file-pdf main-color me-2 fs-5"></i>
                                        <a href="#" class="main-color text-decoration-none" type="button"
                                           class="btn btn-primary" data-toggle="modal" data-target="#exampleModal">Документ
                                            1</a>
                                        <!-- Modal -->
                                        <div class="modal fade" id="exampleModal" tabindex="-1" role="dialog"
                                             aria-labelledby="exampleModalLabel" aria-hidden="true">
                                            <div class="modal-dialog file-display" role="document">
                                                <div class="modal-content">
                                                    <div class="modal-header">
                                                        <h5 class="modal-title" id="exampleModalLabel">03-00-511_06-11-2023__1854.30б.2023 ОВ.pdf</h5>
                                                        <a type="button" class="close" data-dismiss="modal"
                                                           aria-label="Close">
                                  <span aria-hidden="true">
                                    <i class="fa-solid fa-xmark main-color fs-5"></i></span>
                                                        </a>
                                                    </div>
                                                    <div class="modal-body">
                                                        <div class="col-md-12">
                                                            <p> С проекта на наредба се предлагат: I. Промени, свързани
                                                                с въвеждането в националното законодателство на
                                                                Делегирана директива (ЕС) 2022/2407 на Комисията от 20
                                                                септември 2022 година за изменение на приложенията към
                                                                Директива 2008/68/ЕО на Европейския парламент и на
                                                                Съвета с оглед на адаптирането към научно-техническия
                                                                прогрес (ОВ L 317, 09/12/2022) (Делегирана директива
                                                                (ЕС) 2022/2407). Директива 2008/68/ЕО относно вътрешния
                                                                превоз на опасни товари (2008/68/ЕО) е въведена в
                                                                националното законодателство с Наредба № 46 от
                                                                30.11.2001 г. за железопътен превоз на опасни товари.
                                                                Съгласно чл. 8, параграф 1 от Директива 2008/68/ЕО,
                                                                Европейската комисия приема делегирани актове за
                                                                изменение на приложенията на директивата с цел отчитане
                                                                на измененията на ADR, RID и ADN, по-специално
                                                                свързаните с научния и техническия прогрес, включително
                                                                използването на технологии за локализиране и
                                                                проследяване. Приетите въз основа на цитирания текст
                                                                актове, въвеждащи изменения на приложенията към
                                                                Директива 2008/68/ЕО, са въведени в Наредба № 46, с
                                                                изключение на Делегирана директива (ЕС) 2022/2407.
                                                                Текстът, който следва да се транспонира от посочената
                                                                делегирана директива се съдържа в чл. 1, т. 2 от нея и
                                                                гласи: „в приложение II раздел II.1 се заменя със
                                                                следното: „II.1. RID </p>
                                                            <p>
                                                                <strong>Приложението към RID, приложимо от 1 януари 2023
                                                                    г., като се разбира, че където е уместно „RID
                                                                    договаряща държава" се заменя с „държава
                                                                    членка“.</strong>
                                                            </p>
                                                            <p> Подобен текст вече е транспониран и се съдържа в чл. 2,
                                                                ал. 1 от Наредба № 46. За да се транспонира Делегирана
                                                                директива (ЕС) 2022/2407 е необходимо да се добави
                                                                заглавието й в края на § 2 от Заключителните разпоредби
                                                                на действащата Наредба № 46, което се предлага в
                                                                параграф единствен от проекта на наредба. Предложеният
                                                                проект на Наредба за изменение и допълнение на Наредба №
                                                                46 не оказва пряко/или косвено въздействие върху
                                                                държавния бюджет. Не са необходими финансови и други
                                                                средства за прилагането на новата уредба. На основание
                                                                чл. 26, ал. 2-4 от Закона за нормативните актове
                                                                проектът на наредба, заедно с доклада към него, е
                                                                публикуван за обществено обсъждане на страницата на
                                                                Министерството на транспорта, информационните технологии
                                                                и съобщенията и на Портала за обществени консултации на
                                                                Министерски съвет. На заинтересованите лица е
                                                                предоставена възможност да се запознаят с проекта на
                                                                Наредба за изменение и допълнение на Наредба № 46 и да
                                                                представят писмени предложения или становища в 14-дневен
                                                                срок от публикуването им. </p>
                                                            <p>
                                                                <strong> Решението за определяне на по-кратък срок за
                                                                    обществено обсъждане на проекта на акт е взето в
                                                                    съответствие с изискванията на чл. 26, ал. 4,
                                                                    изречение второ от Закона за нормативните актове,
                                                                    като е съобразено, че публикуваният за обществено
                                                                    обсъждане проект на наредба включва разпоредби,
                                                                    които имат технически характер и чрез тях се въвежда
                                                                    изискването на чл. 1, параграф 2 от Делегирана
                                                                    директива (ЕС) 2022/2407, който регламентира
                                                                    актуалната редакция на правилата към RID – приложима
                                                                    от 1 януари 2023 г., която вече е в сила за
                                                                    Република България. </strong>
                                                            </p>
                                                            <p> В изпълнение на изискванията на чл. 3, ал. 4, т. 1 от
                                                                Постановление № 85 на Министерския съвет от 2007 г. за
                                                                координация по въпросите на Европейския съюз (обн., ДВ,
                                                                бр. 35 от 2007 г., изм., бр. 53 и 64 от 2008 г., бр. 34,
                                                                71, 78 и 83 от 2009 г., бр. 4, 5, 19 и 65 от 2010 г.,
                                                                попр., бр. 66 от 2010 г., изм., бр. 2 и 105 от 2011 г.,
                                                                доп., бр. 68 от 2012 г., изм., бр. 62, 65 и 80 от 2013
                                                                г., изм. и доп., бр. 53 от 2014 г., изм., бр. 76 от 2014
                                                                г., изм. и доп., бр. 94 от 2014 г., изм., бр. 101 от
                                                                2014 г., изм. и доп., бр. 6 от 2015 г., изм., бр. 36 от
                                                                2016 г., изм. и доп., бр. 79 от 2016 г., изм., бр. 7 и
                                                                12 от 2017 г., изм. и доп., бр. 39 от 2017 г., бр. 3 от
                                                                2019 г., изм., бр. 41 от 2021 г.) е изготвена таблица за
                                                                съответствие с Делегирана директива (ЕС) 2022/2407.
                                                                Проектът на наредба е съгласуван в рамките на Работна
                                                                група 9 „Транспортна политика“, за което е приложено
                                                                становище на работната група. </p>
                                                        </div>
                                                    </div>
                                                    <div class="modal-footer">
                                                        <button type="button" class="btn btn-primary">Изтегляне</button>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                        <!-- Modal END-->
                                    </li>

                                    <li class="list-group-item">
                                        <i class="fa-regular fa-file-pdf main-color me-2 fs-5"></i>
                                        <a href="#" class="main-color text-decoration-none" type="button"
                                           class="btn btn-primary" data-toggle="modal" data-target="#exampleModal2">Документ
                                            2</a>
                                        <!-- Modal -->
                                        <div class="modal fade" id="exampleModal2" tabindex="-1" role="dialog"
                                             aria-labelledby="exampleModalLabel2" aria-hidden="true">
                                            <div class="modal-dialog file-display" role="document">
                                                <div class="modal-content">
                                                    <div class="modal-header">
                                                        <h5 class="modal-title" id="exampleModalLabel2">Ocenka ZID ZMSP 081123_P2.pdf</h5>
                                                        <a type="button" class="close" data-dismiss="modal"
                                                           aria-label="Close">
                                <span aria-hidden="true">
                                  <i class="fa-solid fa-xmark main-color fs-5"></i></span>
                                                        </a>
                                                    </div>
                                                    <div class="modal-body">
                                                        <div class="col-md-12">
                                                            <p> С проекта на наредба се предлагат: I. Промени, свързани
                                                                с въвеждането в националното законодателство на
                                                                Делегирана директива (ЕС) 2022/2407 на Комисията от 20
                                                                септември 2022 година за изменение на приложенията към
                                                                Директива 2008/68/ЕО на Европейския парламент и на
                                                                Съвета с оглед на адаптирането към научно-техническия
                                                                прогрес (ОВ L 317, 09/12/2022) (Делегирана директива
                                                                (ЕС) 2022/2407). Директива 2008/68/ЕО относно вътрешния
                                                                превоз на опасни товари (2008/68/ЕО) е въведена в
                                                                националното законодателство с Наредба № 46 от
                                                                30.11.2001 г. за железопътен превоз на опасни товари.
                                                                Съгласно чл. 8, параграф 1 от Директива 2008/68/ЕО,
                                                                Европейската комисия приема делегирани актове за
                                                                изменение на приложенията на директивата с цел отчитане
                                                                на измененията на ADR, RID и ADN, по-специално
                                                                свързаните с научния и техническия прогрес, включително
                                                                използването на технологии за локализиране и
                                                                проследяване. Приетите въз основа на цитирания текст
                                                                актове, въвеждащи изменения на приложенията към
                                                                Директива 2008/68/ЕО, са въведени в Наредба № 46, с
                                                                изключение на Делегирана директива (ЕС) 2022/2407.
                                                                Текстът, който следва да се транспонира от посочената
                                                                делегирана директива се съдържа в чл. 1, т. 2 от нея и
                                                                гласи: „в приложение II раздел II.1 се заменя със
                                                                следното: „II.1. RID </p>
                                                            <p>
                                                                <strong>Приложението към RID, приложимо от 1 януари 2023
                                                                    г., като се разбира, че където е уместно „RID
                                                                    договаряща държава" се заменя с „държава
                                                                    членка“.</strong>
                                                            </p>
                                                            <p> Подобен текст вече е транспониран и се съдържа в чл. 2,
                                                                ал. 1 от Наредба № 46. За да се транспонира Делегирана
                                                                директива (ЕС) 2022/2407 е необходимо да се добави
                                                                заглавието й в края на § 2 от Заключителните разпоредби
                                                                на действащата Наредба № 46, което се предлага в
                                                                параграф единствен от проекта на наредба. Предложеният
                                                                проект на Наредба за изменение и допълнение на Наредба №
                                                                46 не оказва пряко/или косвено въздействие върху
                                                                държавния бюджет. Не са необходими финансови и други
                                                                средства за прилагането на новата уредба. На основание
                                                                чл. 26, ал. 2-4 от Закона за нормативните актове
                                                                проектът на наредба, заедно с доклада към него, е
                                                                публикуван за обществено обсъждане на страницата на
                                                                Министерството на транспорта, информационните технологии
                                                                и съобщенията и на Портала за обществени консултации на
                                                                Министерски съвет. На заинтересованите лица е
                                                                предоставена възможност да се запознаят с проекта на
                                                                Наредба за изменение и допълнение на Наредба № 46 и да
                                                                представят писмени предложения или становища в 14-дневен
                                                                срок от публикуването им. </p>
                                                            <p>
                                                                <strong> Решението за определяне на по-кратък срок за
                                                                    обществено обсъждане на проекта на акт е взето в
                                                                    съответствие с изискванията на чл. 26, ал. 4,
                                                                    изречение второ от Закона за нормативните актове,
                                                                    като е съобразено, че публикуваният за обществено
                                                                    обсъждане проект на наредба включва разпоредби,
                                                                    които имат технически характер и чрез тях се въвежда
                                                                    изискването на чл. 1, параграф 2 от Делегирана
                                                                    директива (ЕС) 2022/2407, който регламентира
                                                                    актуалната редакция на правилата към RID – приложима
                                                                    от 1 януари 2023 г., която вече е в сила за
                                                                    Република България. </strong>
                                                            </p>
                                                            <p> В изпълнение на изискванията на чл. 3, ал. 4, т. 1 от
                                                                Постановление № 85 на Министерския съвет от 2007 г. за
                                                                координация по въпросите на Европейския съюз (обн., ДВ,
                                                                бр. 35 от 2007 г., изм., бр. 53 и 64 от 2008 г., бр. 34,
                                                                71, 78 и 83 от 2009 г., бр. 4, 5, 19 и 65 от 2010 г.,
                                                                попр., бр. 66 от 2010 г., изм., бр. 2 и 105 от 2011 г.,
                                                                доп., бр. 68 от 2012 г., изм., бр. 62, 65 и 80 от 2013
                                                                г., изм. и доп., бр. 53 от 2014 г., изм., бр. 76 от 2014
                                                                г., изм. и доп., бр. 94 от 2014 г., изм., бр. 101 от
                                                                2014 г., изм. и доп., бр. 6 от 2015 г., изм., бр. 36 от
                                                                2016 г., изм. и доп., бр. 79 от 2016 г., изм., бр. 7 и
                                                                12 от 2017 г., изм. и доп., бр. 39 от 2017 г., бр. 3 от
                                                                2019 г., изм., бр. 41 от 2021 г.) е изготвена таблица за
                                                                съответствие с Делегирана директива (ЕС) 2022/2407.
                                                                Проектът на наредба е съгласуван в рамките на Работна
                                                                група 9 „Транспортна политика“, за което е приложено
                                                                становище на работната група. </p>
                                                        </div>
                                                    </div>
                                                    <div class="modal-footer">
                                                        <button type="button" class="btn btn-primary">Изтегляне</button>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                        <!-- Modal END-->
                                    </li>

                                    <li class="list-group-item">
                                        <i class="fa-regular fa-file-pdf main-color me-2 fs-5"></i>
                                        <a href="#" class="main-color text-decoration-none" type="button"
                                           class="btn btn-primary" data-toggle="modal" data-target="#exampleModal3">Документ
                                            3</a>
                                        <!-- Modal -->
                                        <div class="modal fade" id="exampleModal3" tabindex="-1" role="dialog"
                                             aria-labelledby="exampleModalLabel3" aria-hidden="true">
                                            <div class="modal-dialog file-display" role="document">
                                                <div class="modal-content">
                                                    <div class="modal-header">
                                                        <h5 class="modal-title" id="exampleModalLabel">Документ 3</h5>
                                                        <a type="button" class="close" data-dismiss="modal"
                                                           aria-label="Close">
                              <span aria-hidden="true">
                                <i class="fa-solid fa-xmark main-color fs-5"></i></span>
                                                        </a>
                                                    </div>
                                                    <div class="modal-body">
                                                        <div class="col-md-12">
                                                            <p> С проекта на наредба се предлагат: I. Промени, свързани
                                                                с въвеждането в националното законодателство на
                                                                Делегирана директива (ЕС) 2022/2407 на Комисията от 20
                                                                септември 2022 година за изменение на приложенията към
                                                                Директива 2008/68/ЕО на Европейския парламент и на
                                                                Съвета с оглед на адаптирането към научно-техническия
                                                                прогрес (ОВ L 317, 09/12/2022) (Делегирана директива
                                                                (ЕС) 2022/2407). Директива 2008/68/ЕО относно вътрешния
                                                                превоз на опасни товари (2008/68/ЕО) е въведена в
                                                                националното законодателство с Наредба № 46 от
                                                                30.11.2001 г. за железопътен превоз на опасни товари.
                                                                Съгласно чл. 8, параграф 1 от Директива 2008/68/ЕО,
                                                                Европейската комисия приема делегирани актове за
                                                                изменение на приложенията на директивата с цел отчитане
                                                                на измененията на ADR, RID и ADN, по-специално
                                                                свързаните с научния и техническия прогрес, включително
                                                                използването на технологии за локализиране и
                                                                проследяване. Приетите въз основа на цитирания текст
                                                                актове, въвеждащи изменения на приложенията към
                                                                Директива 2008/68/ЕО, са въведени в Наредба № 46, с
                                                                изключение на Делегирана директива (ЕС) 2022/2407.
                                                                Текстът, който следва да се транспонира от посочената
                                                                делегирана директива се съдържа в чл. 1, т. 2 от нея и
                                                                гласи: „в приложение II раздел II.1 се заменя със
                                                                следното: „II.1. RID </p>
                                                            <p>
                                                                <strong>Приложението към RID, приложимо от 1 януари 2023
                                                                    г., като се разбира, че където е уместно „RID
                                                                    договаряща държава" се заменя с „държава
                                                                    членка“.</strong>
                                                            </p>
                                                            <p> Подобен текст вече е транспониран и се съдържа в чл. 2,
                                                                ал. 1 от Наредба № 46. За да се транспонира Делегирана
                                                                директива (ЕС) 2022/2407 е необходимо да се добави
                                                                заглавието й в края на § 2 от Заключителните разпоредби
                                                                на действащата Наредба № 46, което се предлага в
                                                                параграф единствен от проекта на наредба. Предложеният
                                                                проект на Наредба за изменение и допълнение на Наредба №
                                                                46 не оказва пряко/или косвено въздействие върху
                                                                държавния бюджет. Не са необходими финансови и други
                                                                средства за прилагането на новата уредба. На основание
                                                                чл. 26, ал. 2-4 от Закона за нормативните актове
                                                                проектът на наредба, заедно с доклада към него, е
                                                                публикуван за обществено обсъждане на страницата на
                                                                Министерството на транспорта, информационните технологии
                                                                и съобщенията и на Портала за обществени консултации на
                                                                Министерски съвет. На заинтересованите лица е
                                                                предоставена възможност да се запознаят с проекта на
                                                                Наредба за изменение и допълнение на Наредба № 46 и да
                                                                представят писмени предложения или становища в 14-дневен
                                                                срок от публикуването им. </p>
                                                            <p>
                                                                <strong> Решението за определяне на по-кратък срок за
                                                                    обществено обсъждане на проекта на акт е взето в
                                                                    съответствие с изискванията на чл. 26, ал. 4,
                                                                    изречение второ от Закона за нормативните актове,
                                                                    като е съобразено, че публикуваният за обществено
                                                                    обсъждане проект на наредба включва разпоредби,
                                                                    които имат технически характер и чрез тях се въвежда
                                                                    изискването на чл. 1, параграф 2 от Делегирана
                                                                    директива (ЕС) 2022/2407, който регламентира
                                                                    актуалната редакция на правилата към RID – приложима
                                                                    от 1 януари 2023 г., която вече е в сила за
                                                                    Република България. </strong>
                                                            </p>
                                                            <p> В изпълнение на изискванията на чл. 3, ал. 4, т. 1 от
                                                                Постановление № 85 на Министерския съвет от 2007 г. за
                                                                координация по въпросите на Европейския съюз (обн., ДВ,
                                                                бр. 35 от 2007 г., изм., бр. 53 и 64 от 2008 г., бр. 34,
                                                                71, 78 и 83 от 2009 г., бр. 4, 5, 19 и 65 от 2010 г.,
                                                                попр., бр. 66 от 2010 г., изм., бр. 2 и 105 от 2011 г.,
                                                                доп., бр. 68 от 2012 г., изм., бр. 62, 65 и 80 от 2013
                                                                г., изм. и доп., бр. 53 от 2014 г., изм., бр. 76 от 2014
                                                                г., изм. и доп., бр. 94 от 2014 г., изм., бр. 101 от
                                                                2014 г., изм. и доп., бр. 6 от 2015 г., изм., бр. 36 от
                                                                2016 г., изм. и доп., бр. 79 от 2016 г., изм., бр. 7 и
                                                                12 от 2017 г., изм. и доп., бр. 39 от 2017 г., бр. 3 от
                                                                2019 г., изм., бр. 41 от 2021 г.) е изготвена таблица за
                                                                съответствие с Делегирана директива (ЕС) 2022/2407.
                                                                Проектът на наредба е съгласуван в рамките на Работна
                                                                група 9 „Транспортна политика“, за което е приложено
                                                                становище на работната група. </p>
                                                        </div>
                                                    </div>
                                                    <div class="modal-footer">
                                                        <button type="button" class="btn btn-primary">Изтегляне</button>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </li>
                                    <!-- Modal END-->
                                </ul>
                            </div>


                            <div class="col-md-4">
                                <p class="fs-18 fw-600 main-color-light-bgr p-2 rounded mb-2">Справка с всички
                                    становища</p>
                                <ul class="list-group list-group-flush">
                                    <li class="list-group-item">
                                        <i class="fa-regular fa-file-pdf main-color me-2 fs-5"></i>
                                        <a href="#" class="main-color text-decoration-none" type="button"
                                           class="btn btn-primary" data-toggle="modal" data-target="#exampleModal11">Справка
                                            1</a>
                                        <!-- Modal -->
                                        <div class="modal fade" id="exampleModal11" tabindex="-1" role="dialog"
                                             aria-labelledby="exampleModalLabel11" aria-hidden="true">
                                            <div class="modal-dialog file-display" role="document">
                                                <div class="modal-content">
                                                    <div class="modal-header">
                                                        <h5 class="modal-title" id="exampleModalLabel11">Справка 1</h5>
                                                        <a type="button" class="close" data-dismiss="modal"
                                                           aria-label="Close">
                                  <span aria-hidden="true">
                                    <i class="fa-solid fa-xmark main-color fs-5"></i></span>
                                                        </a>
                                                    </div>
                                                    <div class="modal-body">
                                                        <div class="col-md-12">
                                                            <p> С проекта на наредба се предлагат: I. Промени, свързани
                                                                с въвеждането в националното законодателство на
                                                                Делегирана директива (ЕС) 2022/2407 на Комисията от 20
                                                                септември 2022 година за изменение на приложенията към
                                                                Директива 2008/68/ЕО на Европейския парламент и на
                                                                Съвета с оглед на адаптирането към научно-техническия
                                                                прогрес (ОВ L 317, 09/12/2022) (Делегирана директива
                                                                (ЕС) 2022/2407). Директива 2008/68/ЕО относно вътрешния
                                                                превоз на опасни товари (2008/68/ЕО) е въведена в
                                                                националното законодателство с Наредба № 46 от
                                                                30.11.2001 г. за железопътен превоз на опасни товари.
                                                                Съгласно чл. 8, параграф 1 от Директива 2008/68/ЕО,
                                                                Европейската комисия приема делегирани актове за
                                                                изменение на приложенията на директивата с цел отчитане
                                                                на измененията на ADR, RID и ADN, по-специално
                                                                свързаните с научния и техническия прогрес, включително
                                                                използването на технологии за локализиране и
                                                                проследяване. Приетите въз основа на цитирания текст
                                                                актове, въвеждащи изменения на приложенията към
                                                                Директива 2008/68/ЕО, са въведени в Наредба № 46, с
                                                                изключение на Делегирана директива (ЕС) 2022/2407.
                                                                Текстът, който следва да се транспонира от посочената
                                                                делегирана директива се съдържа в чл. 1, т. 2 от нея и
                                                                гласи: „в приложение II раздел II.1 се заменя със
                                                                следното: „II.1. RID </p>
                                                            <p>
                                                                <strong>Приложението към RID, приложимо от 1 януари 2023
                                                                    г., като се разбира, че където е уместно „RID
                                                                    договаряща държава" се заменя с „държава
                                                                    членка“.</strong>
                                                            </p>
                                                            <p> Подобен текст вече е транспониран и се съдържа в чл. 2,
                                                                ал. 1 от Наредба № 46. За да се транспонира Делегирана
                                                                директива (ЕС) 2022/2407 е необходимо да се добави
                                                                заглавието й в края на § 2 от Заключителните разпоредби
                                                                на действащата Наредба № 46, което се предлага в
                                                                параграф единствен от проекта на наредба. Предложеният
                                                                проект на Наредба за изменение и допълнение на Наредба №
                                                                46 не оказва пряко/или косвено въздействие върху
                                                                държавния бюджет. Не са необходими финансови и други
                                                                средства за прилагането на новата уредба. На основание
                                                                чл. 26, ал. 2-4 от Закона за нормативните актове
                                                                проектът на наредба, заедно с доклада към него, е
                                                                публикуван за обществено обсъждане на страницата на
                                                                Министерството на транспорта, информационните технологии
                                                                и съобщенията и на Портала за обществени консултации на
                                                                Министерски съвет. На заинтересованите лица е
                                                                предоставена възможност да се запознаят с проекта на
                                                                Наредба за изменение и допълнение на Наредба № 46 и да
                                                                представят писмени предложения или становища в 14-дневен
                                                                срок от публикуването им. </p>
                                                            <p>
                                                                <strong> Решението за определяне на по-кратък срок за
                                                                    обществено обсъждане на проекта на акт е взето в
                                                                    съответствие с изискванията на чл. 26, ал. 4,
                                                                    изречение второ от Закона за нормативните актове,
                                                                    като е съобразено, че публикуваният за обществено
                                                                    обсъждане проект на наредба включва разпоредби,
                                                                    които имат технически характер и чрез тях се въвежда
                                                                    изискването на чл. 1, параграф 2 от Делегирана
                                                                    директива (ЕС) 2022/2407, който регламентира
                                                                    актуалната редакция на правилата към RID – приложима
                                                                    от 1 януари 2023 г., която вече е в сила за
                                                                    Република България. </strong>
                                                            </p>
                                                            <p> В изпълнение на изискванията на чл. 3, ал. 4, т. 1 от
                                                                Постановление № 85 на Министерския съвет от 2007 г. за
                                                                координация по въпросите на Европейския съюз (обн., ДВ,
                                                                бр. 35 от 2007 г., изм., бр. 53 и 64 от 2008 г., бр. 34,
                                                                71, 78 и 83 от 2009 г., бр. 4, 5, 19 и 65 от 2010 г.,
                                                                попр., бр. 66 от 2010 г., изм., бр. 2 и 105 от 2011 г.,
                                                                доп., бр. 68 от 2012 г., изм., бр. 62, 65 и 80 от 2013
                                                                г., изм. и доп., бр. 53 от 2014 г., изм., бр. 76 от 2014
                                                                г., изм. и доп., бр. 94 от 2014 г., изм., бр. 101 от
                                                                2014 г., изм. и доп., бр. 6 от 2015 г., изм., бр. 36 от
                                                                2016 г., изм. и доп., бр. 79 от 2016 г., изм., бр. 7 и
                                                                12 от 2017 г., изм. и доп., бр. 39 от 2017 г., бр. 3 от
                                                                2019 г., изм., бр. 41 от 2021 г.) е изготвена таблица за
                                                                съответствие с Делегирана директива (ЕС) 2022/2407.
                                                                Проектът на наредба е съгласуван в рамките на Работна
                                                                група 9 „Транспортна политика“, за което е приложено
                                                                становище на работната група. </p>
                                                        </div>
                                                    </div>
                                                    <div class="modal-footer">
                                                        <button type="button" class="btn btn-primary">Изтегляне</button>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                        <!-- Modal END-->
                                    </li>

                                    <li class="list-group-item">
                                        <i class="fa-regular fa-file-pdf main-color me-2 fs-5"></i>
                                        <a href="#" class="main-color text-decoration-none" type="button"
                                           class="btn btn-primary" data-toggle="modal" data-target="#exampleModal22">Справка
                                            2</a>
                                        <!-- Modal -->
                                        <div class="modal fade" id="exampleModal22" tabindex="-1" role="dialog"
                                             aria-labelledby="exampleModalLabel11" aria-hidden="true">
                                            <div class="modal-dialog file-display" role="document">
                                                <div class="modal-content">
                                                    <div class="modal-header">
                                                        <h5 class="modal-title" id="exampleModalLabel11">Справка 2</h5>
                                                        <a type="button" class="close" data-dismiss="modal"
                                                           aria-label="Close">
                                <span aria-hidden="true">
                                  <i class="fa-solid fa-xmark main-color fs-5"></i></span>
                                                        </a>
                                                    </div>
                                                    <div class="modal-body">
                                                        <div class="col-md-12">
                                                            <p> С проекта на наредба се предлагат: I. Промени, свързани
                                                                с въвеждането в националното законодателство на
                                                                Делегирана директива (ЕС) 2022/2407 на Комисията от 20
                                                                септември 2022 година за изменение на приложенията към
                                                                Директива 2008/68/ЕО на Европейския парламент и на
                                                                Съвета с оглед на адаптирането към научно-техническия
                                                                прогрес (ОВ L 317, 09/12/2022) (Делегирана директива
                                                                (ЕС) 2022/2407). Директива 2008/68/ЕО относно вътрешния
                                                                превоз на опасни товари (2008/68/ЕО) е въведена в
                                                                националното законодателство с Наредба № 46 от
                                                                30.11.2001 г. за железопътен превоз на опасни товари.
                                                                Съгласно чл. 8, параграф 1 от Директива 2008/68/ЕО,
                                                                Европейската комисия приема делегирани актове за
                                                                изменение на приложенията на директивата с цел отчитане
                                                                на измененията на ADR, RID и ADN, по-специално
                                                                свързаните с научния и техническия прогрес, включително
                                                                използването на технологии за локализиране и
                                                                проследяване. Приетите въз основа на цитирания текст
                                                                актове, въвеждащи изменения на приложенията към
                                                                Директива 2008/68/ЕО, са въведени в Наредба № 46, с
                                                                изключение на Делегирана директива (ЕС) 2022/2407.
                                                                Текстът, който следва да се транспонира от посочената
                                                                делегирана директива се съдържа в чл. 1, т. 2 от нея и
                                                                гласи: „в приложение II раздел II.1 се заменя със
                                                                следното: „II.1. RID </p>
                                                            <p>
                                                                <strong>Приложението към RID, приложимо от 1 януари 2023
                                                                    г., като се разбира, че където е уместно „RID
                                                                    договаряща държава" се заменя с „държава
                                                                    членка“.</strong>
                                                            </p>
                                                            <p> Подобен текст вече е транспониран и се съдържа в чл. 2,
                                                                ал. 1 от Наредба № 46. За да се транспонира Делегирана
                                                                директива (ЕС) 2022/2407 е необходимо да се добави
                                                                заглавието й в края на § 2 от Заключителните разпоредби
                                                                на действащата Наредба № 46, което се предлага в
                                                                параграф единствен от проекта на наредба. Предложеният
                                                                проект на Наредба за изменение и допълнение на Наредба №
                                                                46 не оказва пряко/или косвено въздействие върху
                                                                държавния бюджет. Не са необходими финансови и други
                                                                средства за прилагането на новата уредба. На основание
                                                                чл. 26, ал. 2-4 от Закона за нормативните актове
                                                                проектът на наредба, заедно с доклада към него, е
                                                                публикуван за обществено обсъждане на страницата на
                                                                Министерството на транспорта, информационните технологии
                                                                и съобщенията и на Портала за обществени консултации на
                                                                Министерски съвет. На заинтересованите лица е
                                                                предоставена възможност да се запознаят с проекта на
                                                                Наредба за изменение и допълнение на Наредба № 46 и да
                                                                представят писмени предложения или становища в 14-дневен
                                                                срок от публикуването им. </p>
                                                            <p>
                                                                <strong> Решението за определяне на по-кратък срок за
                                                                    обществено обсъждане на проекта на акт е взето в
                                                                    съответствие с изискванията на чл. 26, ал. 4,
                                                                    изречение второ от Закона за нормативните актове,
                                                                    като е съобразено, че публикуваният за обществено
                                                                    обсъждане проект на наредба включва разпоредби,
                                                                    които имат технически характер и чрез тях се въвежда
                                                                    изискването на чл. 1, параграф 2 от Делегирана
                                                                    директива (ЕС) 2022/2407, който регламентира
                                                                    актуалната редакция на правилата към RID – приложима
                                                                    от 1 януари 2023 г., която вече е в сила за
                                                                    Република България. </strong>
                                                            </p>
                                                            <p> В изпълнение на изискванията на чл. 3, ал. 4, т. 1 от
                                                                Постановление № 85 на Министерския съвет от 2007 г. за
                                                                координация по въпросите на Европейския съюз (обн., ДВ,
                                                                бр. 35 от 2007 г., изм., бр. 53 и 64 от 2008 г., бр. 34,
                                                                71, 78 и 83 от 2009 г., бр. 4, 5, 19 и 65 от 2010 г.,
                                                                попр., бр. 66 от 2010 г., изм., бр. 2 и 105 от 2011 г.,
                                                                доп., бр. 68 от 2012 г., изм., бр. 62, 65 и 80 от 2013
                                                                г., изм. и доп., бр. 53 от 2014 г., изм., бр. 76 от 2014
                                                                г., изм. и доп., бр. 94 от 2014 г., изм., бр. 101 от
                                                                2014 г., изм. и доп., бр. 6 от 2015 г., изм., бр. 36 от
                                                                2016 г., изм. и доп., бр. 79 от 2016 г., изм., бр. 7 и
                                                                12 от 2017 г., изм. и доп., бр. 39 от 2017 г., бр. 3 от
                                                                2019 г., изм., бр. 41 от 2021 г.) е изготвена таблица за
                                                                съответствие с Делегирана директива (ЕС) 2022/2407.
                                                                Проектът на наредба е съгласуван в рамките на Работна
                                                                група 9 „Транспортна политика“, за което е приложено
                                                                становище на работната група. </p>
                                                        </div>
                                                    </div>
                                                    <div class="modal-footer">
                                                        <button type="button" class="btn btn-primary">Изтегляне</button>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                        <!-- Modal END-->
                                    </li>

                                    <li class="list-group-item">
                                        <i class="fa-regular fa-file-pdf main-color me-2 fs-5"></i>
                                        <a href="#" class="main-color text-decoration-none" type="button"
                                           class="btn btn-primary" data-toggle="modal" data-target="#exampleModal33">Справка
                                            3</a>
                                        <!-- Modal -->
                                        <div class="modal fade" id="exampleModal33" tabindex="-1" role="dialog"
                                             aria-labelledby="exampleModalLabel11" aria-hidden="true">
                                            <div class="modal-dialog file-display" role="document">
                                                <div class="modal-content">
                                                    <div class="modal-header">
                                                        <h5 class="modal-title" id="exampleModalLabel33">Справка 3</h5>
                                                        <a type="button" class="close" data-dismiss="modal"
                                                           aria-label="Close">
                              <span aria-hidden="true">
                                <i class="fa-solid fa-xmark main-color fs-5"></i></span>
                                                        </a>
                                                    </div>
                                                    <div class="modal-body">
                                                        <div class="col-md-12">
                                                            <p> С проекта на наредба се предлагат: I. Промени, свързани
                                                                с въвеждането в националното законодателство на
                                                                Делегирана директива (ЕС) 2022/2407 на Комисията от 20
                                                                септември 2022 година за изменение на приложенията към
                                                                Директива 2008/68/ЕО на Европейския парламент и на
                                                                Съвета с оглед на адаптирането към научно-техническия
                                                                прогрес (ОВ L 317, 09/12/2022) (Делегирана директива
                                                                (ЕС) 2022/2407). Директива 2008/68/ЕО относно вътрешния
                                                                превоз на опасни товари (2008/68/ЕО) е въведена в
                                                                националното законодателство с Наредба № 46 от
                                                                30.11.2001 г. за железопътен превоз на опасни товари.
                                                                Съгласно чл. 8, параграф 1 от Директива 2008/68/ЕО,
                                                                Европейската комисия приема делегирани актове за
                                                                изменение на приложенията на директивата с цел отчитане
                                                                на измененията на ADR, RID и ADN, по-специално
                                                                свързаните с научния и техническия прогрес, включително
                                                                използването на технологии за локализиране и
                                                                проследяване. Приетите въз основа на цитирания текст
                                                                актове, въвеждащи изменения на приложенията към
                                                                Директива 2008/68/ЕО, са въведени в Наредба № 46, с
                                                                изключение на Делегирана директива (ЕС) 2022/2407.
                                                                Текстът, който следва да се транспонира от посочената
                                                                делегирана директива се съдържа в чл. 1, т. 2 от нея и
                                                                гласи: „в приложение II раздел II.1 се заменя със
                                                                следното: „II.1. RID </p>
                                                            <p>
                                                                <strong>Приложението към RID, приложимо от 1 януари 2023
                                                                    г., като се разбира, че където е уместно „RID
                                                                    договаряща държава" се заменя с „държава
                                                                    членка“.</strong>
                                                            </p>
                                                            <p> Подобен текст вече е транспониран и се съдържа в чл. 2,
                                                                ал. 1 от Наредба № 46. За да се транспонира Делегирана
                                                                директива (ЕС) 2022/2407 е необходимо да се добави
                                                                заглавието й в края на § 2 от Заключителните разпоредби
                                                                на действащата Наредба № 46, което се предлага в
                                                                параграф единствен от проекта на наредба. Предложеният
                                                                проект на Наредба за изменение и допълнение на Наредба №
                                                                46 не оказва пряко/или косвено въздействие върху
                                                                държавния бюджет. Не са необходими финансови и други
                                                                средства за прилагането на новата уредба. На основание
                                                                чл. 26, ал. 2-4 от Закона за нормативните актове
                                                                проектът на наредба, заедно с доклада към него, е
                                                                публикуван за обществено обсъждане на страницата на
                                                                Министерството на транспорта, информационните технологии
                                                                и съобщенията и на Портала за обществени консултации на
                                                                Министерски съвет. На заинтересованите лица е
                                                                предоставена възможност да се запознаят с проекта на
                                                                Наредба за изменение и допълнение на Наредба № 46 и да
                                                                представят писмени предложения или становища в 14-дневен
                                                                срок от публикуването им. </p>
                                                            <p>
                                                                <strong> Решението за определяне на по-кратък срок за
                                                                    обществено обсъждане на проекта на акт е взето в
                                                                    съответствие с изискванията на чл. 26, ал. 4,
                                                                    изречение второ от Закона за нормативните актове,
                                                                    като е съобразено, че публикуваният за обществено
                                                                    обсъждане проект на наредба включва разпоредби,
                                                                    които имат технически характер и чрез тях се въвежда
                                                                    изискването на чл. 1, параграф 2 от Делегирана
                                                                    директива (ЕС) 2022/2407, който регламентира
                                                                    актуалната редакция на правилата към RID – приложима
                                                                    от 1 януари 2023 г., която вече е в сила за
                                                                    Република България. </strong>
                                                            </p>
                                                            <p> В изпълнение на изискванията на чл. 3, ал. 4, т. 1 от
                                                                Постановление № 85 на Министерския съвет от 2007 г. за
                                                                координация по въпросите на Европейския съюз (обн., ДВ,
                                                                бр. 35 от 2007 г., изм., бр. 53 и 64 от 2008 г., бр. 34,
                                                                71, 78 и 83 от 2009 г., бр. 4, 5, 19 и 65 от 2010 г.,
                                                                попр., бр. 66 от 2010 г., изм., бр. 2 и 105 от 2011 г.,
                                                                доп., бр. 68 от 2012 г., изм., бр. 62, 65 и 80 от 2013
                                                                г., изм. и доп., бр. 53 от 2014 г., изм., бр. 76 от 2014
                                                                г., изм. и доп., бр. 94 от 2014 г., изм., бр. 101 от
                                                                2014 г., изм. и доп., бр. 6 от 2015 г., изм., бр. 36 от
                                                                2016 г., изм. и доп., бр. 79 от 2016 г., изм., бр. 7 и
                                                                12 от 2017 г., изм. и доп., бр. 39 от 2017 г., бр. 3 от
                                                                2019 г., изм., бр. 41 от 2021 г.) е изготвена таблица за
                                                                съответствие с Делегирана директива (ЕС) 2022/2407.
                                                                Проектът на наредба е съгласуван в рамките на Работна
                                                                група 9 „Транспортна политика“, за което е приложено
                                                                становище на работната група. </p>
                                                        </div>
                                                    </div>
                                                    <div class="modal-footer">
                                                        <button type="button" class="btn btn-primary">Изтегляне</button>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                        <!-- Modal END-->
                                    </li>
                                </ul>
                            </div>
                        </div>
                    </div>

                    <div class="row mb-3">
                        <div class="col-md-12">
                            <div class="custom-card py-4 px-3">
                                <h3 class="mb-3">Коментари</h3>
                                <div class="obj-comment comment-background p-2 rounded mb-3">
                                    <div class="info">
                      <span class="obj-icon-info me-2 main-color fs-18 fw-600">
                        <i class="fa fa-solid fa-circle-user me-2 main-color" title="Автор"></i>Ivanov </span>
                                        <span class="obj-icon-info me-2 text-muted">12.09.2023 19:05</span>
                                    </div>
                                    <div class="comment rounded py-2">
                                        <p class="mb-0">Проектът на наредба е съгласуван в рамките на Работна група 9
                                            „Транспортна политика“, за което е приложено становище на работната
                                            група.</p>
                                    </div>
                                </div>
                                <div class="obj-comment comment-background p-2 rounded mb-3">
                                    <div class="info">
                      <span class="obj-icon-info me-2 main-color fs-18 fw-600">
                        <i class="fa fa-solid fa-circle-user me-2 main-color" title="Автор"></i>Иванов </span>
                                        <span class="obj-icon-info me-2 text-muted">13.09.2023 19:05</span>
                                    </div>
                                    <div class="comment rounded py-2">
                                        <p class="mb-0">Решението за определяне на по-кратък срок за обществено
                                            обсъждане на проекта на акт е взето в съответствие с изискванията на чл. 26,
                                            ал. 4, изречение второ от Закона за нормативните актове, като е съобразено,
                                            че публикуваният за обществено обсъждане проект на наредба включва
                                            разпоредби</p>
                                    </div>
                                </div>
                                <div class="col-md-12 mt-4">
                                    <div>
                                        <textarea class="form-control mb-3 rounded" id="exampleFormControlTextarea1"
                                                  rows="2" placeholder="Въведете коментар"></textarea>
                                        <button class=" cstm-btn btn btn-primary login m-0">Добавяне на коментар
                                        </button>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>

            <div class="col-lg-2">
                <div class="row mt-5">
                    <div class="col-md-12">
                        <div class="hori-timeline px-1" dir="ltr">
                            <h3 class="mb-3">История</h3>
                            <div class="timeline">
                                <ul class="timeline events">
                                    <li class="timeline-item mb-5">
                                        <h5 class="fw-bold fs-18">Включване на проекта</h5>
                                        <p class="mb-2 fw-bold">12.05.2023</p>
                                        <p> Tова събитие описва запис на акт в ЗП или ОП.</p>
                                    </li>
                                    <li class="timeline-item mb-5">
                                        <h5 class="fw-bold fs-18">Начало на обществената консултация</h5>
                                        <p class="mb-2 fw-bold">20.05.2023</p>
                                        <p> Визуализира се „Начало на консултацията“.</p>
                                    </li>
                                    <li class="timeline-item mb-5">
                                        <h5 class="fw-bold fs-18">Промяна на файл </h5>
                                        <p class="mb-2 fw-bold">25.05.2023</p>
                                        <p> Промяна на файл от консултацията.</p>
                                    </li>
                                    <li class="timeline-item mb-5">
                                        <h5 class="fw-bold text-muted fs-18">Приключване на консултацията</h5>
                                        <p class="text-muted mb-2 fw-bold ">01.06.2023</p>
                                        <p class="text-muted">Край на консултацията</p>
                                    </li>
                                    <li class="timeline-item mb-5">
                                        <h5 class="fw-bold text-muted fs-18">Справка за получените предложения</h5>
                                        <p class="text-muted mb-2 fw-bold">15.06.2023</p>
                                        <p class="text-muted">Справка или съобщение.</p>
                                    </li>
                                    <li class="timeline-item mb-5">
                                        <h5 class="fw-bold text-muted fs-18">Окончателен акт на Министерския съвет</h5>
                                        <p class="text-muted mb-2 fw-bold text-muted">18.06.2023</p>
                                        <p class="text-muted">Окончателен акт.</p>
                                    </li>
                                    <li class="timeline-item mb-5">
                                        <h5 class="fw-bold text-muted fs-18"> Представяне на законопроекта</h5>
                                        <p class="text-muted mb-2 fw-bold ">25.06.2023</p>
                                        <p class="text-muted">Развито в обхвата на текущата поръчка.</p>
                                    </li>
                                </ul>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
@endsection
