<?php

namespace App\Http\Controllers;

use App\Enums\OgpStatusEnum;
use App\Enums\OldNationalPlanEnum;
use App\Models\OgpPlan;
use App\Models\OgpPlanArea;
use App\Models\OgpStatus;
use Barryvdh\DomPDF\Facade\Pdf;
use Carbon\Carbon;
use Illuminate\Http\Request;
use Illuminate\View\View;

class NationalActionPlans extends Controller
{
    private $pageTitle;
    public function __construct(Request $request)
    {
        parent::__construct($request);
        $this->title_singular = __('custom.open_government_partnership');
        $this->pageTitle = __('custom.open_government_partnership');
    }

    /**
     * List of all otg_areas
     * @param Request $request
     * @return View
     */
    public function index(Request $request): View
    {
        $requestFilter = $request->all();
        $rssUrl = config('feed.feeds.national_plans.url');
        $items = OgpPlan::Active()
            ->National()
            ->whereRelation('status', 'type', OgpStatusEnum::ACTIVE->value)
            ->FilterBy($request->all())
            ->orderBy('created_at', 'desc')
            ->paginate(OgpPlan::PAGINATE);

        $route_view_name = 'ogp.national_action_plans.show';

        $pageTitle = $this->pageTitle;
        $this->composeBreadcrumbs();
        $oldPlanStatus = OgpStatus::Final()->first();
        $nationalOldPlans = [
            ['id' => OldNationalPlanEnum::THIRD->value,'url' => route('ogp.national_action_plans.show.old', OldNationalPlanEnum::THIRD->value), 'label' => OldNationalPlanEnum::nameByValue(OldNationalPlanEnum::THIRD->value)],
            ['id' => OldNationalPlanEnum::SECOND->value,'url' => route('ogp.national_action_plans.show.old', OldNationalPlanEnum::SECOND->value), 'label' => OldNationalPlanEnum::nameByValue(OldNationalPlanEnum::SECOND->value)],
            ['id' => OldNationalPlanEnum::FIRST->value, 'url' => route('ogp.national_action_plans.show.old', OldNationalPlanEnum::FIRST->value), 'label' => OldNationalPlanEnum::nameByValue(OldNationalPlanEnum::FIRST->value)],
        ];

        $hasSubscribeEmail = $this->hasSubscription(null, OgpPlan::class, $request->all());
        $hasSubscribeRss = false;
        $this->setSeo(__('site.seo_title'),  trans_choice('custom.national_action_plans', 2), '', array('title' => __('site.seo_title'), 'description' => trans_choice('custom.national_action_plans', 2), 'img' => OgpPlan::DEFAULT_IMG));

        return $this->view('site.ogp.plans', compact('pageTitle', 'items', 'route_view_name', 'oldPlanStatus', 'nationalOldPlans', 'rssUrl', 'hasSubscribeEmail', 'hasSubscribeRss', 'requestFilter'));
    }

    /**
     * @param Request $request
     * @param OgpPlan $plan
     */
    public function show(Request $request, $id)
    {
        $plan = OgpPlan::whereRelation('status', 'type', OgpStatusEnum::ACTIVE->value)->find($id);
        if(!$plan){
            return back()->with('warning', __('messages.record_not_found'));
        }
        $pageTitle = $plan->name;
        $this->composeBreadcrumbs($plan);
        $this->setSeo($plan->name, '', '', array('title' => $plan->name, 'img' => OgpPlan::DEFAULT_IMG));
        $this->setSeo($plan->name,  $plan->ogDescription, '', array('title' => $plan->name, 'img' => OgpPlan::DEFAULT_IMG));

        return $this->view('site.ogp.plan_show', compact('pageTitle', 'plan'));
    }

    public function showOld(Request $request, $id){
        if(!in_array($id, OldNationalPlanEnum::values())){
            return back()->with('warning', __('messages.record_not_found'));
        }
        $pageTitle = OldNationalPlanEnum::nameByValue($id);
        $this->composeBreadcrumbs(null, [['name' => $pageTitle, 'url' => '']]);

        $status = OgpStatus::Final()->first();
        $planName = OldNationalPlanEnum::nameByValue($id);
        $planId = $id;
        $planData = OldNationalPlanEnum::planData($id, app()->getLocale());

        $this->setSeo(OldNationalPlanEnum::nameByValue($id),  $planData['ogDescription'], '', array('title' => OldNationalPlanEnum::nameByValue($id), 'description' => $planData['ogDescription'], 'img' => OgpPlan::DEFAULT_IMG));

        return $this->view('site.ogp.old_plan_'.app()->getLocale().'.'.$id, compact('pageTitle', 'status', 'planName', 'planId', 'planData'));
    }

    public function export(Request $request, $id)
    {
        $plan = OgpPlan::whereRelation('status', 'type', OgpStatusEnum::ACTIVE->value)->findOrFail($id);
        if(!$plan){
            return back()->with('warning', __('messages.record_not_found'));
        }

        $exportData = [
            'title' => $plan->name,
            'content' => $plan->content,
            'rows' => $plan->areas
        ];
        $fileName = 'national_plan_'.date('d_m_Y_H_i_s').'.pdf';

        $pdf = PDF::loadView('exports.ogp_national_plan', ['data' => $exportData, 'isPdf' => true]);
        return $pdf->download($fileName);
    }

    public function developPlan(Request $request, $id){
        $plan = OgpPlan::National()->find($id);
        if(!$plan){
            return back()->with('warning', __('messages.record_not_found'));
        }

        $item = $plan->developPlan;

        $pageTitle = $this->pageTitle;
        $this->composeBreadcrumbs($plan, array(
            ['name' => __('custom.develop_plan'), 'url' => ''],
            ['name' => $item->name, 'url' => '']
        ));

        $schedules = [];
        if($item && $item->schedules->count()){
            foreach ($item->schedules()->orderBy('start_date','desc')->get() as $event){
                $schedules[] = array(
                    "id" => $event->id,
                    "title" => $event->name,
                    "description" => $event->description ? clearAfterStripTag(strip_tags(html_entity_decode($event->description))) : '',
                    "description_html" => $event->description ? strip_tags(html_entity_decode($event->description)) : '',
                    "start" => Carbon::parse($event->start_date)->startOfDay()->format('Y-m-d H:i:s'),
                    "end" => !empty($event->end_date) ? Carbon::parse($event->end_date)->endOfDay()->format('Y-m-d H:i:s') : Carbon::parse($event->start_date)->endOfDay()->format('Y-m-d H:i:s'),
                    "backgroundColor" => (Carbon::parse($event->start_date)->startOfDay()->format('Y-m-d') > Carbon::now()->startOfDay()->format('Y-m-d') ? '#00a65a' : '#00c0ef'),
                    "borderColor" => (Carbon::parse($event->start_date)->startOfDay()->format('Y-m-d') > Carbon::now()->startOfDay()->format('Y-m-d') ? '#00a65a' : '#00c0ef'),
                    "oneDay" => empty($event->end_date)
                );
            }
        }

        $nationalPlanSection = true;
        $this->setSeo(__('custom.dev_new_plan_title'),  $item->ogDescription, '', array('title' => __('custom.dev_new_plan_title'), 'img' => OgpPlan::DEFAULT_IMG));

        return $this->view('site.ogp.develop_new_action_plan.plan_show',
            compact('item', 'pageTitle', 'schedules', 'nationalPlanSection'));
    }

    public function areaDevelopPlan(Request $request, $id, OgpPlanArea $planArea)
    {
        $item = OgpPlan::whereHas('developPlan', function ($q) use($planArea){
            $q->whereHas('areas', function ($q) use($planArea){
                $q->where('id', '=', $planArea->id);
            });
        })->find((int)$id);

        if(!$item || !$item->developPlan) {
            return back()->with('warning', __('messages.record_not_found'));
        }

        if(auth()->user()->cannot('viewPublic', $item->developPlan)) {
            return redirect(route('ogp.national_action_plans.show', ['id' => $item->id]))->with('warning', __('messages.no_rights_to_view_content'));
        }
        $pageTitle = $this->pageTitle;
        $plan = $item->developPlan;
        $this->composeBreadcrumbs($plan, array(
            ['name' => __('custom.develop_plan'), 'url' => ''],
            ['name' => $plan->name, 'url' => route('ogp.national_action_plans.develop_plan', ['id' => $item->id])],
            ['name' => $planArea->area->name, 'url' => '']
        ));
        $nationalPlanSection = true;
        $this->setSeo(__('custom.dev_new_plan_title'),  $item->developPlan->ogDescription, '', array('title' => __('custom.dev_new_plan_title'), 'img' => OgpPlan::DEFAULT_IMG));

        return $this->view('site.ogp.develop_new_action_plan.plan_area_show',
            compact('plan', 'planArea', 'pageTitle', 'nationalPlanSection'));
    }

    /**
     * @param Request $request
     * @param OgpPlan $plan
     * @param OgpPlanArea $area
     * @return View
     */
//    public function area(Request $request, OgpPlan $plan, OgpPlanArea $planArea): View
//    {
//        return $this->view('site.ogp.plan_area_show', compact('plan', 'planArea'));
//    }

    /**
     * @param $item
     * @param $extraItems
     * @return void
     */
    private function composeBreadcrumbs($item = null, $extraItems = []){
        $customBreadcrumbs = array(
            ['name' => __('custom.open_government_partnership'), 'url' => ''],
            ['name' => __('custom.national_action_plans'), 'url' => route('ogp.national_action_plans')]
        );

        if($item){
            $customBreadcrumbs[] = ['name' => $item->name, 'url' => !empty($extraItems) ? route('ogp.national_action_plans.show', $item->id) : null];
        }
        if(!empty($extraItems)){
            foreach ($extraItems as $eItem){
                $customBreadcrumbs[] = $eItem;
            }
        }
        $this->setBreadcrumbsFull($customBreadcrumbs);
    }

    private function planData($id, $lang)
    {
        $data = array(
            OldNationalPlanEnum::FIRST->value => array(
                'files' => array(
                    'bg' => array(
                        [
                            'path' => 'old_ogp_plan/1/Plan-BG.pdf',
                            'name' => 'Оперативен план (БГ)',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                    'en' => array(
                        [
                            'path' => 'old_ogp_plan/1/PLAN-BG-ENGlast_0-1.pdf',
                            'name' => 'Оперативен план (EN)',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    )
                ),
                'evaluations' => array(
                    'bg' => array(
                        [
                            'path' => 'old_ogp_plan/2/OGP-selfassessment.pdf',
                            'name' => 'Отчет на правителството',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                        [
                            'path' => 'old_ogp_plan/2/bulgaria_rev.pdf',
                            'name' => 'Отчет на независимия изследовател',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                    'en' => array(),
                ),
                'content' => array(
                    'bg' => '<p>През месец юни 2012 г. Министерският съвет прие Оперативен план с конкретни мерки за изпълнение на поетите ангажименти на Република България към Глобалната инициатива по "Партньорството за открито управление".<br>При разработването на конкретните мерки по оперативния план водещите принципи са били четирите ключови принципа на откритото управление: прозрачност, участие на гражданите, отчетност и технологично обновление.<br>Планът е разработен за период до декември 2013 г. и включва конкретни мерки, очаквани резултати от тяхното изпълнение, отговорни институции, срок, източници на финансиране и измерими индикатори.<br>Мерките, за изпълнение на поетите ангажименти, във връзка с присъединяването на Република България към Глобалната инициатива "Партньорство за открито управление", са в приоритетните направления, предвидени в Плана за действие:</p>
                            <ul>
                                <li>По-ефективно управление на публичните средства/ресурси;</li>
                                <li>Повишаване на фирмената отчетност и отговорност.</li>
                            </ul>
                            <p>Предвидени са и общи мерки за подобряване на условията за прилагането на принципите за открито управление.</p>',
                    'en' => array(),
                ),
                'ogDescription' => array(
                    'bg' => 'През месец юни 2012 г. Министерският съвет прие Оперативен план с конкретни мерки за изпълнение на поетите ангажименти на Република България към Глобалната инициатива по "Партньорството за открито управление".',
                    'en' => 'През месец юни 2012 г. Министерският съвет прие Оперативен план с конкретни мерки за изпълнение на поетите ангажименти на Република България към Глобалната инициатива по "Партньорството за открито управление".',
                ),
                'arrangements' => array(
                    'bg' => array(
                        [
                            'name' => 'Нова Стратегия за управление на държавния дълг за периода 2012- 2014 г.',
                            'expect_result' => 'Синтезирани общи насоки за политиката по управление на държавния дълг в тригодишен период. Осигуряване на условия за прозрачност и отчетност при управлението на държавния дълг.',
                            'institution' => 'Министерство на финансите',
                            'end_deadline' => '2012 г.',
                            'finance' => 'Бюджет на МФ',
                            'indicators' => 'Одобрена нова Стратегия за управление на държавния дълг за периода 2012-2014 г.',
                        ],
                        [
                            'name' => 'Разработване на цялостна Визия за създаване на механизъм за финансиране на гражданския сектор и на Стратегия за подкрепа на развитието на гражданските организации в Република България.',
                            'expect_result' => 'Определяне на възможности за финансиране на организациите, за които няма законово уредена действаща практика за партньорството с държавата и общините, постигане на повече прозрачност при използване на средствата от бюджета, предназначени за НПО.',
                            'institution' => 'Министър по управление на средствата от Европейския съюз;<br>Министерство на финансите',
                            'end_deadline' => '2012 г.',
                            'finance' => '',
                            'indicators' => 'Разработена Визия и Стратегия за развитието на гражданските организации в Република България',
                        ],
                        [
                            'name' => 'Промени в бюджетното законодателство за установяване на фискални правила и на процедури за по-ефективно и прозрачно управление на публичните финанси, в това число въвеждане на т.нар. “Бюджет за гражданите”, съдържащ кратко описание на промените, които се правят в политиките, както във финансирането на отделни, важни за гражданите сектори.',
                            'expect_result' => 'Законово регламентиране на фискални правила и процедури, гарантиращи устойчивост на публичните финанси, по-ефективното им управление и спазване на фискалните цели, както и осигуряващи достъпност и прозрачност за обществото, в това число – изготвяне и публикуване на т. н. „Бюджет за гражданите.”',
                            'institution' => '',
                            'end_deadline' => 'В съответствие със сроковете в законодателната програма на МС за второто полугодие на 2012 г. За т.н. “Бюджет за гражданите”, съгласно сроковете по бюджетна процедура за подготовка на закона за държавния бюджет.',
                            'finance' => '',
                            'indicators' => 'Изготвен и публикуван “Бюджет за гражданите.”',
                        ],
                        [
                            'name' => 'Публикуване на финансовите отчети и на отчетите за изпълнение на постигнатите резултати на министерствата и ведомствата, вкл. и на техните второстепенни разпоредители с бюджетни кредити (ВРБК).',
                            'expect_result' => 'Подобрена отчетност и бюджетна прозрачност и по-ясна отговорност за изразходваните ресурси и постигнатите резултати.',
                            'institution' => 'Министерство на финансите и останалите първостепенни разпоредители с бюджетни кредити (ПРБК).',
                            'end_deadline' => 'В съответствие със сроковете, заложени в нормативните актове – за периодичните финансови отчети и отчетите за степента на изпълнение на политиките и програмите на ПРБК, разработващи програмни бюджети.',
                            'finance' => 'Бюджет на ПРБК',
                            'indicators' => 'Публикувани отчети.',
                        ],
                        [
                            'name' => 'Публикуване на информация за данъчните разходи (преференции) от страна на Министерството на финансите.',
                            'expect_result' => 'Бюджетна прозрачност',
                            'institution' => 'Министерство на финансите',
                            'end_deadline' => '2012 г.',
                            'finance' => 'Бюджет на МФ',
                            'indicators' => 'Въведена информационна система.',
                        ],
                        [
                            'name' => 'Публикуването на информация за данъчно-ревизионните актове на Националната агенция за приходите по приключили ревизии.',
                            'expect_result' => 'Осигуряване на публичност и прозрачност чрез информираност при спазване на изискванията на действащото законодателство за опазване на данъчната и осигурителната информация и друга защитена от закон информация.',
                            'institution' => 'Министерство на финансите<br>НАП',
                            'end_deadline' => 'Постоянен. След 20-число на месец, следващ тримесечието.',
                            'finance' => '',
                            'indicators' => 'Брой издадени ревизионни актове.<br>Среден размер на допълнително-установените задължения на един ревизионен акт.<br>Публикувана информация.',
                        ],
                        [
                            'name' => 'Нова Национална стратегия за развитие на минната индустрия',
                            'expect_result' => 'Повишаване прозрачността на политиката за управление на подземните богатства.',
                            'institution' => 'Министерство на икономиката, енергетиката и туризма',
                            'end_deadline' => '2012 г',
                            'finance' => 'Бюджет на МИЕТ',
                            'indicators' => 'Одобрена от МС Стратегия',
                        ],
                        [
                            'name' => 'Нов Закон за подземните богатства',
                            'expect_result' => 'Въвеждат се нови  мерки гарантиращи прилагането на добрите европейски и световни практики по управлението на подземните богатства.',
                            'institution' => 'Министерство на икономиката, енергетиката и туризма',
                            'end_deadline' => '2013 г',
                            'finance' => 'Бюджет на МИЕТ',
                            'indicators' => 'Одобрен от МС проект на Закон за подземните богатства',
                        ],
                        [
                            'name' => 'Публична интернет информационна система за местоположението, групата на полезните изкопаеми и състоянието на запасите и/или ресурсите на подземните богатства с установени находища; специализирани карти и регистри на разрешенията за търсене и проучване и на концесиите за добив на подземни богатства.',
                            'expect_result' => 'Насърчаване на гражданите да използват технологии;<br>Осигуряване на публичност и прозрачност чрез информираност<br>Гарантира правата на всички граждани да получават официални преписи и извлечения от базата данни.',
                            'institution' => 'Министерство на икономиката, енергетиката и туризма',
                            'end_deadline' => '2012 г.',
                            'finance' => 'Бюджет на МИЕТ',
                            'indicators' => 'Наличие на информационна система',
                        ],
                        [
                            'name' => 'Прозрачност на управлението на подземните богатства чрез привличане на независими високо квалифицирани експерти за участие в: провеждането на тръжните и конкурсните процедури за предоставяне на права за подземни богатства; приемането на геоложки доклади, изготвени от титулярите на права; осъществяването на контрола по отношение на дейностите по търсене, проучване и добив на подземни богатства.',
                            'expect_result' => 'Насърчаване на гражданското участие в управлението.<br>Осигуряване на прозрачност в дейността на администрацията.<br>Гарантиране на правата на всички граждани да получаван официални преписи и извлечения от базата данни.',
                            'institution' => 'Министерство на икономиката, енергетиката и туризма',
                            'end_deadline' => '2012 г.',
                            'finance' => 'Бюджет на МИЕТ',
                            'indicators' => 'Въвеждане на практиката в Национална стратегия за развитие на минната индустрия чрез  предвиждане на мерки за насърчаване и разширяване на гражданското участие в управлението на подземни богатства.<br>Нормативно въвеждане на мерките в Закона за подземните богатства.',
                        ],
                        [
                            'name' => 'Извършване на оценка на въздействието на нормативни актове, които имат съществено влияние върху бизнес средата, включително последваща оценка на въздействието на нормативни актове, като подборът на актовете се извършва съвместно с бизнеса.',
                            'expect_result' => 'Насърчаване на гражданското участие в управлението;<br>Подобряване на бизнес средата с активното участие на бизнеса',
                            'institution' => 'Всички ведомства на централната администрация',
                            'end_deadline' => 'Постоянен',
                            'finance' => 'Бюджетите на ведомствата',
                            'indicators' => 'Изготвени оценки',
                        ],
                        [
                            'name' => 'Отчетност и прозрачност на дейността на лицата, предоставящи здравни услуги, чрез изграждането на Национална здравно-информационна система и осигуряване на достъп на гражданите до системата чрез електронен идентификатор. Качеството на медицинските услуги ще бъдe под постоянен институционален и обществен контрол.',
                            'expect_result' => 'Отчетност и прозрачност на дейността на лицата, предоставящи здравни услуги.<br>Подобряване на здравните услуги чрез прилагане на иновативни технологии за оптимизиране на ефикасността на процесите в системата на здравеопазването на всички нива.',
                            'institution' => 'Министерство на здравеопазването и Национална здравно- осигурителна  каса',
                            'end_deadline' => '2013 г.',
                            'finance' => 'Средства от фондове на ЕС и държавен бюджет',
                            'indicators' => 'Изграждане на Национална здравно-информационна система;<br>Осигурен достъп на гражданите до системата чрез електронен идентификатор',
                        ],
                        [
                            'name' => 'Аутсорсване на дейности от държавата към бизнеса.<br>Анализ на практиките в саморегулиращите се сектори и идентифициране на секторите, в които регулирането може да бъде прехвърлено от държавата към бизнеса',
                            'expect_result' => 'Насърчаване на гражданското участие в управлението;<br>Повишаване отговорността на бизнеса',
                            'institution' => 'Министерство на икономиката, енергетиката и туризма',
                            'end_deadline' => '2013 г.',
                            'finance' => 'Бюджет на МИЕТ',
                            'indicators' => 'Изготвени нормативни промени<br>Брой извършени анализи',
                        ],
                        [
                            'name' => 'Подобряване практиката на консултациите с бизнеса чрез активен диалог при формирането на конкретни политики и тяхното прилагане.',
                            'expect_result' => 'Насърчаване на гражданското участие в управлението; Повишаване отговорността на бизнеса чрез включването му при разработването на политиките. Обратна връзка с обществеността',
                            'institution' => 'Всички ведомства на централната администрация',
                            'end_deadline' => 'Постоянен',
                            'finance' => 'Бюджетите на ведомствата',
                            'indicators' => 'Проведени срещи, работни групи, брой завършени обществени обсъждания и др.'
                        ],
                        [
                            'name' => 'Повишаване информираността на гражданите по отношение принципите на корпоративната социална отговорност',
                            'expect_result' => 'Формиране на специфичен за обществото контекст на КСО',
                            'institution' => 'МИЕТ<br>МТСП',
                            'end_deadline' => '2012-2013',
                            'finance' => 'Бюджетите на ведомствата',
                            'indicators' => 'Брой организирани семинари, конференции',
                        ],
                        [
                            'name' => 'Законодателни мерки за насърчаване на социално-отговорни инвестиции, производство и мениджмънт в МСП',
                            'expect_result' => 'Предпоставка за устойчив растеж',
                            'institution' => 'МИЕТ',
                            'end_deadline' => '2012-2013',
                            'finance' => 'Бюджет на ведомството',
                            'indicators' => 'Брой законодателни промени с преференции за предприятията',
                        ],
                        [
                            'name' => 'Иницииране на годишна класация за предприятия с най-отговорно корпоративно поведение; Критерии: социално ангажирани инвестиции, реализирани икономии на енергия и ресурси, брой работни места, принос към развитието на общината.',
                            'expect_result' => 'Създаване на стимул за КСО в предприятията',
                            'institution' => 'МИЕТ и МТСП в партньорство с НСОРБ',
                            'end_deadline' => '2013',
                            'finance' => 'Бюджетите на ведомствата',
                            'indicators' => 'Брой фирми, номинирани за участие;<br>Видове огласяване и медийни изяви',
                        ],
                        [
                            'name' => 'Насърчаване спазването на екологичното законодателство – като важно условие за конкурентоспособност на производствените предприятия.',
                            'expect_result' => 'Въвличане на повече фирми в екологично отговорно производство',
                            'institution' => 'МИЕТ<br>МТСП в партньорство  с НСОРБ',
                            'end_deadline' => '2013',
                            'finance' => 'Бюджетите на ведомствата',
                            'indicators' => 'Създадени адекватни облекчения за фирмите',
                        ],
                        [
                            'name' => 'Организиране на дискусионни форуми на национално и местно ниво за популяризиране на възможностите за корпоративна социална отговорност (КСО) сред широк кръг представители на бизнеса и за представяне на добри практики по КСО.',
                            'expect_result' => 'Насърчаване на гражданското участие в управлението;<br>Въвличане на повече фирми в инициативата на КСО',
                            'institution' => 'Министерство на труда и социалната политика',
                            'end_deadline' => '2012 г.',
                            'finance' => 'Бюджет на МТСП',
                            'indicators' => 'Организирани форуми',
                        ],
                        [
                            'name' => 'Интегриране на превантивните инструменти по околна среда с корпоративните политики чрез повишаване информираността на бизнеса, включително по отношение въвеждането на системи за управление на околната среда ISO 14001, EMAS, схемата за Еко маркировка на ЕС',
                            'expect_result' => 'Насърчаване на гражданското участие в управлението;<br>Въвличане на повече фирми в инициативите, свързани с опазването на околната среда',
                            'institution' => 'Всички ведомства',
                            'end_deadline' => '2013 г.',
                            'finance' => 'Бюджетите на ведомствата',
                            'indicators' => 'Информационни мероприятия',
                        ],
                        [
                            'name' => 'Усъвършенстване на Единния портал за достъп до електронни административни услуги и надграждане с функциите на Единното звено за контакт.',
                            'expect_result' => '<ul>
                                                     <li>Популяризиране на е-управлението и повишаване на доверието у гражданите и бизнеса;</li>
                                                     <li>Изпълнение на Директивата за услугите;</li>
                                                     <li>Обучени избрани целеви групи от администрацията;</li>
                                                     <li>Усъвършенстван портал на електронното управление, предоставящ информация чрез различни комуникационни канали.</li>
                                                </ul>',
                            'institution' => 'МТИТС',
                            'end_deadline' => '2013',
                            'finance' => 'Проект по ОПАК',
                            'indicators' => '<ul>
                                                 <li>Усъвършенстван портал на централизираната платформа;</li>
                                                 <li>Брой внедрени електронни административни услуги.</li>
                                             </ul>',
                        ],
                        [
                            'name' => 'Актуализиране на съдържанието на Регистрите за оперативна съвместимост (Регистър на регистрите и данните – РРД, Регистър на електронните услуги – РЕУ и Регистър на информационните обекти – РИО, Регистър на стандартите, Списък на акредитираните лица и Списък на сертифицираните системи и продукти) на електронното правителство.',
                            'expect_result' => '<ul>
                                                    <li>Намаляване на разходите на администрациите при обмен на информация и взаимодействие между системите им;</li>
                                                    <li>Създаване на условия за по-ефективно публично управление;</li>
                                                    <li>Усъвършенстване на централните системи на електронното управление;</li>
                                                    <li>Усъвършенстване на процесите за предоставяне на електронни административни услуги;</li>
                                                    <li>Усъвършенстване на оперативната съвместимост и осигуряване на възможности за интеграция на европейско ниво.</li>
                                                 </ul>',
                            'institution' => 'МТИТС',
                            'end_deadline' => '2013',
                            'finance' => 'Проект по ОПАК',
                            'indicators' => '<ul>
                                                  <li>Изградена платформа за създаване, съхранение, архивиране и управление на електронни документи, данни и съдържание в администрацията;</li>
                                                    <li>Разработена система за мониторинг и управление на ОСИС</li>
                                                </ul>',
                        ],
                        [
                            'name' => 'Осигуряване на експлоатационна поддръжка на Единния портал за достъп до електронни административни услуги.',
                            'expect_result' => '',
                            'institution' => 'МТИТС',
                            'end_deadline' => '2013',
                            'finance' => 'Проект по ОПАК',
                            'indicators' => 'Изградена централизирана система за мониторинг и управление на информационната сигурност и оперативна съвместимост.',
                        ],
                        [
                            'name' => 'Осигуряване на експлоатационна поддръжка на Регистрите за оперативна съвместимост (Регистър на регистрите и данните – РРД, Регистър на електронните услуги – РЕУ и Регистър на информационните обекти – РИО, Регистър на стандартите, Списъка на акредитираните лица и Списък на сертифицираните системи и продукти) на електронното правителство.',
                            'expect_result' => '',
                            'institution' => 'МТИТС',
                            'end_deadline' => '2013',
                            'finance' => 'Проект по ОПАК',
                            'indicators' => 'Вписани в регистрите на ЕП първични и комплекси е-услуги.',
                        ],
                        [
                            'name' => 'Изграждане на Административна информационна система на кадастъра (КАИС)',
                            'expect_result' => '<ul>
                                                    <li>Предоставяне на електронни и комплексни административни услуги от Агенцията по геодезия, картография и кадастър (АГКК), чрез разработване и внедряване на софтуер в съответствие с Закона за електронното управление (ЗЕУ);</li>
                                                    <li>Разработване на вътрешни правила за документооборота на електронни документи и документи на хартиен носител и реализация на електронна система за управление на жалби, предложения и сигнали;</li>
                                                    <li>Оптимизация и осигуряване на достъп до услуги за незрящи;</li>
                                                    <li>Оптимизация и осигуряване на достъп до услуги а чуждоговорящи клиенти на услуги чрез online транслитерация.</li>
                                                </ul>',
                            'institution' => 'Агенцията по геодезия, картография и кадастър',
                            'end_deadline' => '2013 г.',
                            'finance' => 'Проект по ОПАК',
                            'indicators' => 'Разработена и внедрена Информационна система за предоставяне на електронни и комплексни административни услуги от АГКК',
                        ],
                        [
                            'name' => 'Изграждане на Национална здравно-информационна система, електронно здравно досие, електронна рецепта, електронно направление и т.н.',
                            'expect_result' => 'Развитие на електронното здравеопазване;<br>Повишаване на качеството, контрола и прозрачността при предоставянето на здравни услуги',
                            'institution' => 'Министерство на здравеопазването и Национална здравно- осигурителна  каса',
                            'end_deadline' => '2013 г.',
                            'finance' => 'Средства от фондове на ЕС и държавен бюджет',
                            'indicators' => 'Изградени Национална здравно-информационна система, електронно здравно досие, електронна рецепта, електронно направление и други електронни здравни услуги',
                        ],
                        [
                            'name' => 'Осигуряване на достъп на гражданите до системата чрез електронен идентификатор, който може да бъде използван и за достъп до електронни здравни услуги',
                            'expect_result' => 'Развитие на електронното здравеопазване<br>Достъп до всички електронни услуги на гражданите',
                            'institution' => 'МТИТС',
                            'end_deadline' => '2013',
                            'finance' => 'Проект по ОПАК',
                            'indicators' => 'Създаването на единен електронен идентификатор с който гражданите да се идентифицират при ползването на електронни услуги. Същият идентификатор може да бъде използван и за достъп до електронни здравни услуги',
                        ],
                        [
                            'name' => 'Развитие на интернет страницата на МС за увеличаване на обхвата на информацията, достъпна за гражданите, задаване на добри практики за откритост и прозрачност, задаване на стандарти за информационните масиви и ресурси, използвани в Администрацията на МС.',
                            'expect_result' => 'Осигуряване на публичност и прозрачност чрез информираност',
                            'institution' => 'Администрация на МС',
                            'end_deadline' => '2012',
                            'finance' => 'Бюджет на МС',
                            'indicators' => 'Подобрена интернет страницата на МС',
                        ],
                        [
                            'name' => 'Публичност на правилата, по които работят второстепенните разпоредители с бюджетни кредити към МС, както и на техните финансови резултати и отчети за постигнати резултати.',
                            'expect_result' => 'Подобрена отчетност и бюджетна прозрачност и по-ясна отговорност за изразходваните ресурси и постигнатите резултати.',
                            'institution' => 'Администрация на МС',
                            'end_deadline' => 'В съответствие със сроковете, заложени в нормативните актове – за периодичните финансови отчети и отчетите за степента на изпълнение на политиките и програмите',
                            'finance' => 'Бюджет на МС',
                            'indicators' => 'Подобрена интернет страницата на МС',
                        ],
                        [
                            'name' => 'Контрол за спазването на законовите изисквания за публичност и информираност и публикуване на резултати от проведените проверки на интернет страницата на МС',
                            'expect_result' => 'Повишаване публичността и информираността на гражданите',
                            'institution' => 'Администрация на МС',
                            'end_deadline' => 'Постоянен',
                            'finance' => '',
                            'indicators' => 'Брой извършени проверки и публикации на резултатите от тях.',
                        ],
                        [
                            'name' => 'Подобряване и публичност на Портала за обществени консултации (www.strategy.bg) за по-широко използване',
                            'expect_result' => 'Осигуряване на публичност и прозрачност чрез информираност',
                            'institution' => 'Администрация на МС',
                            'end_deadline' => '2012',
                            'finance' => '',
                            'indicators' => 'Подобрен Портала за обществени консултации',
                        ],
                        [
                            'name' => 'Разширяване на обхвата за публично използване на информационната система за управление и наблюдение за използване на средствата от Структурните и Кохезионния фондове.',
                            'expect_result' => 'Разширяване на възможностите за повторно използване на данните от системата, включително във файлови формати, позволяващи лесна машинна обработка на информацията.',
                            'institution' => 'Администрация на МС',
                            'end_deadline' => '2013',
                            'finance' => '',
                            'indicators' => 'Разширен обем на представената публична информация за реалното постигане на индикаторите по проектите и оперативните програми .',
                        ],
                        [
                            'name' => 'Разработване на ЗИД на Закона за достъп до обществена информация с цел създаване на единни параметри/стандарти за изготвяне и публикуване на актуалната информация от администрациите',
                            'expect_result' => 'Подобряване на публичността и прозрачността чрез информираност',
                            'institution' => 'МП, Заинтересовани ведомства, Администрация на МС, в партньорство с НПО',
                            'end_deadline' => 'Първо полугодие на 2013',
                            'finance' => '',
                            'indicators' => 'Одобрен от МС ЗИД на Закона за достъп до обществена информация',
                        ]
                    ),
                    'en' => array(),
                )
            ),
            OldNationalPlanEnum::SECOND->value => array(
                'files' => array(
                    'bg' => array(
                        [
                            'path' => 'old_ogp_plan/2/Втори-план-ПОУ-финал-одобрен-МС.pdf',
                            'name' => 'Втори план за действие на Република България по инициативата “Партньорство за открито управление” (БГ)',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
//                        [
//                            'path' => 'old_ogp_plan/2/ОБОБЩЕНИ_КОМЕНТАРИ_ОТ_НПО_СЕКТОРА_И_ГРАЖДАНСКОТО_ОБЩЕСТВО_ПО_ПРОЕКТ_НА_ВТОРИ_ПЛАН_ЗА_ДЕЙСТВИЕ_ПОУ.pdf',
//                            'name' => 'Обобщени коментари/предложения от неправителствения сектор и гражданското общество по проекта на Втори план за действие по инициативата „Партньорство за открито управление“, получени в процеса на неговото обсъждане',
//                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
//                        ],
//                        [
//                            'path' => 'old_ogp_plan/2/Proposals_BCNP.pdf',
//                            'name' => 'Предложения на Българския център за нестопанско право',
//                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
//                        ],
//                        [
//                            'path' => 'old_ogp_plan/2/Proposals_FO.bg.pdf',
//                            'name' => 'Предложения на Фондация "Общество.бг"',
//                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
//                        ],
//                        [
//                            'path' => 'old_ogp_plan/2/Proposals_Boyan_Yurukov.pdf',
//                            'name' => 'Предложения на Боян Юруков',
//                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
//                        ],
//                        [
//                            'path' => 'old_ogp_plan/2/Proposals_PDOI.pdf',
//                            'name' => 'Предложения на Програма за достъп до информация',
//                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
//                        ],
                        [
                            'path' => 'old_ogp_plan/2/15RH503.pdf',
                            'name' => 'Нови ангажименти в рамките на Втория план за действие на Република България за участие в Инициативата „Партньорство за открито управление“',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                    'en' => array(
                        [
                            'path' => '/old_ogp_plan/1/OGP-second-plan-Bulgaria-final-Revised-July-8-2015-1.pdf',
                            'name' => 'Втори план за действие на Република България по инициативата “Партньорство за открито управление” (EN)',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                        [
                            'path' => 'old_ogp_plan/2/NAP2_New_Commitments_EN_Final.pdf',
                            'name' => 'Нови ангажименти в рамките на Втория план за действие на Република България за участие в Инициативата „Партньорство за открито управление“',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    )
                ),
                'evaluations' => array(
                    'bg' => array(
                        [
                            'path' => 'old_ogp_plan/2/Interim_Self-Assessment_Report_BG.pdf',
                            'name' => 'Отчет на правителството',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                        [
                            'path' => 'old_ogp_plan/2/Bulgaria_EoT_2014-2016_BUL.pdf',
                            'name' => 'Отчет на независимия изследовател',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                    'en' => array(),
                ),
                'content' => array(
                    'bg' => array(
                        [
                            'title' => 'Въведение',
                            'content' => 'България се присъедини към Инициативата „Партньорство за открито управление“ през
                            2012 г. С участието си в инициативата българското правителство желаеше и продължава да
                            желае да играе активна роля за изграждане на общество, основано на повече прозрачност в
                            управлението, гражданско участие, отговорност, отчетност и технологично обновление.
                            Участието на България в инициативата се разглежда като ефективен инструмент за
                            сътрудничество и обмен на добри практики със страни, имащи признати постижения в
                            областта на откритото управление.<br>
                            В началния етап на своето участие в инициативата България реши да насочи усилията си за
                            постигане на по-ефективно управление на публичните ресурси и за повишаване на
                            корпоративната отговорност. Страната постигна добри резултати особено по отношение на
                            публичността и по-високото ниво на отчетност на публичните власти. Публикуването на
                            информация за различни аспекти от дейността на администрацията, както и консултирането
                            на проекти на нормативни актове и стратегически документи вече е задължение на
                            публичните власти, но по-важно – превръща се все повече в осъзната необходимост, която
                            гарантира по-добри резултати при прилагането на политики. Някои от ангажиментите,
                            включени в първия план за действие ще залегнат и в плана за действие за периода 2013-
                            2015 г., защото носят полезност за обществото.<br>
                            Друг кръг от въпроси, включени в първия план за действие на България по Инициативата
                            „Партньорство за открито управление“, по-специално онези, които се отнасят до
                            насърчаването на корпоративната социална отговорност, се оказаха теми със сравнително
                            ограничен ефект, най-вече поради слабата информираност в обществото за ползите от този
                            подход и от факта, че водещата страна в процеса има бизнеса и в по-малка степен
                            правителството.<br>
                            В рамките на диалога с неправителствените организации по изработване на втория план за
                            действие към инициативата „Партньорство за открито управление“ се очертаха няколко
                            направления, в посока, на които да се насочат усилията на правителството за утвърждаване
                            на принципите на откритото управление. На преден план излизат нови предизвикателства.
                            Това са сфери, които до момента не са били достатъчно добре засегнати, но които все повече
                            са във фокуса на общественото внимание. Сред този кръг от нови приоритетни въпроси е и
                            въпросът за отворените данни.<br>
                            Независимо че това е сравнително нова тема за България, осъзната е потребността да се
                            отговори на поставения от активните неправителствени организации въпрос за
                            насърчаването на принципа на отворените данни в управлението. Правителството желае да
                            се превърне в активен участник и да даде тласък на предоставянето на отворени данни от
                            страна на институциите. Безспорен е потенциала на отварянето на данни за генерирането на
                            нови бизнес възможности. Заложените в плана мерки в областта на отворените данни са
                            малко на брой, но представляват първата необходима стъпка за въвеждане на идеята за
                            отворените данни в управлението, като инструмент за постигане на важните принципи на
                            откритото управление за прозрачност и гражданско участие.'
                        ],
                        [
                            'title' => 'Положени усилия в рамките на инициативата „Партньорство за открито управление“ до момента',
                            'content' => 'Република България официално се присъедини към инициативата през месец април 2012 г.
                            С протоколно решение на 11 април 2012 г., Министерският съвет одобри Първия план за
                            действие във връзка с присъединяването на Република България към Глобалната инициатива
                            “Партньорство за открито управление”. Със същото протоколно решение е възложено на
                            секретаря на Съвета за развитие при Министерския съвет да представи Оперативен план за
                            изпълнение на поетите ангажименти в Плана за действие, приет с Решение на Министерския
                            съвет на 29 юни 2012 г.<br>
                            Първият план е разработен съвместно с неправителствени организации и обхваща периода
                            до месец декември 2013 г. Мерките, за изпълнение на поетите ангажименти, във връзка с
                            присъединяването на Република България към Глобалната инициатива “Партньорство за
                            открито управление”, са в приоритетните направления:
                             По-ефективно управление на публичните средства/ресурси;
                             Повишаване на фирмената отчетност и отговорност.
                            Цялостната координация и комуникация по изпълнение на Плана за действие се
                            осъществява интерактивно на портала за обществени консултации в раздел „Партньорство за
                            открито управление“: http://www.strategy.bg.<br>
                            В изпълнение на ангажимента за постигане на по-висока бюджетна прозрачност през
                            изминалата една година са приети два нови стратегически документа и пакет от изменения и
                            допълнения в бюджетното законодателство. Всички актове са съгласувани с
                            неправителствения сектор и с гражданите. Усъвършенстваната нормативна рамка създава
                            необходимите условия за прозрачно, устойчиво и по-ефективно управление на публичните
                            средства. В отговор на очакването на гражданите за прозрачност и достъпност на
                            информацията институциите редовно публикуват на интернет страниците си актуални данни
                            за разходите си.<br>
                            Правителството предприе законодателни промени за въвеждане на задължителна оценка на
                            въздействието на нормативните актове. Тази стъпка създава условия за по-високо ниво на
                            отговорност и прозрачност в работата на институциите и администрацията при изготвянето
                            на нормативните актове.<br>
                            Подготвените бяха изменения и допълнение в Закона за обществените поръчки, с което се
                            цели пълна прозрачност и контрол при провеждането и изпълнението на поръчките и
                            улесняване достъпа на малките и средни предприятия до пазара на обществените поръчки.
                            Въвеждането на електронно правителство е приоритет в държавното управление. През
                            изминалата една година се изпълнява пакет от проекти, които ще дадат тласък на
                            електронното правителство. Особено внимание се отделя на електронното здравеопазване,
                            като през април 2013 г. стартира въвеждането на електронно пациентско досие. В процес на
                            въвеждане е и система за по-добро съгласуване и интегриране по цялата верига на здравните
                            услуги и обмен на здравни данни.<br>
                            Министерството на икономиката и енергетиката инициира създаването на нова Стратегия за
                            развитие на минната индустрия и нов Закон за подземните богатства, с които ще се
                            гарантира прозрачност на управлението на подземните богатства. Проектите са обект на
                            широка дискусия между правителството, браншовите организации, неправителствения
                            сектор и гражданите във формат „работни групи“ и он-лайн консултации.
                            Диалогът между институциите, социалните партньори, неправителствения сектор и
                            гражданските движения е приоритет в работата на правителството. Във втората половина на
                            2013 г. е възстановена активната работа на Националния съвет за тристранно
                            сътрудничество – орган за консултации и дебат между правителството, работодателите и
                            синдикатите. Към всяко министерство функционира Обществен съвет, ръководен от
                            съответния министър. В състава на тези съвети участват браншови организации,
                            неправителствените организации и граждански сдружения. Над 50 работни групи (adHoc), с
                            активно участие на бизнеса и гражданите работят по актуални проблеми.
                            Независим експерт, съгласно Независимия механизъм за оценка, прилаган на Инициативата
                            изготви преглед на изпълнението на мерките, предвидени в първия план за действие на
                            страната и направи препоръки за включване на ангажименти във Втория план за действие.
                            Оценката за изпълнението на първия план за действие показва, че България е изпълнила
                            почти всички поети ангажименти. За някои от ангажиментите е направена препоръка за
                            мониторинг върху прилагането им или тяхното надграждане във Втория план за действие
                            (например Стратегията за управление на държавния дълг, Стратегията за гражданските
                            организации в Република България, Законът за подземните богатства, промени в Закона за
                            достъпа до обществена информация).<br>
                            С Протоколно решение от заседанието на Министерския съвет на 27 ноември 2013 г. беше
                            одобрен Доклада за самооценка по Плана за действие във връзка с присъединяването на
                            Република България към Глобалната инициатива за партньорство за открито управление.
                            Правителството възложи на министъра на регионалното развитие да отговаря за
                            координацията и участието на Република България в „Партньорството за открито
                            управление“.<br>
                            Правителството ще продължи да работи за преодоляване на предизвикателствата, свързани
                            с: подобряване на партньорството между администрацията и гражданското общество,
                            подобряване на административните услуги и законодателната рамка и отвореност на
                            администрацията, чрез подобряване на достъпа до информация и данни.
                            В новия план ще бъдат надградени мерки, започнати през първия план за действие и в
                            съответствие с препоръките от Доклада на независимия механизъм за оценка за България
                            2012-2013 (Independent Reporting Mechanism Progress Report, Bulgaria 2012-2013) . Ще се
                            изпълняват мерки, насочени към усъвършенстване на процеса на участие на гражданското
                            общество в процеса на формиране на политики. Ще продължат инициативите за по-добра
                            бюджетна прозрачност и предоставяне на финансова информация на достъпен за
                            обществото език. Ще продължи работата в сферата на по-доброто управление на природните
                            ресурси; ще улесни достъпа до обществена информация и ще се усъвършенства анализа на
                            въздействието на нормативните актове върху малкия и среден бизнес, което ще доведе до
                            намаляване на административната тежест върху малкия и среден бизнес и ще стимулира
                            икономическия растеж.'
                        ],
                        [
                            'title' => 'Процес на разработка на разработване на национален план за действие',
                            'content' => 'Под ръководството на министъра на регионалното развитие е сформирана
                            междуведомствена работна група за подготовката на Втория план за действие на Република
                            България по участие в инициативата „Партньорство за открито управление.
                            На сайта за обществени консултации www.strategy.bg в специалната му секция
                            „Партньорство за открито управление“ беше дадена възможност за изпращане на
                            предложения от неправителствения сектор и гражданското общество за ангажименти, които
                            да залегнат във Втория план за действие. Предложения можеха да се дискутират и в он-лайн
                            дискусионния панел за инициативата за партньорство за открито управление на
                            www.strategy.bg. Бяха проведени срещи на междуведомствената работна група, която
                            включва представители на администрацията за обсъждане на Втория план за действие и
                            постъпилите предложения от гражданското общество. Бяха организирани и съвместни
                            срещи на представителите на междуведомствената работна група с представители на
                            бизнеса, неправителствения сектор, гражданското общество и местните власти. Проектът на
                            план е поместен и на сайта за обществени консултации www.strategy.bg. Там са публикувани
                            и получените предложения за ангажименти от неправителствения сектор в процеса на
                            подготовка на Плана. Определено е контактно лице от Министерство на регионалното
                            развитие, което осъществява връзка с неправителствения сектор по време на подготовка на
                            документа.<br>
                            Мерките от втория план за действие са разработени в съответствие с предложения на
                            неправителствени и граждански организации в Република България, представителите на
                            държавната администрация и препоръките в доклада за България, съгласно Независимия
                            механизъм за оценка, както и насоките, дадени по време на регионалната среща за Европа на
                            страните, участнички в инициативата „Партньорство за открито управление“, проведена
                            през месец май 2014 г. в гр. Дъблин, Ирландия.'
                        ]
                    ),
                    'en' => array(),
                ),
                'ogDescription' => array(
                    'bg' => 'България се присъедини към Инициативата „Партньорство за открито управление“ през 2012 г. С участието си в инициативата българското правителство желаеше и продължава да желае да играе активна роля за изграждане на общество',
                    'en' => 'България се присъедини към Инициативата „Партньорство за открито управление“ през 2012 г. С участието си в инициативата българското правителство желаеше и продължава да желае да играе активна роля за изграждане на общество',
                ),
                'arrangements' => array(
                    'bg' => array(
                        [
                            'name' => 'Тясно партньорство между администрацията и гражданското общество',
                            'leading_institution' => 'Водеща институция за цялостното изпълнение на ангажимента: Администрация на Министерския съвет. За изпълнение на отделните мерки:
                                <br>Мярка 1: Министерство на правосъдието и Администрация на Министерския съвет
                                <br>Мярка 2: Администрация на Министерския съвет и централна администрация
                                <br>Мярка 3: Министерство на правосъдието, Администрация на Министерския съвет',
                            'other_person' => 'Да',
                            'problem_question' => 'Ниска степен на ангажираност и участие на гражданското общество в процеса на вземане на решения',
                            'base_goal' => 'Усъвършенстване на процеса на участие на гражданите и гражданските организации в изработването на нормативни актове; Подобряване партньорството между администрацията, гражданското общество и бизнеса чрез механизма за провеждане на обществени съвети, функциониращи към отделните институции и гарантиране на повече публичност и прозрачност.',
                            'challenge' => 'Засилване на обществения морал',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Промени в Закона за нормативните актове: пропорционално адаптиране на минималния задължителен срок от 14 до 30 дни за провеждане на обществени консултации по проекти на нормативни документи, според значимостта на проблема и засегнатите страни и в съответствие с добрите европейски практики; подобрена прозрачност и процедура по обсъждане на проекти за нормативни актове.',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => 'Юли 2014 г.',
                                    'to_date' => '2016 г.',
                                ],
                                [
                                    'name' => 'Подобрена процедура за участие на граждани и граждански организации в обществените консултации:
                                        <ul>
                                            <li>Публикуване на он-лайн информация за: състав на съветите; покани, дневен ред, протоколи, информация за взети решения в рамките на заседанията и тяхното изпълнение; периодичен публичен отчет за дейността им. (информацията ще се публикува на портала на консултативните съвети – www.saveti.government.bg).</li>
                                            <li>Изработване на ясни правила, процедури и критерии за избор/определяне на представители на гражданските организации в консултативни и обществени съвети</li>
                                        </ul>',
                                    'exist' => 'Продължаване на съществуващ ангажимент',
                                    'from_date' => 'Юли 2014 г.',
                                    'to_date' => '2016 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Подобряване на обществените услуги и законодателната рамка<br>По-добра бюджетна прозрачност
                                    <ul>
                                        <li>Откритост, прозрачност и отчетност на процесите по управление на държавния дълг</li>
                                        <li>Повишаване на достъпността, разбираемостта и възприемането на публикуваната от Министерството на финансите информация за обществеността</li>
                                    </ul>',
                            'leading_institution' => 'Министерство на финансите',
                            'other_person' => 'Да',
                            'problem_question' => 'Ангажиментът гарантира на обществото информираност по отношение на важни аспекти, свързани с дълговата проблематика и дава възможност за осигуряване на публичност и предвидимост на провежданите политики в тази област',
                            'base_goal' => 'Синтезиране на основните насоки на дълговата политика в средносрочен времеви интервал в контекста на провеждането на ефективно управление на суверенните задължения, както и предоставяне на детайлна информация в различен разрез за състоянието и динамиката на държавния дълг',
                            'challenge' => 'Подобряване на обществените услуги<br>По-ефективно управление на публичните средства',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Изпълнение на Стратегията за управление на държавния дълг 2012- 2014 г. ',
                                    'exist' => 'Съществуващ',
                                    'from_date' => 'Януари 2012 г.',
                                    'to_date' => 'Декември 2014 г.',
                                ],
                                [
                                    'name' => 'Разработване, одобрение от Министерски съвет и изпълнение на Стратегия за управление на държавния дълг 2015-2017 г.',
                                    'exist' => 'Съществуващ',
                                    'from_date' => 'Декември 2014 г.',
                                    'to_date' => 'Декември 2017 г.',
                                ],
                                [
                                    'name' => 'Публикуване на интернет страницата на Министерство на финансите на бюлетин „Държавен дълг“',
                                    'exist' => 'Съществуващ',
                                    'from_date' => 'Ежемесечно',
                                    'to_date' => '',
                                ],
                                [
                                    'name' => 'Публикуване на интернет страницата на Министерството на финансите на Годишен обзор за състоянието на държавния дълг',
                                    'exist' => 'Съществуващ',
                                    'from_date' => 'Ежегодно',
                                    'to_date' => '',
                                ],
                                [
                                    'name' => 'Публикуване на официалната информация за консолидирания дълг и гаранциите на сектор „Държавно управление“ на интернет страницата на Министерство на финансите',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => 'От 1 януари 2014 г.',
                                    'to_date' => 'На всеки три месеца/ежегодно',
                                ],
                            )
                        ],
                        [
                            'name' => 'Подобряване на обществените услуги и законодателната рамка<br>По-добра бюджетна прозрачност
                                    <ul>
                                        <li>Откритост, прозрачност и отчетност на процесите по управление на държавния дълг</li>
                                        <li>Повишаване на достъпността, разбираемостта и възприемането на публикуваната от Министерството на финансите информация за обществеността</li>
                                    </ul>',
                            'leading_institution' => 'Министерство на финансите',
                            'other_person' => 'Да',
                            'problem_question' => 'Публикуваната от Министерство на финансите информация е разбираема за ограничен брой тясно специализирани потребители',
                            'base_goal' => 'Предоставяне на публикуваната от Министерство на финансите във вид, достъпен за по-широк кръг от потребители',
                            'challenge' => 'Подобряване на обществените услуги<br>По-ефективно управление на публичните средства',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Изследване сред потребителите на достъпността, разбираемостта и възприемането на публикуваната от Министерство на финансите информация за обществеността',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => 'Септември 2014 г.',
                                    'to_date' => 'Декември 2014 г.',
                                ],
                                [
                                    'name' => 'Разработване на концепция за повишаване на достъпността, разбираемостта и възприемането на публикуваната от Министерство на финансите информация за обществеността',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => 'Януари 2015 г.',
                                    'to_date' => 'Май 2015 г.',
                                ],
                                [
                                    'name' => 'Изпълнение на мерките от концепцията за повишаване на достъпността, разбираемостта и възприемането на публикуваната от Министерство на финансите информация за обществеността',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => 'Юни 2015 г.',
                                    'to_date' => 'Януари 2016 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Подобряване на обществените услуги и законодателната рамка<br>По-добро управление на природните ресурси',
                            'leading_institution' => 'Министерство на икономиката и енергетиката',
                            'other_person' => 'Да',
                            'problem_question' => 'Необходимост от увеличаване на общественото доверие при управлението на природните богатства, подобряване на социалната отговорност и предотвратяване на социални конфликти, чрез по-голяма прозрачност и обществен контрол.',
                            'base_goal' => 'Осигуряване на прозрачност при провеждане на контрола по разрешения за търсене и проучване или за проучване и по предоставени концесии за добив на подземни богатства и осигуряване на публичност на резултатите',
                            'challenge' => 'Подобряване на обществените услуги',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Приет Закон за изменение и допълнение на Закона за подземните богатства',
                                    'exist' => 'Съществуващ ангажимент',
                                    'from_date' => '2012 г.',
                                    'to_date' => '2014 г.',
                                ],
                                [
                                    'name' => 'Приета Наредба за обхвата и реда за извършване и приемане на резултатите от контрола по предоставени разрешения за търсене и проучване или за проучване и по предоставени концесии за добив на подземни богатства',
                                    'exist' => 'Съществуващ ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => '2015 г.',
                                ]
                            )
                        ],
                        [
                            'name' => 'Подобряване на обществените услуги и законодателната рамка<br>По-добра оценка на въздействието на нормативните актове – въвеждане на МСП тест',
                            'leading_institution' => 'Министерство на икономиката и енергетиката,<br>Администрация на Министерския съвет',
                            'other_person' => 'Да',
                            'problem_question' => 'Липса на достатъчен анализ на въздействието на нормативните актове върху дейността на малкия и среден бизнес в България, които представлява 99% от общия брой предприятия в страната',
                            'base_goal' => 'Анализ на въздействието на нормативните актове върху МСП, намаляване на административната тежест върху малкия и среден бизнес',
                            'challenge' => 'Подобряване на обществените услуги',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Закон за изменение и допълнение на нормативните актове, който да въведе задължението за МСП тест',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => '2015 г.',
                                ],
                                [
                                    'name' => 'Проект на Методика за извършване на МСП-тест',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => '2015 г.',
                                ],
                                [
                                    'name' => 'Формуляр за МСП-тест',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => '2015 г.',
                                ]
                            )
                        ],
                        [
                            'name' => 'По-ефективно управление на публичните средства<br>Гражданско участие, откритост и прозрачност при разработването на проект на нов Закон за държавните такси',
                            'leading_institution' => 'Администрация на Министерския съвет',
                            'other_person' => 'Министерство на финансите и Министерство на икономиката и енергетиката, с участието на гражданското общество',
                            'problem_question' => 'Съществува необходимост от:
                                                <ul>
                                                    <li>Подобряване на ефективността и ефикасността на политиката по отношение на таксите</li>
                                                    <li>Осъществяване на ефективна координация в администрацията и на партньорство с бизнеса и неправителствения сектор по въпросите, свързани с политиката за таксите</li>
                                                    <li>Осигуряване на прозрачност и условия за мониторинг и контрол върху изпълнението на политиката за таксите</li>
                                                </ul>',
                            'base_goal' => 'Добро управление посредством нова политика за таксите, осигуряваща избягване на неоправдано финансово натоварване върху гражданите и бизнеса. Реализация на ефективна и ефикасна социално-икономическа политика посредством такси, определени на основата на изградена система от принципи и ясни правила.',
                            'challenge' => 'По-ефективно управление на публичните средства<br>Подобряване на обществените услуги',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Проект на Закон за държавните такси',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => 'Март 2013 г.',
                                    'to_date' => 'Септември 2014 г.',
                                ],
                                [
                                    'name' => 'Проект на Специализирана методика за оценка на въздействието при въвеждане или актуализиране на държавни такси',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => 'Март 2013 г.',
                                    'to_date' => 'Септември 2014 г.',
                                ],
                                [
                                    'name' => 'Проект на Методика за определяне размера на таксите',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => 'Март 2013 г.',
                                    'to_date' => 'Септември 2014 г.',
                                ],
                                [
                                    'name' => 'Проект на Единна тарифа за таксите',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => 'Март 2013 г.',
                                    'to_date' => 'Септември 2014 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Откритост на администрацията<br>Използване на отворените данни',
                            'leading_institution' => 'Администрация на Министерски съвет, Министерство на транспорта, информационните технологии и съобщенията, всички останали администрации',
                            'other_person' => 'Да',
                            'problem_question' => 'Темата за отворените данни е нова за повечето страни и правителства, включително и за България. Българската администрация полага целенасочени усилия за повишаване на отчетността и прозрачността при работата си, като използва възможностите на новите технологии. В следващите години в съответствие с политиката на ЕС са необходими допълнителни усилия за въвеждане на отворените данни в администрацията. В този процес след за което ще бъдат направени съответните постъпки.',
                            'base_goal' => 'Въвеждане на принципите на отворените данни в работата на администрацията и започване на инициативи за прилагане на отворените данни в диалог с неправителствения сектор, бизнеса и гражданското общество.',
                            'challenge' => 'Подобряване на обществените услуги <br>Засилване на обществения морал',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Изменение и допълнение на Закона за достъп до обществената информация.
                                                <br>Промените ще целят:
                                                <br>Повишаване на откритостта на
                                                администрацията и улесняване достъпа до
                                                обществена информация чрез:
                                                <ul>
                                                    <li>Разширяване и детайлизиране на задълженията за публикуване на информация;</li>
                                                    <li>Засилване на координацията и контрола по изпълнението на закона;</li>
                                                    <li>Транспониране на Директива 2013/37/EC за изменение на Директива 2003/98/ЕО относно повторната употреба на информацията в обществения сектор – предвидени промени и бъдещи действия</li>
                                                </ul>',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => 'Юли 2015 г.',
                                ],
                                [
                                    'name' => 'Изготвяне на технически насоки за предоставяне на публична информация, притежавана от институциите в отворен формат',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => '2015 г.',
                                ],
                                [
                                    'name' => 'Приоритизиране на информацията в отворен формат (регистри, отчети и др.) – доклад за приоритизирани регистри, отчети, статистически данни и др., които могат да бъдат предоставени в отворен формат',
                                    'exist' => 'Нов ангажимент ',
                                    'from_date' => '2015 г.',
                                    'to_date' => '2015 г.',
                                ],
                                [
                                    'name' => 'Започване на процедура за присъединяване към Конвенцията за достъпа до официални документи на Съвета на Европа',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => '2016 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Усъвършенствана система за управление на риска от възникване на конфликт на интереси',
                            'leading_institution' => 'Министерството на правосъдието, Министерския съвет (МС)',
                            'other_person' => 'Да',
                            'problem_question' => 'Настоящата система предвижда сравнително тесен кръг от лица, които са задължени да подават декларации за конфликт на интереси и имущество, както и недостатъчен обем информация, събиран чрез декларациите. Липсва последователна практика за проверка на декларираните данни',
                            'base_goal' => 'По-висока степен на превенция на възникване на конфликт на интереси',
                            'challenge' => 'Засилване на обществения морал',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Въвеждане на нова структура за обработка на декларациите за конфликт на интереси и на имущество, която включва следните основни нови принципи и елементи:
                                                <ul>
                                                    <li>Пълна електронизация на обработката на двата вида декларации;</li>
                                                    <li>Обхващане чрез електронни декларации на държавните служители от централната власт и териториалната администрация;</li>
                                                    <li>Разширяване на обема информация, събирана чрез декларациите, с цел подобряване на анализа на риска и разкриване на корупционни деяния;</li>
                                                    <li>Възлагане на отговорности по събиране и първоначална обработка на декларациите на инспекторатите и на областната администрация;</li>
                                                    <li>Правомощия за одит и проверка на декларациите на висшите държавни длъжности, както и разширени правомощия за данъчни и банкови тайни;</li>
                                                    <li>Възлагане на одитиране на декларациите с установен риск на НАП - за държавните служители</li>
                                                </ul>',
                                    'exist' => 'Да',
                                    'from_date' => '01.12.2015 г.',
                                    'to_date' => '31.12.2016 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Въвеждане на концепция и практика на съдилища, ориентирани къмрешаване на конкретни проблеми в България',
                            'leading_institution' => 'Министерството на правосъдието',
                            'other_person' => 'Да',
                            'problem_question' => 'Българският съд оставя усещането за „технократско“, по „буквата на закона“ правораздаване. Независимо, че последиците от съдебното решение излизат извън пределите на съда, той не е интегриран с другите местни публични институции, от които зависи ефективната защита на уязвимите социални групи и преодоляването на социалното неравенство – здравеопазване, социална работа, публичен ред, образование, култура и др. Липсват умения у съдиите за адекватно третиране на представители на различни уязвими социални групи (например: деца, наркозависими, лица, страдащи от душевни заболявания, и др.), участващи в съдебния процес или, ако са налице такива умения, то те са интуитивно развити',
                            'base_goal' => 'Необходимост от осъзнаване на разбирането за съда като организация в определен социален контекст. Това важи особено силно за първоинстанционните съдилища',
                            'challenge' => 'Подобряване на обществените услуги',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Изработване на методология за работа на съдии с лица от уязвими социални групи, основана на емперични проучвания и знания, предоставени от американски експерти/съдии по модела на т.нар. „съдилища, ориентирани към решаването на проблеми“ (problem-solving courts). Конкретни измерими индикатори могат да бъдат:
                                                <ul>
                                                    <li>Брой участващи експерти;</li>
                                                    <li>Брой участващи съдии;</li>
                                                    <li>Налична методология;</li>
                                                    <li></li>
                                                    <li></li>
                                                    <li></li>
                                                </ul>',
                                    'exist' => 'Да',
                                    'from_date' => '01.06.2015 г.',
                                    'to_date' => '31.12. 2016 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Въвеждане на система за провеждане на електронни обществени поръчки',
                            'leading_institution' => 'Министерството на икономиката',
                            'other_person' => 'Да, МТИТС, Министерството на финансите, Министерството на здравеопазването, МС, ЕСМИС, НСОРБ и др.',
                            'problem_question' => 'Настоящата система за провеждане на обществени поръчки носи риск от злоупотреби поради все още силния субективен елемент, недостатъчна прозрачност и липса на стандартизирани работни процеси при осъществяване на определени етапи от процедурите',
                            'base_goal' => 'Улеснен достъп и намалени бюрократични изисквания и разходи за участие в процедури за обществени поръчки за бизнеса и създаване на възможност за ефективен публичен контрол с цел избягване на злоупотреби',
                            'challenge' => 'Подобряване на обществените услуги<br>По-ефективно управление на публичните средства',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Промени в Закона за обществените поръчки, регламентиращи провеждане на процедури по възлагане на обществени поръчки по електронен път',
                                    'exist' => 'Нов',
                                    'from_date' => '01.03.2015 г.',
                                    'to_date' => '01.03.2016 г.',
                                ],
                                [
                                    'name' => 'Въвеждане на Единен национален портал за електронни обществени поръчки, поетапно въвеждане на различните стадии от процеса на електронно възлагане
                                    <br>Въвеждане на модул за електронно обявяване',
                                    'exist' => '',
                                    'from_date' => '01.01.2016 г. ',
                                    'to_date' => '31.12.2016 г.',
                                ]
                            )
                        ],
                        [
                            'name' => 'Подобряване на ползваемостта на публикуваните данни от системата за електронни бюджетни разплащания (СЕБРА)',
                            'leading_institution' => 'Министерството на финансите, МС',
                            'other_person' => 'Да',
                            'problem_question' => 'Публикуваните в момента данни са в разнороден формат и представят твърде обобщена картина на плащанията, което представлява бариера за ползването им от по-широк кръг потребители, тъй като изисква допълнителна експертиза и ресурс за вторична обработка',
                            'base_goal' => 'Постигане на по-високо равнище на фискална прозрачност и отчетност',
                            'challenge' => 'Засилване на обществения морал<br>По-ефективно управление на публичните средства',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Въвеждане на единен формат на публикуване на данните от различните ведомства и единна точка за сваляне на данните',
                                    'exist' => 'Нов в рамките на инициативата ',
                                    'from_date' => '01.06.2015 г.',
                                    'to_date' => '31.12.2015 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Подобряване на последващия контрол върху дейността по възлагане и изпълнение на договори за обществени поръчки и въвеждане на унифицирана последователна практика за контрол и отчетност',
                            'leading_institution' => 'Министерство на финансите, АДФИ',
                            'other_person' => 'Да',
                            'problem_question' => 'Твърде разнородна практика на последващ контрол и липса на последователно усилие за анализ на установените нарушения с оглед на очертаване на зони на висок риск и адресиране на повтарящи се нарушения',
                            'base_goal' => 'Подобряване на последващия контрол върху дейността по възлагане и изпълнение на договори за обществени поръчки и въвеждане на унифицирана последователна практика за контрол и отчетност',
                            'challenge' => 'Подобряване на обществения морал<br>По-ефективно управление на публичните средства',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Разработване на ръководство за унифициране на последващия контрол (избягване припокриването на проверките и еднакво третиране на нарушенията от контролните органи)',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => '01.06.2015 г.',
                                    'to_date' => '31.12. 2015 г.',
                                ],
                                [
                                    'name' => 'Анализ на установените нарушения (включително конфликт на интереси) във връзка с възлагането на обществени поръчки и наложените санкции в тази връзка',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => '01.06.2015 г.',
                                    'to_date' => '31.12.2015 г.',
                                ],
                                [
                                    'name' => 'Въвеждане на индикатори и система за периодично отчитане на нарушенията в практиката по наложените административни наказания',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => 'юли 2014 г.',
                                    'to_date' => 'декември 2016 г.',
                                ]
                            )
                        ],
                    ),
                    'en' => array(),
                )
            ),
            OldNationalPlanEnum::THIRD->value => array(
                'files' => array(
                    'bg' => array(
                        [
                            'path' => '/old_ogp_plan/3/Трети_план_ПОУ-2.pdf',
                            'name' => 'Трети национален план за действие в рамките на инициативата „Партньорство за открито управление“ 1 юли 2016 – 30 юни 2018 (БГ)',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                    'en' => array(
                        [
                            'path' => '/old_ogp_plan/3/NAP3-Bulgaria_EN_0.pdf',
                            'name' => 'Трети национален план за действие в рамките на инициативата „Партньорство за открито управление“ 1 юли 2016 – 30 юни 2018 (БГ)',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    )
                ),
                'evaluations' => array(
                    'bg' => array(
                        [
                            'path' => 'old_ogp_plan/3/Доклад_за_самооценка_на_администрацията_БГ.pdf',
                            'name' => 'Отчет на правителството',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                        [
                            'path' => 'old_ogp_plan/3/Bulgaria_End-of-Term_Report_2016-2018_BUL.pdf',
                            'name' => 'Отчет на независимия изследовател',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                    'en' => array(),
                ),
                'content' => array(
                    'bg' => '<p>Третият Национален план за действие в рамките на инициативата „Партньорство за открито управление“ 1 юли 2016 – 30 юни 2018 г. е приет с Решение № 570 на Министерския съвет от 11 юли 2016 г. Преди приемането на плана беше обявен график за неговата подготовка и беше проведена онлайн обществена консултация на Портала за обществена консултации.</p>',
                    'en' => array(),
                ),
                'ogDescription' => array(
                    'bg' => 'Третият Национален план за действие в рамките на инициативата „Партньорство за открито управление“ 1 юли 2016 – 30 юни 2018 г. е приет с Решение № 570 на Министерския съвет от 11 юли 2016 г.',
                    'en' => 'Третият Национален план за действие в рамките на инициативата „Партньорство за открито управление“ 1 юли 2016 – 30 юни 2018 г. е приет с Решение № 570 на Министерския съвет от 11 юли 2016 г.',
                ),
                'arrangements' => array(
                    'bg' => array(
                        'Електронно управление' => array(
                            [
                                'commitment' => 'Българското правителство ще подобри достъпа и качеството на публичните услуги чрез внедряване на инструментите на електронно управление',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Усъвършенстване на съществуващите и въвеждане на нови електронни услуги от НАП',
                                        'Контекст' => 'В момента Националната агенция за приходите предлага най-много услуги в електронен вид в публичната администрация, но за някои услуги все още е необходимо посещение на място, което изисква ресурс от време и представлява административна тежест за данъкоплатците.',
                                        'Основна цел' => 'Разширяване на обхвата и качеството на предлаганите от НАП електронни услуги с оглед допълнително намаляване на бюрократичните пречки чрез ориентирани към клиента услуги и подобряване вътрешните бизнес процеси и процедури.',
                                        'Амбиция' => 'Опростяване на процедурите и подобряване на подходите, ориентирани към нуждите на данъкоплатците.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката Мярката отговаря на голямото предизвикателство на ПОУ за подобряване на ефективността на публичните услуги.',
                                        'Отговорна институция' => 'Национална агенция за приходите',
                                        'Други ангажирани публични институции' => 'Министерство на финансит',
                                        'Други ангажирани заинтересовани страни' => 'Сдружения на бизнеса, организации на работодатели',
                                        'Очаквано въздействие' => 'Улеснен и удобен достъп до услуги, предлагани от НАП; намалена административна тежест за гражданите и бизнеса; икономически ползи от спестено време и човешки ресурс за бизнеса и гражданите; подобрено управление на процесите в НАП и по- висока ефективност на приходната администрация.',
                                        'Срок на изпълнение' => 'постоянен',
                                    ],
                                    [
                                        'Наименование' => 'Разработване на секторна Стратегия за е-управление в МОСВ и Пътна карта към нея за периода 2016-2020 в съответствие със Стратегията за развитие на електронно управление в Република България 2014 – 2020 г.',
                                        'Контекст' => 'Днес управлението на околната среда в контекста на устойчивото развитие е изправено пред редица предизвикателства: борба с изменението на климата и адаптация към тези промени, необходимостта от по-ефективно използване на ресурсите, спиране на загубите на биологично разнообразие, формиране на модели на поведение на обществото, щадящи околната среда и др. Електронното управление на околната среда има съществена роля за по-доброто управление на тези процеси, за предоставянето на навременна и точна информация на обществото и неговото активно участие в решаването на предизвикателствата. ',
                                        'Основна цел' => 'Стратегията за е-околна среда и пътната карта към нея са насочени към развитие на целенасочено, достъпно, предвидимо, ефективно и ефикасно електронно управление в полза на обществото и околната среда.',
                                        'Амбиция' => 'Постигане на гъвкавост и ефективност на мерките за опазване на околната среда, съкращаване на сроковете за обработка на документи, удобен достъп и публичност на процедурите.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката отговаря на предизвикателствата, свързани със съвременното управление на природните ресурси, подобряване на публичните услуги и повишаване на интегритета на управлението. Електронизирането на процесите допринася за постигане на по-висока прозрачност на решенията и действията по опазване на околната среда, както и по-високо ниво на отчетност.',
                                        'Отговорна институция' => 'Министерство на околната среда и водите, Дирекция “Човешки ресурси, информационно обслужване, връзки с обществеността и протокол”',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Неправителствени организации, бизнес, местни общности',
                                        'Очаквано въздействие' => 'Kохерентност и последователност на усилието за въвеждане на електронно управление в областта на опазване на околната среда; предвидимост, проследимост и публичност на процеса и ясно разпределение на отговорности и срокове; усъвършенстване на вътрешните процедури и консолидация на разнородни източници на информация.',
                                        'Срок на изпълнение' => 'октомври 2016 г.',
                                    ],
                                    [
                                        'Наименование' => 'Внедряване на публичен електронен регистър на инсталациите, източници на летливи органични съединения с две електронни услуги – заявление за регистрация на инсталация и заявление за вписване на промяна на обстоятелствата на регистрирана инсталация',
                                        'Контекст' => 'Задължението за поддържане на публичен електронен регистър на инсталациите, източници на летливи органични съединения е надградено с възможността необходимите документи за регистрация и/или за промяна в обстоятелствата на регистрирана инсталация да бъдат предоставяни по електронен път.',
                                        'Основна цел' => 'Да се постигне качествено по-високо ниво на обслужване на бизнеса, да се подобри информираността на гражданите и да се повиши прозрачността по отношение на опазване на качеството на атмосферния въздух.',
                                        'Амбиция' => 'Постигане на модерно обслужване и осигуряване на прозрачност на процеса по осъществяване на контрол и спазване на регулациите, свързани с опазване чистотата на атмосферния въздух.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Подобряване на ефективността на публичните услуги и повишаване на интегритета на управлението. Усъвършенстване на достъпа до информация и възможностите за включване на граждани и техните организации в процесите на мониторинг и контрол на замърсяването на атмосферния въздух.',
                                        'Отговорна институция' => 'Изпълнителна агенция по околна среда, Регионалните инспекции по околна среда и води',
                                        'Други ангажирани публични институции' => 'Министерство на околната среда и водите',
                                        'Други ангажирани заинтересовани страни' => 'Оператори на инсталации, местни общности, граждански организации',
                                        'Очаквано въздействие' => 'Съкращаване на сроковете за обработка на документи; повишена гъвкавост и ефективност на вътрешните процедури; разширен достъп; открито, бързо и прозрачно взаимодействие със заинтересованите страни; услуги с фокус върху нуждите на потребителите, възможност за генериране на информация и данни и бързата им обработка.',
                                        'Срок на изпълнение' => 'юли 2016 г.',
                                    ],
                                    [
                                        'Наименование' => 'Внедряване на НИС за отпадъци с възможност за подаване на заявления, водене на отчетност и предоставяне на информация по електронен път',
                                        'Контекст' => 'Управлението на отпадъци е тема, която привлича традиционно обществен интерес и около която често възникват противоречия между местните общности, операторите на инсталации, представителите на местното самоуправление и на централната власт. Липсата на обобщена информация и възможност за достъп до информация по електронен път допълнително задълбочава конфликтите и затруднява конструктивния диалог и постигането на взаимноприемливи решения.',
                                        'Основна цел' => 'Използване на предимствата на технологиите за осигуряване на повече информация относно управлението на отпадъците, както и намаляване на административната тежест за бизнеса.',
                                        'Амбиция' => 'Създаване на система, която позволява навременно адресиране на потенциални проблеми и разширяване на обхвата информация, предоставяна на обществото.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката осигурява по- добри публични услуги и управление на публичен ресурс чрез електронизация на процесите на отчетност. Чрез нея се увеличават достъпната за обществото информация по отношение на управление на отпадъците и се подобряват механизмите за публична отчетност на дейностите на МОСВ във връзка с управление на отпадъци.',
                                        'Отговорна институция' => 'Изпълнителна агенция по околна среда',
                                        'Други ангажирани публични институции' => 'Министерство на околната среда и водите, Регионалните инспекции по околна среда и води',
                                        'Други ангажирани заинтересовани страни' => 'Граждански организации и местни общности, бизнес',
                                        'Очаквано въздействие' => 'Подобрен контрол на фирмите, ангажирани с управление на отпадъци; улеснена и удобна процедура за подаване на заявления; разширяване на обхвата на предоставяната по електронен път информация.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Изготвяне и внедряване на софтуерни приложения в областта на здравеопазването за обработка на информацията в реално време – в т.ч. електронно направление, електронни рецепти, и др.',
                                        'Контекст' => 'В момента в България почти не се предлагат електронни услуги в сферата на здравеопазването, което води до чувствително натоварване с административна работа на медицинските професионалисти, неудобства и забавяния за пациентите и затруднен контрол на разходването на публичен ресурс.',
                                        'Основна цел' => 'Опитимизиране и електронизиране на процесите в областта на здравеопазването с оглед повишаване качеството на здравните услуги и подобряване на контрола върху разходването на публичните средства за здраве ',
                                        'Амбиция' => 'Чувствително облекчаване на административната тежест за личните лекари и подобряване на обслужването за пациентите.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката цели подобряване на публичните услуги и съпътстващ по-ефективен контрол върху разходването на публичен ресурс. Прилагането на нови технологии намалява чувствително разходите по осъществяване на вътрешен и външен контрол върху ефективността на разходване на публичен ресурс за здраве.',
                                        'Отговорна институция' => 'Министерство на здравеопазванет',
                                        'Други ангажирани публични институции' => 'Национална здравна осигурителна каса',
                                        'Други ангажирани заинтересовани страни' => 'Организации на пациенти, Сдружение на общопрактикуващите лекари',
                                        'Очаквано въздействие' => 'Значително съкращаване на времето, необходимо за издаване на направление и рецепта; възможност за проследяване на направените прегледи по направление и изписаните лекарствени средства; възможност за по-прецизен анализ на движението на направления и по-добро планиране; улеснен достъп за пациентите.',
                                        'Срок на изпълнение' => 'декември 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Трансформиране на първична регистрация на ЮЛНЦ от съдебна в административна и централизиране на първичен регистър на ЮЛНЦ в АВ чрез цялостна електронизация на регистъра',
                                        'Контекст' => 'Гражданските организации в България доскоро подлежаха на различен режим на регистрация в сравнение с останалите юридически лица - съдебна, а не административна. Тази процедура отнемаше повече време и ресурс, а поддържаният регистър бе отделен, непълно дигитализиран и нередовно актуализиран.',
                                        'Основна цел' => 'Консолидиране на информацията за регистрираните граждански организации и значително улесняване на процедурата за регистрация. Достъпност на събираната информация и възможност за лесна проверка на обстоятелства.',
                                        'Амбиция' => 'Пълно електронизиране на регистъра към Агенция по вписванията и възможност НПО да получават електронните услуги, предлагани от Агенцията.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'По-добри публични услуги и опростяване на регистрационния режим като начин за насърчаване на самоорганизацията на гражданите. Промяната чувствително улеснява процедурите по регистрация на граждански сдружения, като спестява време и финансов ресурс и осигурява повече публичност на дейностите на НПО.',
                                        'Отговорна институция' => 'Агенция по вписвания',
                                        'Други ангажирани публични институции' => 'Министерство на правосъдието',
                                        'Други ангажирани заинтересовани страни' => 'Център за изследване на демокрацията',
                                        'Очаквано въздействие' => 'Опростена и ускорена процедура на регистрация и възможност за ползване на електронни услуги по регистрацията; достъпен и пълен регистър на НПО.',
                                        'Срок на изпълнение' => 'юни 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Изграждане на връзка на ИСУН с информационни масиви на НСИ',
                                        'Контекст' => 'Информационната система за управление на европейските фондове съдържа пълната информация във връзка с проектите и бенефициентите по оперативните програми, финансирани по ЕСИФ. Понастоящем са налице идентифицирани слабости и информационни празноти в областта на разработването, мониторирането и интегрирания подход на администрациите от различни нива при използването на статистическа информация за оценка на изпълнението на дейностите по европейски и национални стратегии и по оперативните програми, съфинансирани от Европейските структурни и инвестиционни фондове 2014-2020. ',
                                        'Основна цел' => 'Осигуряване на статистическа информация по програмните индикатори с оглед по-точна, базирана на данни оценка на изпълнението и ефективността на програмите, финансирани със средства от ЕС.',
                                        'Амбиция' => 'Навременна оценка на ефекта от програмите с оглед постигане на максимални ползи от изпълнените интервенции.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката е свързана с по-ефективното управление на публичен ресурс и осигурява по-детайлна информация относно работата на държавните органи в процеса на изготвяне и изпълнение на програми, финансирани по ЕСИФ.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет, Централно координационно звено',
                                        'Други ангажирани публични институции' => 'Национален статистически институт',
                                        'Други ангажирани заинтересовани страни' => 'Бенефициенти по оперативните програми',
                                        'Очаквано въздействие' => 'Генериране на подробно, статистически обосновани отчети на изпълнението; ясна и точна оценка на ефекта от изпълнение на програмите, финансирани с европейските фондове; възможност за по-прецизно насочване на средства; публичност на резултатите.',
                                        'Срок на изпълнение' => 'декември 2017 г',
                                    ],
                                    [
                                        'Наименование' => 'Надграждане на основните системи на Агенция “Митници” за предоставяне на данни и услуги към външни системи',
                                        'Контекст' => 'Агенция „Митници“ е една от първите администрации, която предоставя електронни услуги, основно предназначени за търговския сектор. Някои от съществуващите услуги на Агенция „Митници“ са изградени върху стари технологични платформи, които изискват актуализация с цел по-голяма достъпност и улеснения при ползването на услугите. Агенция „Митници“ има задължения по ново европейско законодателство, според което е необходимо да се хармонизират митническите дейности и съответно да се надградят системите.',
                                        'Основна цел' => 'Осигуряване на ползваемост и достъпност на услугите за граждани и бизнес.',
                                        'Амбиция' => 'Намаляване на административните пречки за бизнеса и гражданите. Безпроблемно интегриране на системата на Агенция „Митници“ с други, външни за агенцията софтуерни системи.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката ще допринесе за подобряване на публичните услуги и по-ефективно управление на публичния ресурс чрез повишен и автоматизиран вътрешен контрол.',
                                        'Отговорна институция' => 'Агенция “Митници”',
                                        'Други ангажирани публични институции' => 'Министерство на финансите',
                                        'Други ангажирани заинтересовани страни' => 'Частен секто',
                                        'Очаквано въздействие' => 'Свързване с централните европейски компоненти; стабилизиране на вътрешните компоненти; предоставяне на удобни електронни услуги за гражданите и бизнеса и реализиране на възможност за предоставяне на електронизирани административни услуги като вътрешно-административни услуги с оглед реализация на комплексно административно обслужване.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Реализиране на ЦАИС “Електронни обществени поръчки с всички модули до електронно оценяване, вкл. електронно подаване на оферта. ',
                                        'Контекст' => 'Провеждането на процедури за възлагане на обществени поръчки е тема, по която обществото в България има повишена чувствителност. Понастоящем процесът на възлагане на поръчки не е напълно автоматизиран и стандартизиран, което налага кандидатите да изготвят оферти на хартиен носител и да ги подават ръчно, да отчитат разнообразни изисквания на различните възложители за сходни предмети, което е неефективно, отнема време и ресурс, а същевременно затруднява работата на администрацията по обработката и оценката на офертите.',
                                        'Основна цел' => 'Опростяване начина на провеждане на процедурите, създаване на гаранции за обективен и прозрачен процес на оценка на оферти и възлагане на договори.',
                                        'Амбиция' => 'Въвеждане на изцяло електронен процес на възлагане на обществени поръчки',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Чрез електронизация и повишена прозрачност на процедурите по възлагане на обществени поръчки се подобряват публичните услуги, повишава се интегритетът на публичните институции, подобрява се бизнес средата и се постига ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Агенция по обществени поръчки',
                                        'Други ангажирани публични институции' => 'Министерство на финансите',
                                        'Други ангажирани заинтересовани страни' => 'Възложители и стопански субекти, участващи във възлагателния процес.',
                                        'Очаквано въздействие' => 'Електронизиране на етапите на възлагателния процес; подпомагане на възложителите с въвеждане на стандартизирани бизнес процеси и образци на документи; подобрен контрол на всеки етап от провеждане на процедурите; оптимизиране на процесите по водене на регистъра на обществени поръчки.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ]
                                )
                            ],
                        ),
                        'Достъп до информация' => array(
                            [
                                'commitment' => 'Българското правителство ще продължи да подобрява достъпа до информация чрез постоянно разширяване на обхвата на публикуваната обществена информация и широко електронизиране на процесите по предоставяне на информация',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Координация и подпомагане на процеса на преразглеждане на вътрешните правила за работа по ЗДОИ за съобразяване с измененията в ЗДОИ чрез ясни механизми и отговорности за активно публикуване и вътрешен контрол.',
                                        'Контекст' => 'Задължението на публичните институции да приемат и публикуват в интернет страниците си на вътрешни правила за работа по ЗДОИ съществува от 2008 г. По данни на доклада на Министерски съвет за състоянието на администрацията от 2015 г. 482 администрации от 576 имат приети такива правила. Промените в ЗДОИ от декември 2015 г. създадоха редица нови задължения за достъп до обществена информация, активното публикуване, предоставяне на информация по електронни заявления, предоставяне на информация за повторно ползване и др., които налагат преразглеждане на вътрешните правила и ясно определяне на отговорностите в администрацията, свързани с активното публикуване в Интернет, както и вътрешния контрол на тази дейност.',
                                        'Основна цел' => 'Стандартизиране и подобрена организация на процеса по предоставяне на обществена информация, както и подобрен контрол.',
                                        'Амбиция' => 'Прозрачен процес на предоставяне на информация и улесняване на гражданите при търсенето на обществена информация и нейното повторно използван',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката създава обща рамка за подобряване на процеса по предоставяне на публична информация и повишава прозрачността в работата на публичните институции. Тя допринася за повишаване на интегритета на институциите и за подобряване на услугите, свързани с предоставяне на обществена информация.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'всички публични организации по ЗДОИ',
                                        'Други ангажирани заинтересовани страни' => 'Програма „Достъп до информация“',
                                        'Очаквано въздействие' => 'Ускоряване на процеса по привеждане на вътрешните правила в съответствие с изискванията на закона.',
                                        'Срок на изпълнение' => 'юни 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Провеждане на обучения по промените в ЗДОИ за всички служители в администрацията и особено за звената, отговарящи по ЗДОИ и публикуването в Интернет.',
                                        'Контекст' => 'През 2016 г. бяха въведени изменения в Закона за достъп до обществена информация, с които се създават задължения, свързани с активното публикуване на обществена информация от страна на институциите, увеличава се броят на субектите, задължени да публикуват активно обществена информация на своите интернет страници, увеличават се категориите информация, подлежащи на публикуване в Интернет. Промените предвиждат ръководителите на институциите в изпълнителната власт да създават и актуализират списъци с информация, която трябва да се публикува. Създава се задължение за публикуване на информация онлайн, ако тя е предоставена по три заявления, като за целта ще се разработи централна, публична, уеб- базирана Платформа за достъп до обществена информация.',
                                        'Основна цел' => 'Повишаване на капацитета на администрациите за изпълнение на ЗДОИ и предоставяне на обществена информация.',
                                        'Амбиция' => 'Налагане на нов подход на активно публикуване на обществена информация.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката е свързана с подобряване на достъпа до информация чрез увеличаване на капацитета и уменията на държавните служители за прилагане на Закона за достъп до обществена информация. Тя допринася за повишаване на интегритета на публичните институции.',
                                        'Отговорна институция' => 'Администрация на Министерския съве',
                                        'Други ангажирани публични институции' => 'Институт по публична администрация',
                                        'Други ангажирани заинтересовани страни' => 'Програма “Достъп до информация”',
                                        'Очаквано въздействие' => 'Повишени умения и мотивация на държавните служители за предоставяне на обществена информация и работа за Платформата за достъп до информация.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Водене и поддържане на публични електронни регистри от ДКХ за организаторите на хазартни игри, дейности по производство и разпространение, сервиз и внос на игрално оборудване, прекратени, отказани и отнети лицензи за организиране на хазартни игри, утвърдено игрално оборудване. Обновяване и поддържане на списък на интернет страници, чрез които се организират хазартни игри от лица, които не са получили лиценз за онлайн залагания по ЗХ ',
                                        'Контекст' => 'Хазартният бизнес е динамичен и е един от най-бързо развиващите се, който се регулира от съответните регулаторни органи във всяка една юрисдикция. Държавната комисия по хазарта поддържа свободни и безплатно достъпни публични електронни регистри, чрез които се предоставя информация за лицензирания и регулиран хазартен бизнес на територията на Република България. Регулацията на хазартната дейност се нарежда сред добре балансираните режими в Европа, което се постига чрез нормативни промени, целящи насърчаването и повишаването на инвестициите в бранша за удовлетворяване на бизнеса и държавните цели. Посредством регистрите ДКХ предоставя възможност за публичност и прозрачност на процесите в регулирания лицензиран пазар. По този начин се дава информация на всички участници в хазартните игри за регулирания пазар с цел предпазването им от участие в незаконни залагания. За да се избегнат загуби от данъци и такси при участие чрез онлайн залагания в бетинг компании без лиценз, ДКХ поддържа и периодично обновява списък на интернет страниците, чрез които се организират хазартни игри от лица, които не са получили лиценз по Закона за хазарта. Чрез публичното оповестяване на информацията в регистрите и списъците ДКХ цели да информира и защити бизнеса и участниците в хазартни игри, получили лиценз от Комисията.',
                                        'Основна цел' => 'Публичност и прозрачност на лицензираната и регулирана хазартна дейност. Защита и превенция срещу организирането на незаконен хазарт. Подобряване на бизнес средата за бетинг компаниите и повишаване на приходите в бюджета.',
                                        'Амбиция' => 'Защита на законните оператори на хазартни игри и гражданите.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката осигурява по- добри публични услуги и по-ефективно управление на публичните ресурси. Тя допринася за подобряване на достъпа до информация относно дейността на Държавната комисия по хазарта.',
                                        'Отговорна институция' => 'Държавна комисия по хазарта',
                                        'Други ангажирани публични институции' => 'Министерство на финансите',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Насърчаване на легитимните оператори, публичност и прозрачност на дейността на Държавната комисия по хазарта; подобрен контрол на хазартната дейност.',
                                        'Срок на изпълнение' => 'постоянно',
                                    ],
                                    [
                                        'Наименование' => 'Публикуване на годишните приоритети на Национална агенция за приходите (НАП), основни резултати от дейността на НАП и на резултати от проведени социологически проучвания, свързани с работата на НАП',
                                        'Контекст' => 'Националната агенция за приходите е в непрекъснат контакт както с гражданите, така и с бизнеса и е от изключителна важност те да разполагат с максимален обем информация относно нейната работа – изисквания към данъчно задължените лица, планирани дейности и резултати. Администрацията предоставя пълна и изчерпателна информация за услуги, процеси, формуляри, указания за попълване, права и задължения на клиентите, както и за различни електронни услуги със свободен достъп. Прилагат се всички канали за предоставяне на услуги с фокус върху използването на съвременните информационни и комуникационни технологии. Като институция, с която гражданите и бизнесът комуникират редовно, НАП продължава да отчита мнението на потребителите относно ефективността на услугите, които предлага, и да се стреми към допълнително намаляване на административната тежест за данъкоплатците.',
                                        'Основна цел' => 'Повишаване на прозрачността в работата на Националната агенция за приходите и намаляване на административната тежест за данъкоплатците.',
                                        'Амбиция' => 'Поддържане на подходи, ориентирани към потребителите.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката е насочена към подобряване на публичните услуги и по-ефективно управление на публични ресурси. Нейното изпълнение ще увеличи прозрачността в работата на Националната агенция за приходите.',
                                        'Отговорна институция' => 'Национална агенция за приходите',
                                        'Други ангажирани публични институции' => 'Министерство на финансите',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Подобрена предвидимост на бизнес средата; съобразяване на услугите с очакванията и нуждите на потребителите; подобрен контрол от страна на гражданите върху работата на НАП.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Публикуване на анализи/проучвания, финансирани от ЕСИФ, като ресурс за обмен и уеднаквяване на практики, картиране на ресурса по теми с подобряване на достъпа до информация',
                                        'Контекст' => 'Системата за управление и разходване на ЕСИФ съдържа минимум общи правила, принципи и ключови елементи за всички оперативни програми. Често, съответните грешки или предизвикателства при управлението на дадена програма/тип проекти, могат да послужат за отправна точка за дефинирането на приложими решения, които да бъдат „пренесени“ и върху управлението на други програми/проекти. Аналогично е положението и с „добрите практики“ в решаването на конкретни казуси на изпълнението на програмите/проектите. Публикуването на релевантна информация ще подпомогне бенефициентите в подготовката на по-качествени проекти и в подобряване на тяхното изпълнение/управлението на предоставеното им финансиране.',
                                        'Основна цел' => 'Подпомагане бенефициентите в подготовката на по-качествени проекти и подобряване на тяхното изпълнение/управлението на предоставеното им финансиране.',
                                        'Амбиция' => 'Повече съгласуваност, взаимодействие между административните структури и бенефициентите, и обмен на информация, чрез улеснен достъп до нея. Съдействие за прилагането на единен подход в управлението на ЕСИФ, вкл. еднакво третиране на хоризонталните въпроси, и повече прозрачност.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Подобряване на работата на публичните институции в предоставянето на насоки и в оказването на съдействие на бенефициентите в планирането, организирането, контрола и изпълнението на мерки, съфинансирани с европейския публичен ресурс. Принос за по-ефективното управление на този ресурс, в съответствие с правилата, „научените уроци“ и добрите практики.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет, Централно координационно звено',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Уеднаквени практики на публикуване; разширен достъп до аналитична експертиза, натрупана по програми и проекти, финансирани по ЕСИФ.',
                                        'Срок на изпълнение' => 'постоянно',
                                    ],
                                    [
                                        'Наименование' => 'Създаване на регистър на всички независими регулаторни, надзорни и контролни органи, назначавани от НС (самостоятелно или съвместно с МС и/или президента) с информация за институционални сайтове, правомощия, мандати, членове, нормативна база, решения ',
                                        'Контекст' => 'В България съществуват редица регулаторни, надзорни и контролни органи, които имат ключова роля в области като финансов контрол, защита на потребители, защита на конкуренцията и много други. Понастоящем липсва консолидирана информация за тях: функции, правомощия, решения.',
                                        'Основна цел' => 'Улесняване на достъпа до информация относно работата на регулаторните органи и повишена прозрачност на тяхната дейност.',
                                        'Амбиция' => 'По-активен граждански контрол на работата на регулаторните, надзорни и контролни органи.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката цели улесняване на достъпа до информация относно работата на регулаторните органи и повишена прозрачност на тяхната дейност. Чрез нея се постига подобряване на интегритета на публичните институции и по-ефективно управление на публичните ресурси.',
                                        'Отговорна институция' => 'Администрация на Министерския съвет',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Център за либерални стратегии, Български институт за правни инициативи',
                                        'Очаквано въздействие' => 'Структуриране и консолидиране на наличната информация и попълване на празноти в нея; по-ефективен граждански контрол върху дейността на регулаторните органи.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Изграждане на информационна система по събиране, дигитализация и съхранение на националния държавен архив на Националния институт за недвижимо културно наследство, както и въвеждане на електронни услуги за граждани, служители на държавната и общинската администрация чрез създаване на дигитален публичен архив и електронен регистър на недвижимите културни ценности с национално и световно значение и недвижимите археологически културни ценности с национално значение.',
                                        'Контекст' => 'Към момента липсва добре работеща и структурирана дигитална система за Националния документален архивен фонд при НИНКН. Системата на архивиране е неподходяща при разглеждане на преписки. Това води до затрудняване при търсенето на информация и забавяне при изготвяне на документи, свързани със статута. Дигитализирането на Регистъра и Националния документален архивен фонд при НИНКН не се случва (освен частично за Регистъра). По време на работния процес в НИНКН се събира информация в цифров вид (снимки, текстове, чертежи и др.), които не винаги се отлагат в архив.',
                                        'Основна цел' => 'Разширяване на обхвата и достъпността на предоставяната обществена информация и последващо по-активно включване на гражданите в дейностите по контрол и опазване на недвижимото културно наследство.',
                                        'Амбиция' => 'Пълна актуализация и достъпност на информацията за недвижимото културно наследство.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката осигурява разширен достъп до информация, като същевременно увеличава възможностите за упражняване на граждански контрол върху дейностите по управление и опазване на недвижимото културно наследство. Тя е насочена към подобряване на публичните услуги и увеличаване на интегритета на публичните институции.',
                                        'Отговорна институция' => 'Министерство на културата',
                                        'Други ангажирани публични институции' => 'Национален институт за недвижимо културно наследство',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Актуализиран, пълен и електронно достъпен архив на недвижимото културно наследство; подобрен обмен на информация и възможност за бързи проверки; създадени електронни услуги за граждани и общини, улесняващи изпълнението на дейности по възстановяване, консервиране и контрол на недвижимото културно наследство.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ]
                                )
                            ],
                        ),
                        'Отворени градове' => array(
                            [
                                'commitment' => 'Българското правителство ще си сътрудничи с и ще насърчава местните власти с цел въвеждане и развитие на практики на отворено управление на местно равнище',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Приемане на програма за отваряне на данни на местно ниво, която да съдържа списък от бази данни и график за отварянето им',
                                        'Контекст' => 'Усилието за публикуване на обществена информация в отворен, машинно-четим формат е съсредоточено основно на централно равнище, като се редки примерите за активно публикуване от общини. От друга страна, интересът и търсенето на общинските данни е изключително голям, като те имат потенциал да отключат редица икономически и социални ползи от употребата на данни в отворен формат.',
                                        'Основна цел' => 'Разширяване на обхвата на политиката за отворени данни и създаване на нови възможности за гражданско участие на местно ниво.',
                                        'Амбиция' => 'Постепенно включване на големите градове в инициативата за отворени данни и отключване на икономическия и социален потенциал на обществената информация в отворен формат.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката води до подобрен достъп до информация и разширяване на обхвата на публикуване на данни в отворен формат. Тя цели осигуряване на по-добри публични услуги на местно равнище, по-ефективно управление на публичните ресурси и подобрен интегритет на местната власт',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Национално сдружение на общините в България',
                                        'Други ангажирани заинтересовани страни' => 'Община София, Сдружение „НПО Линкс“',
                                        'Очаквано въздействие' => 'Повишена прозрачност на общинските политики, създадени продукти и услуги, базирани на данни на местните администрации, по-активно включване на гражданите в разработването на общински публични услуги и процеса на взимане на решения на местно равнище',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Осигуряване на по-висока прозрачност на публичните финанси на местно ниво – пилотно въвеждане на „граждански бюджет“ в Община София.',
                                        'Контекст' => 'Повечето българските общини публикуват активно информация за своите бюджети, но често тази информация е твърде сложна и нейната оценка и анализ изискват специализирана експертиза от страна на гражданите. Това от своя страна демотивира повечето граждани и подтиска гражданското участие в едно толкова важна област каквато са общинските финанси',
                                        'Основна цел' => 'Стимулиране на гражданско участие чрез осигуряване на разбираема информация относно общинските бюджети или т.нар. „граждански бюджет“.',
                                        'Амбиция' => 'Въвеждане на практиката на изготвяне на „бюджет на гражданите“ на общинско ниво.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката е насочена към по-активно и информирано участие на гражданите в процесите на управление и контрол на общинските бюджети. Тя цели по-ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Столична община',
                                        'Други ангажирани публични институции' => 'Национално сдружение на общините в България',
                                        'Други ангажирани заинтересовани страни' => 'Общини',
                                        'Очаквано въздействие' => 'По-добро познаване на очакванията на гражданите и развиване на капацитет за представяне на сложна финансова информация по разбираем и достъпен за гражданите начин; разработване на ефективни форми за комуникация; по-активно участие на гражданите в управлението на общинските бюджети.',
                                        'Срок на изпълнение' => 'юни 2017 г.',
                                    ]
                                )
                            ],
                        ),
                        'Гражданско участие' => array(
                            [
                                'commitment' => 'Българското правителство ще активизира диалога си с гражданското общество чрез иновативни форми на взаимодействие, позволяващи обратна връзка и съавторство при формулиране на политики',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Подобряване на качеството на провежданите обществени консултации чрез подобряване на функционалностите на портала за обществени комуникации; разработване на единни стандарти за избор на членове на обществени и консултативни съвети, за публичност на тяхната дейност и ясни механизми за прилагане на техните решения; подготовка в сътрудничество с граждански организации на обучителни програми за държавни служители за организиране на ефективни обществени консултации, разработване на практически насоки/ наръчник за включване на гражданите и предоставяне на обратна връзка по направените предложения по време на обществените консултации.',
                                        'Контекст' => 'Новите изменения на Закона за нормативните актове въвеждат повишени изисквания за качеството на провежданите обществени консултации. Освен това натрупаният до сега опит показва, че се налице някои слабости при провеждане на обществени обсъждания, които следва да бъдат адресирани с оглед по-активното включване на заинтересованите страни и постигане на по-високо качество на крайния продукт от консултациите. За целта е необходимо да се повишат уменията на представителите на администрацията за провеждане на ефективни обсъждания, а новите изисквания следва да бъдат отразени и в Портала за обществени консултации, като основен канал за комуникация със заинтересованите страни по всички предложения за нормативни актове и стратегически документи. Тъй като е създаден през 2008 г. много от неговите функционалности вече не отговарят на технологичното развитие и нуждите на потребителите - основно по отношение на обратна връзка по направени коментари и предложение и възможност за краудсорсинг, търсене на документи и др. ',
                                        'Основна цел' => 'Подобряване на качеството на обществените консултации и по-активно ангажиране на заинтересованите страни в процеса на формулиране на политики и изготвяне на нормативни актове.',
                                        'Амбиция' => 'Използване на предимствата на новите технологии за разширяване на обхвата на включените в обществените консултации заинтересовани страни.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Цялостното усъвършенстване на процедурите по провеждане на обществени консултации и разширяването на каналите за включване осигурява възможност за участие на по-голям брой заинтересовани страни и създава гаранции за по-високо доверие в процеса. Чрез мярката ще бъде подобрен интегритета на публичните институции',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Институт по публична администрация, Съвет за административна реформа',
                                        'Други ангажирани заинтересовани страни' => 'Български център за нестопанско право, Форум “Граждански инициативи”',
                                        'Очаквано въздействие' => 'Увеличен брой включени в обществените консултации заинтересовани страни; увеличено качество на обществените консултации; подобрени вътрешни процедури за провеждане на обществени консултации; подобрени умения на държавните служители за участие и модериране на публични обсъждания.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Въвеждане на възможност за национална електронна подписка за национална и местна гражданска инициатива, както и намаляване на бюрокрацията и количеството лични данни, които се събират и съпътстващо изменение на Закона за прякото участие на гражданите в държавната власт.',
                                        'Контекст' => 'Понастоящем Законът за прякото участие на гражданите в държавната власт не предвижда възможност за организиране на електронна подписка за национална и местна гражданска инициатива, като такава възможност е предвидена единствено за европейска гражданска инициатива.',
                                        'Основна цел' => 'Активиране на гражданско участие чрез улесняване на процедурите за организиране на национални и местни граждански инициативи',
                                        'Амбиция' => 'Разширяване на възможностите българските граждани да влияят на управлението.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Новите технологии увеличават и значително улесняват самоорганизацията на гражданите с оглед по – активно участие в процеса на взимане на решения. Мярката допринася за подобряване на интегритета на публичните институции',
                                        'Отговорна институция' => 'Администрация на Министерски съве',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Български център за нестопанско право, Форум “Граждански инициативи”',
                                        'Очаквано въздействие' => 'Насърчаване на самоорганизацията на гражданите и гражданските инициативи; намалени бюрократични пречки пред прякото участие на гражданите.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Създаване на постоянна платформа за съвместно наблюдение и оценка на изпълнение на плановете по ПОУ със заинтересованите страни',
                                        'Контекст' => 'Подходът за включване на заинтересованите страни в мониторинг и оценка на изпълнението на ангажиментите в Плановете за действие на България по ПОУ не е систематичен и структуриран. Той разчита на активност от страна на НПО и другите заинтересовани страни, но поради все още слабата познатост на инициативата и липсата на ясен механизъм за действие, твърде ограничен брой представители на гражданския сектор се включват в процеса на проследяване на изпълнението.',
                                        'Основна цел' => 'Стимулиране на активно участие и повишаване на качеството на изпълнение чрез създаване на структуриран механизъм за проследяване на напредъка и изпълнението на националните планове за действие по ПОУ.',
                                        'Амбиция' => 'Постоянно подобряване на качеството на изпълнение на националните планове и ангажиране на всички заинтересовани страни в процеса на оценка и мониторинг.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Създаването на постоянен механизъм за съвместно наблюдение и оценка дава възможност да се увеличи честотата на предоставяне на информация относно изпълнението на ангажиментите по ПОУ, да се осигури предвидимост на диалога, да се създадат устойчиви форми на сътрудничество, а оттам да се стимулира гражданското участие. Чрез мярката се постига подобрен интегритет на публичните институции.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Министерства, отговорни за изпълнение на мерки по плановете',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Повишена прозрачност на процеса по изпълнение на националните планове; участие на по-голям брой заинтересовани страни; идентифициране и коригирани на слабости при изпълнението; стратегически подход при изпълнението и оценката.',
                                        'Срок на изпълнение' => 'октомври 2016 г.',
                                    ],
                                    [
                                        'Наименование' => 'Пилотно въвеждане на нов метод за анализ на сложни и отворени въпроси при формулиране на политически решения при управлението на ЕСИФ в сътрудничество с партньорите (design-thinking): провеждане на семинар със заинтересовани страни, посветен на практическото прилагане на политиките по околна среда и политиката срещу изменението на климата като хоризонтална политика при управлението на ЕСИФ',
                                        'Контекст' => 'Колаборативният подход (co-design, design-thinking) е все още слабо използван в България при решаване на комплексни въпроси при формулиране на политически решения. В консултативния процес се разчита предимно на конвенционални методи, които често са по- статични и недостатъчно гъвкави, и залагат на модели на съвместна работа, които по-скоро ограничават креативността и иновативността.',
                                        'Основна цел' => 'Въвеждане на иновативни модели на консултиране и повишаване на качеството на формулираните политики.',
                                        'Амбиция' => 'Налагане на нова колаборативна култура на формулиране и изпълнение на политики.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Новите подходи за колаборативно формулиране на решения и политики допринасят за повече равнопоставеност и баланс в процеса на консултиране, дават възможност да се споделят различни мнения, като по този начин стимулират гражданското участие. Мярката цели подобряване на интегритета на публичните институции и по - ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет, Централно координационно звено ',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Създадени умения у представителите на управлението за прилагане на подхода design-thinking за решаване на комплексни въпроси, свързани с формулиране на политики; стимулиране на креативността на заинтересованите страни; насърчаване на иновативни подходи за консултиране.',
                                        'Срок на изпълнение' => 'декември 2016 г.',
                                    ],
                                    [
                                        'Наименование' => ' Разработване и организиране на форуми по разработването на Стратегия за корпоративна социална отговорност',
                                        'Контекст' => 'Стимулирането на корпоративна социална отговорност е тема, която присъства в обществения дебат от години, но до момента инициативите за корпоративна социална отговорност са основно резултат от самоорганизация на фирмите и в много малка степен се насърчават систематично от публичните институции.',
                                        'Основна цел' => 'Да се въведат ясни механизми за насърчаване на корпоративна социална отговорност в сътрудничество с бизнес',
                                        'Амбиция' => 'Осигурява на систематичност и фокус на процеса на стимулиране на корпоративна социална отговорност и използване на потенциала и ресурса на бизнеса за предоставяне на по- добри социални услуги.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката стимулира колаборативен подход, активно включване на представителите на бизнеса и гражданите, и прозрачност на процеса по изготвяне на стратегически документи, по-конкретно Стратегия за корпоративна социална отговорност. Тя гарантира повишен интегритет на публичните институции и по-добри публични услуги в социалната сфера.',
                                        'Отговорна институция' => 'Министерство на труда и социалната политика',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Бизнес организации',
                                        'Очаквано въздействие' => 'Улесняване на бизнеса при изпълнението на инициативи за корпоративна социална отговорност; подобрено сътрудничество между държавата и бизнеса в социалната сфера; предвидимост и систематичност на държавните стимули за корпоративната социална отговорност.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ]
                                )
                            ],
                            [
                                'commitment' => 'Българското правителство ще подобрява средата и ще предприеме стъпки за подкрепа на развитието на гражданските организации',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Актуализиране на Стратегията за подкрепа развитието на гражданските организации и приемане на нов план и отговорна институция за изпълнението й',
                                        'Контекст' => 'Стратегията за подкрепа развитието на гражданските организации е с изтекло действие и понастоящем няма отговорна институция, която е ангажирана с нейното актуализиране и последващо изпълнение',
                                        'Основна цел' => 'Създаване на условия за ефективна работа на гражданските организации и активно участие в процесите на взимане на решения, формулиране на политики, и контрол на управлението. ',
                                        'Амбиция' => 'Жизнеспособен граждански сектор, който допринася активно за подобряване на управлението, предоставя ефективни услуги и увеличава своята експертиза.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката има за цел да създаде подходящи условия за развитие на гражданските организации и да стимулира партньорството между тях и институциите на национално и местно ниво.Тя ще допринесе за подобрен интегритет на публичните институции.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Български център за нестопанско право, Форум “Граждански инициативи”',
                                        'Очаквано въздействие' => 'Подкрепа за развитието на гражданските организации.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ]
                                )
                            ],
                        ),
                        'Почтено управление (интегритет)' => array(
                            [
                                'commitment' => 'Българското правителство ще работи за увеличаване на почтеността в управлението и подобряване на вътрешния и външен контрол върху дейността на институциите',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Създаване на публичен регистър за бюджетен и проектен контрол на електронното управление',
                                        'Контекст' => 'Въвеждането на електронно управление в България е широкомащабна и приоритетна задача на българското правителство. В рамките на инициативата за електронно управление предстои да бъдат изпълнени редица големи проекти с висока финансова стойност',
                                        'Основна цел' => 'Осигуряване на прозрачност чрез публичен достъп до всички проектни идеи в рамките на е-управление.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката цели да подобри достъпа и обмена на информация и да подобри прозрачността и отчетността на дейностите по изграждане на електронно управление в България. Чрез нея се постига подобряване на интегритета на публичните институции и по-ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Агенция за електронно управление (предстои да бъде създадена)',
                                        'Други ангажирани заинтересовани страни' => 'Фирми от ИТ сектора',
                                        'Очаквано въздействие' => 'Подобряване на проследимостта на проектите; предотвратяване на дублиране на дейности; ефективен граждански контрол.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Реализиране на универсална ЦАИС „Анализ на корупционния риск“',
                                        'Контекст' => 'Антикорупционните звена в различните сектори на управлението имат нужда от инструмент, с който да анализират потенциалния риск при лица, заемащи публични длъжност. В момента процесът е разпокъсан, недостатъчно ефективен и включва ръчна проверка на множество обстоятелства в множество информационни архиви и единици. ЦАИС “Анализ на корупционния риск” ще бъде система, внедрена както на централно, така и на секторно ниво, която автоматично ще анализира корупционен риск, свързан с длъжностни лица, комбинирайки информация от много източници и регистри и ще позволява извършване на периодични и ad-hoc проверки. Системата предвижда и функционалност за генериране на публичен агрегиран отчет. ',
                                        'Основна цел' => 'Подобряване на процесите по вътрешен контрол и намаляване на корупционния риск.',
                                        'Амбиция' => 'Напълно автоматизиран процес на контрол.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Чрез създаването на система за анализ на корупционния риск и изграждането на функционалност за генериране на публичен генериран отчет се осигурява възможност за по-активен граждански контрол и информирано участие на гражданите в усилията за предотвратяване на корупционни практики и конфликт на интереси. Мярката цели подобряване на интегритета на публичните институции и по-ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Министерство на правосъдието',
                                        'Други ангажирани публични институции' => 'Център за превенция и противодействие на корупцията и организираната престъпност',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Консолидиран и по-ефективен процес на анализ на корупционен риск; чрез публичните отчети се активизира граждански натиск.',
                                        'Срок на изпълнение' => 'септември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'На основание чл. 10, ал. 11 от ЗМ при назначаване и повишаване в длъжност в Агенция "Митници", лицата трябва да имат положителен резултат от изследване за професионална и психологическа пригодност. Изготвен и внесен проект на наредба в Министерство на финансите.',
                                        'Контекст' => 'Агенция „Митници“ носи характеристиките на администрация, чиято дейност е свързана с националната сигурност и обществения ред. В чл. 10, ал. 11 от Закона за митниците е отчетена спецификата на митническата дейност и функциите на администрацията на територията на страната, като част от митническата територия на Европейския съюз. Поставянето на изисквания за извършване на професионална и психологическа пригодност към лицата, кандидатстващи за длъжност в Агенция „Митници“ и към служителите при повишаване в длъжност, е обосновано от високите очаквания от дейността на митническите органи в Република България като част от администрацията на Европейския съюз. Назначаването на всяка длъжност на държавен служител се извършва чрез конкуренция, основана на професионални качества. Чрез регламентирана процедура за извършване на изследване за професионална и психологическа пригодност, Агенция „Митници“ има за цел да се проверяват знанията, уменията и нагласите на кандидата за служител в митническата администрация, относно справянето със задачи, които са свързани със задълженията на съответната длъжност, включително и при ситуации, пораждащи условия за контрапродуктивно поведение. За изпълнение на длъжност в митническата администрация се изисква кандидатът да притежава честност и нагласа за придържане към установените правни, организационни, морални и социални норми. С чл. 10, ал. 11 от Закона за митниците е отчетена спецификата на митническата дейност и високите изисквания към служителите с цел постигане на резултати от осъществяването й. Очакваните резултати от изследването за професионална и психологическа пригодност са набиране и задържане на персонал, който има и може да поддържа високи стандарти на интегритет, безпристрастност и осигуряване на адекватно обучение и професионално развитие на митническите служители. Само едновременното прилагане на тестове за професионална компетентност и изследване за професионална и психологическа пригодност ще доведе до създаване на цялостна представа за профила на кандидата, подходящ за работа в митническата администрация. ',
                                        'Основна цел' => 'Ефективна превенция на нерегламентирани практики и намаляване на корупционния риск чрез мерки за подбор и вътрешен контрол на персонала.',
                                        'Амбиция' => 'Превръщане на Агенция “Митници” в модел за ефективно справяне с корупционния натиск.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Подобряване на интегритета на публичните институции и по-ефективно управление на публични ресурси',
                                        'Отговорна институция' => 'Агенция “Митници”',
                                        'Други ангажирани публични институции' => 'Министерство на финансите',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Намален корупционен риск; активна превенция на корупционни практики; по-ефективна работа на Агенцията.',
                                        'Срок на изпълнение' => 'постоянно',
                                    ],
                                    [
                                        'Наименование' => 'Осигуряване на прозрачност на дейността и процесите на управление на митническата администрация чрез подържане на различни видове канали за подаване на сигнали от гражданите ("горещ телефон"), информационна система на Националния  съвет по антикорупционни политики, e-mail, писмено чрез деловодствата и кутии за сигнали) и предприемане на съответни действия по постъпилите сигнали и предложения',
                                        'Контекст' => 'Превенцията и противодействието на корупцията е един от приоритетите в дейността на Агенция "Митници" и е от съществено значение за ефективната работа на агенцията.',
                                        'Основна цел' => 'Ангажиране на обществеността за превенция на корупционни практики и разширяване на наличните канали за комуникация по темата.',
                                        'Отговорна институция' => 'Агенция “Митници”',
                                        'Други ангажирани публични институции' => 'Министерство на финансите',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Подобряване на прозрачността в работата на Агенция “Митници”; увеличен брой сигнали; подобрена обратна връзка по постъпили сигнали; подобряване на вътрешните процедури.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Въвеждане на изменения в Закона за обществени поръчки, предвиждащи предварителна проверка на кандидати за поръчки над определена минимална сума и разкриване на крайния собственик на кандидата',
                                        'Контекст' => 'Темата за обществените поръчки, особено свързани с големи инфраструктурни проекти, е особено чувствителна за обществото. Съществуващите неясноти относно собствеността на компании, кандидатстващи или изпълняващи обществени поръчки, подкопава доверието в справедливостта на процеса на възлагане и поражда съмнения за нерегламентиран натиск, скрито влияние и корупция. ',
                                        'Основна цел' => 'Подобряване на вътрешния контрол при разходване на публичен ресурс и намаляване на корупционния риск в процеса на възлагане на обществени поръчки. Постигане на яснота и прозрачност относно собствеността на компании, опериращи с публичен ресурс.',
                                        'Амбиция' => 'Подобряване на бизнес средата и намаляване на възможностите компании с неясни цели и собственост да се ползват с конкурентно предимство пред легитимни, спазващи правилата кандидати',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Чрез тази мярка се повишава прозрачността в процеса на възлагане на обществени поръчки. Осигурява се повече отчетност при оценката на потенциални кандидати. Така се подобрява интегритета на публичните институции и се постига по-ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Министерство на правосъдиет',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Избягване на публично съмнение по отношение на възлагането на големи обществени поръчки; ограничаване на възможността за създаване на кухи компании с цел участие в обществени поръчки; създаване на инструмент за борба с корупцията и предотвратяване на използването на публичен ресурс за участие в престъпна дейност като пране на пари, трафик на хора, оръжие, наркотици и др.; възможност държавните институции да упражняват контрол върху реалните собственици; възможност банки, финансови институции и компании да извършват лесни и бързи проверки на свои контрагенти.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ]
                                )
                            ],
                        ),
                        'Отворени данни' => array(
                            [
                                'commitment' => 'Българското правителство ще продължи усилията си за публикуване на публична информация в отворен формат като въведе мерки за повишаване на качеството на данните и за широкото им използване от заинтересованите страни',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Надграждане и усъвършенстване на портала за отворени данни с добавяне на нови функционалности – йерархичност на организациите, по-добро търсене, issue tracker за масиви от данни, инструменти за автоматично качване на данни, сигнал за ниско качество на данните, сертификат за институции с високи постижения, възможност за обратна връзка и др.',
                                        'Контекст' => 'Понастоящем порталът е в демо версия и не поддържа редица ключови функционалности.',
                                        'Основна цел' => 'Подобряване на Портала за отворени данни и на качеството на публикуваните масиви от данни чрез автоматизиране на процесите, свързани с публикуване на обществена информация в машинно-четим формат.',
                                        'Амбиция' => 'Подобрена ползваемост на портала и на данните, публикувани в него',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Чрез подобрена ползваемост, разширени функционалности и повишено качество на данните се стимулира по- активна употреба на публичните данни от граждански организации и бизнес и възможност за информиран, базиран на данни принос към взимането на решения и формулиране на политики. Мярката е насочена към подобряване на интегритета на публичните институции, по-ефективно управление на публичен ресурс и по-добри публични услуги. ',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'По-високо качество и ползваемост на масивите от данни; по-активна ангажираност на потребителите и по-ефективна комуникация с тях; повече услуги и продукти, базирани на отворени данни.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Публикуване на данни от ИСУН2020 относно програмите и проектите, вкл. напредък на изпълнението',
                                        'Контекст' => 'Понастоящем на портала са публикувани данни от системата, като е необходимо тяхното постоянно актуализиране и подобряване.',
                                        'Основна цел' => 'Повишаване на ползваемостта на публикуваната информация и разширяване на обхвата ползватели.',
                                        'Амбиция' => 'Активен публичен контрол върху изпълнението на програми и проекти, финансирани по ЕСИФ.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Разширяване на обхвата на достъпната информация в машинно – четим формат. Чрез мярката се постига подобряване на интегритета на публичните институции, по-ефективно управление на публичен ресурс и по-добри публични услуги.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет, Централно координационно звено',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'По-високо качество на анализите и визуализации, свързани с ефективността на програмите и проектите; подобрен процес на програмиране и планиране, базиран на данни; повишена прозрачност и ангажираност на заинтересованите страни.',
                                        'Срок на изпълнение' => 'постоянен',
                                    ],
                                    [
                                        'Наименование' => 'Провеждане на публични събития за популяризиране на предимствата на отворените данни сред потребителите и събиране на реални примери за икономическите и социални ползи',
                                        'Контекст' => 'България отбелязва чувствителен напредък по отношение на активното публикуване на обществена информация в отворен формат. На този етап обаче този напредък не води до съпътстващо значително увеличение на ползването, което се дължи на това, че процесът е твърде нов и ползвателите все още не са запознати добре с него, не притежават необходимите умения за работа с данни, и не отчитат предимствата на подходите, базирани на данни.',
                                        'Основна цел' => 'Активизиране на ползването на отворени данни при формулиране на политики, създаване на услуги и продукти, базирани на данни, упражняване на контрол върху институциите.',
                                        'Амбиция' => 'Генериране на реални икономически и социални ползи от публикуването на данни в отворен формат.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката насърчава по- активното ангажиране на граждани и бизнес в разработването на продукти и услуги, базирани на данни, в обработката и анализа на данни с цел информирано участие в публичния дебат. Тя цели подобряване на интегритета на публичните институции, по-ефективно управление на публичен ресурс и по-добри публични услуги.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Собственици на данн',
                                        'Други ангажирани заинтересовани страни' => 'ИТ специалисти, анализатори, медии',
                                        'Очаквано въздействие' => 'Увеличен интерес към масивите от данни на портала; създадени нови продукти и услуги, базирани на данни; изграждане на екосистема от ползватели.',
                                        'Срок на изпълнение' => 'постоянно',
                                    ],
                                    [
                                        'Наименование' => 'Изготвяне и разпространяване на наръчник за работа с отворени данни',
                                        'Контекст' => 'Работата с данни е сравнително ново умение за всички потребители и в частност за представителите на администрацията. В рамките на управлението все още са редки примерите за формулиране на политики и взимане на решения въз основа на отворени данни.',
                                        'Основна цел' => 'Насърчаване на държавните служители да ползват данни при изпълнение на техните задължения и подобряване на техните умения за обработка и анализ на данни.',
                                        'Амбиция' => 'Все по-активно ползване на данни при разработване на политики.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Наръчникът ще подобри уменията на потребителите за работа с данни, а оттам и достъпността на публикуваните в отворен формат данни. Мярката е насочена към подобряване на интегритета на публичните институции, по-ефективно управление на публичен ресурс и по-добри публични услуги.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Институт по публична администрация',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Повишени умения на държавните служители за обработка и анализ на данни.',
                                        'Срок на изпълнение' => 'юни 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Актуализиране, поддържане и разработване на GIS приложения на регистъра на защитени територии в България',
                                        'Контекст' => 'Околната среда е сфера, в която GIS приложенията допринасят съществена за оценка и планиране, опазване и управление на ресурсите, информиране на населението и докладване пред контролни и регулаторни органи. В момента е разработено само едно GIS приложение към електронния регистър на защитените територии в България.',
                                        'Основна цел' => 'Подобряване на вземането на решения и точно насочване на мерките за опазване на защитените територии. По-активно използване на гражданския потенциал за защита и опазване на защитените територии.',
                                        'Амбиция' => 'Осигуряване на качествени информационни услуги за вътрешни и външни потребители.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката спомага за увеличаване на наличната информация и нейното картографирани, като по този начин допринася за повече прозрачност на дейностите по опазване на околната среда и възможност гражданските организации за оказват качествен контрол върху процеса на взимане на решения в тази област. Чрез нея се постига по-ефективно управление на публични ресурси и по-добри публични услуги.',
                                        'Отговорна институция' => 'Министерство на околната среда и водите, Дирекция „Национална служба за защита на природата“',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'По-висока ефективност и навременност на мерките за опазване на защитени територии; включване на екологични организации и граждани в процеса по опазване и управление на защитени територии; създаване на картографски визуализации, проследяване на различни сценарии и визуализиране на описателни данни на базата на пространствени явления.',
                                        'Срок на изпълнение' => 'май 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Публикуване на таблица с макроикономическа прогноза два пъти годишно',
                                        'Контекст' => 'Понастоящем макроикономическата прогноза се публикува в PDF, което не е отворен, машинночетим формат.',
                                        'Основна цел' => 'Повишаване на финансовата прозрачност и отчетността на управлението.',
                                        'Амбиция' => 'Разширяване на обхвата от данни, публикувани в портала за отворени дан',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката допринася за увеличаване на обема, качеството и ползваемостта на предоставяната финансова информация. Тя цели по-ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Министерство на финансите',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'лесняване на обработката; засилване на прозрачността и отчетността при управлението на публичните финанси; по-точни анализи',
                                        'Срок на изпълнение' => 'Ежегодно, на шестмесечие, съответно в месеците април и октомври.',
                                    ],
                                    [
                                        'Наименование' => 'Публикуване на данни в отворен формат относно миграционните процеси',
                                        'Контекст' => 'Данните не се публикуват в отворен, машинно-четим формат.',
                                        'Основна цел' => 'Улесняване на обработката и активизиране на гражданското участие по темата',
                                        'Амбиция' => 'Разработване на приложения с цел адресиране на съществуващите обществени страхове.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката осигурява възможност за лесна обработка и анализ на публични данни и информирано участие на граждански организации при формулиране на политики по отношение на миграцията. Чрез нея се постигат подобряване на интегритета на публичните институции и по-ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Министерство на вътрешните работи',
                                        'Други ангажирани публични институции' => 'няма',
                                        'Други ангажирани заинтересовани страни' => 'Институт за развитие на публичната среда',
                                        'Очаквано въздействие' => 'Активно включване на заинтересованите страни в усилията за управление на мигрантската криза; повишено познаване на процесите и възможност за бърза реакция при възникнали проблеми; формулиране на политики по отношение на мигрантите, основани на точна и навременна информация.',
                                        'Срок на изпълнение' => 'юни 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Доразвитие на ЕИСПП и предоставяне на публичен достъп до информация в ядрото на системата, свързан с инициативата Open Data, както и при предоставянето на КАО',
                                        'Контекст' => 'Данните, свързани с работата на съдебната система, са обект на сериозен интерес от страна на анализатори, медии и граждани. Същевременно те са ценен ресурс за самите представители на съдебната система, тъй като техният анализ може да допринесе за подобряване на работата й и повишаване на доверието между граждани и правораздаващи органи. Понастоящем такива данни не се публикуват в машинно-четим формат.',
                                        'Основна цел' => 'Увеличаване на прозрачността и ефективността на съдебната система.',
                                        'Амбиция' => 'Постепенно увеличаване на доверието на гражданите в органите на съдебната власт.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката е насочена към увеличаване на обема на наличната публична информация и повишаване на качеството и ползваемостта й. Тя адресира предизвикателствата, свързани с по-добри публични услуги и подобрен интегритет на публичните институции .',
                                        'Отговорна институция' => 'Висш съдебен съвет',
                                        'Други ангажирани публични институции' => 'Министерство на правосъдието',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Въвеждане на нови подходи за взимане на решения, базирани на данни; идентифициране на слабости в работата на системата на основата на обективни данни; включване на заинтересованите страни в усилията за реформа на съдебната система.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ],
                                )
                            ],
                        )
                    ),
                    'en' => array(),
                )
            ),

        );
        return array(
            'files' => $data[$id]['files'][$lang] ?? [],
            'evaluations' => $data[$id]['evaluations'][$lang] ?? [],
            'content' => $data[$id]['content'][$lang] ?? [],
            'ogDescription' => $data[$id]['ogDescription'][$lang] ?? [],
            'arrangements' => $data[$id]['arrangements'][$lang] ?? [],
        );
    }

}
