<h5>II. 5. Анализ на данните и оценяване на въздействията</h5>

@php( $loop = count(data_get($state, 'changes', [[]])) )
@for($a=0; $a<$loop; $a++)
<h6>Изменение {{ $a+1 }}</h6>
<p>Представя се анализът на всички събрани данни, който включва тяхното тълкуване и обобщаване и/или изчисляване чрез прилагане самостоятелно или заедно на някои от методите за оценяване на въздействията. </p>

<h6>А1. Информация за отговорите и изразените становища на заинтересованите страни</h6>
@include('form_partials.textarea', ['name' => "analysis[$a][answers_info]", 'class' => 'mb-2'])

<h6 class="mt-3">А2.	Информация относно използвания метод за оценяване на въздействията</h6>
<p>Оценяването на въздействията от приемането или изменението на нормативния акт се основава на анализа на събраните данни. При оценяването на въздействията и формирането на изводи се тълкуват и обобщават анализираните данни, като се правят съответните изчисления, като се използват самостоятелно или заедно някои от следните методи/групи методи:</p>

<h6>§. Прагматични методи</h6>
<p>Група прагматични методи, включително наблюдение на изпълнението и теория на промяната като рамка за данни:</p>
<p>
    &check; Наблюдение на изпълнението
    <br>
    &check; Теория на промяната като рамка за данни
</p>

<h6>§. Строги подходи</h6>
<p>Строгите методи за оценяване на въздействията са методи, които имат ясна отправна точка за формулиране на твърдения на принципа „причина - следствие“.</p>

<h6>Проучване на казуси</h6>
<p>Група методи за проучване на казуси, включително чрез проследяване на процеса и реалистично оценяване, анализ на съгласуваност и анализ на продължението, и качествен сравнителен анализ.</p>
<p>
    &check; Проследяване на процеса и реалистично оценяване
    <br>
    &check; Анализ на съгласуваността и анализ на продължението
    <br>
    &check; Качествен сравнителен анализ
</p>

<h6>(Квази) експериментални методи</h6>
<p>Група методи за изследване чрез контролни групи, които позволяват да се оцени ефектът от нормативната промяна чрез сравнение на резултатите между равностойни тестова и контролна група.</p>
<p>
    &check; Рандомизирани контролирани проучвания (експериментален)
    <br>
    &check; Склонност за съответствие (квази-експериментален)
    <br>
    &check; Разлика в разликата (квази-експериментален)
    <br>
    &check; Прекъсване на регресията (квази-експериментален)
</p>

<h6>§. Мултикритериен анализ</h6>
<p>Mетод за последваща оценка на въздействието върху основата на специален набор от критерии, които са свързани с набелязаните цели.</p>

<h6>§. Модел на стандартните разходи</h6>
<p>Mетодологическа рамка за измерване на разходите за изпълнение на задълженията за предоставяне на информация.</p>

<h6>Резултати от анализа на събраните данни</h6>
<p>Посочват се конкретните резултати от приложените методи за оценяване на въздействието.</p>
@include('form_partials.textarea', ['name' => "analysis[$a][results]", 'class' => 'mb-2'])

@endfor
