<h3>II. 4. Заинтересовани страни и събрани данни</h3>
<p>Посочва се информация за заинтересованите страни, събраните данни и информация за проведените консултации.</p>

@php( $loop = count(data_get($state, 'changes', [[]])) )
@for($a=0; $a<$loop; $a++)
<h4>Изменение {{ $a+1 }}</h4>

<h5>1. Заинтересовани страни</h5>
<p>Посочват се идентифицираните адресати и заинтересовани страни на нормативния акт. Възможно най-пълно обхващане на заинтересованите страни в процеса по извършване на последващата оценка на въздействието е от изключителна важност.  (Ръководство, РМС № 885 от 2020 г., стр. 20-22)</p>
@include('form_partials.textarea', ['name' => "collected_data[$a][interested_parties]"])

<h5>2. Информация относно проведените консултации със заинтересованите страни</h5>
<p>Посочват се заинтересованите страни, начините и периода на провеждане на консултациите със заинтересованите страни.</p>
@include('form_partials.textarea', ['name' => "collected_data[$a][consultations]"])

<h5>3. Събрани данни</h5>
<p>Посочва се информация за други използвани източници на относими за оценката данни.</p>
@include('form_partials.textarea', ['name' => "collected_data[$a][sources]"])

@endfor