<h5>II. 6. Описание на въздействията и формулираните изводи</h5>

@php( $loop = count(data_get($state, 'changes', [[]])) )
@for($a=0; $a<$loop; $a++)
    <h6>Изменение {{ $a+1 }}</h6>
    <p>Описват се въздействията и формулираните изводи въз основа на анализа на данните и методите за тяхното тълкуване, обобщаване и изчисляване, както и причините за техния избор.</p>
    @include('form_partials.textarea', ['name' => "impact[$a][conclusion]", 'class' => 'mb-3'])
@endfor

<h5>II. 7. Заключения</h5>
@include('form_partials.textarea', ['name' => 'conclusions', 'class' => 'mb-3'])

<h5>II. 8. Начини на разпространение на резултатите от последващата оценка</h5>
<p>Посочват се начините, по които ще бъдат разпространени резултатите от оценката, като публикуването на интернет-страницата на съответната институция и на Портала за обществени консултации е нормативно изискване.</p>
<p>За повишаване на публичността на резултатите от оценката е възможно да бъдат използвани всички познати информационни канали, като резултатите могат да бъдат представени на официални политически форуми, на официални експертни форуми и кръгли маси, на пресконференции, чрез съобщения до медиите, чрез изпращане до формални и неформални групи в и извън администрацията и др.</p>
@include('form_partials.textarea', ['name' => 'distribution', 'class' => 'mb-3'])

<h5>II. 9. Препоръки за последващи действия съгласно чл. 18б от ЗНА</h5>
<p>Съгласно Закона за нормативните актове и Наредбата за обхвата и методологията за извършване на оценка на въздействието в зависимост от резултатите от последващата оценка на въздействието органът, в чиято компетентност е изпълнението на нормативния акт или който традиционно предлага промени в него, може да предлага отмяна, изменение или допълнение на нормативния акт и да инициира извършването на предварителна оценка на въздействието на предложените промени.</p>
@include('form_partials.textarea', ['name' => 'recommendations', 'class' => 'mb-3'])

<h5>II. 10.	Източници</h5>
<p>Описание на използваните източници на информация</p>
@include('form_partials.textarea', ['name' => 'sources', 'class' => 'mb-3'])

<h5>III. Приложения</h5>
<p>Към доклада се представят всички приложения, които не са включени в основните раздели и които съдържат информация, подкрепяща анализа в последващата оценка на въздействието.</p>
@include('form_partials.textarea', ['name' => 'applications', 'class' => 'mb-3'])
