@php
    $nameSimple = 'changes';
    $loop = array_key_exists($nameSimple, $state) ? count($state[$nameSimple]) : 1;
@endphp
<table width="100%">
    @for ($a=0; $a<$loop; $a++)
    <tr>
        <td>
            <h5>
                Изменение {{ $a+1 }}
                @if($a > 0)
                    @include('form_partials.remove_button')
                @endif
            </h5>

            <h6>1. Изследване на причините за приемането или за изменението на нормативния акт</h6>
            <p>Причините за приемането на нормативния акт могат да съдържат няколко постигнати резултата, няколко последици (преки ефекти) и няколко въздействия - косвени ефекти. При изследването на причините за приемането на нормативния акт може да се акцентира върху връзката постигнати резултати – последици – въздействия, в този ред и в обратен ред.</p>
            <p class="text-danger">
                <i>При изследването на причините за приемането или изменението на нормативния акт се:
                <br>&check; вземат предвид използваните ресурси, постигнатите резултати, последиците и въздействията от приемането или изменението на нормативния акт;
                <br>&check; вземат предвид причинно-следствените връзки между приемането или изменението му, последиците и въздействията от него, промени в обществените отношения, промяна в поведението на адресатите на акта и др.;
                <br>&check; изследват мотивите, съответно докладът към проекта на нормативния акт преди приемането му, частичната или цялостната предварителна оценка на въздействието, когато са извършени такива;
                <br>&check; изследва съдебна практика, която е свързана с нормативния акт.
                </i>
            </p>
            @include('form_partials.textarea', ['name' => "changes[$a][investigate_changes]"])

            <h6 class="mt-3">А1.	Конкретни проблеми, довели до приемането или изменението на нормативния акт</h6>
            <p>Представят се предходно дефинираните проблеми – тези, които са стояли за разрешаване с нормативния акт. </p>
            @include('form_partials.array_textarea', ['name' => "changes[$a][problem_to_solve][]", 'buttonLabel' => 'custom.problem'])

            <h6 class="mt-3">А2.	Използвани ресурси, постигнати резултати, последици и въздействия от приемането или изменението на нормативния акт;</h6>
            <p><b>Използваните ресурси:</b></p>
            <p>Посочват се ресурсите, които са били използвани за изпълнение на оценявания нормативен акт (негова промяна), като финансови ресурси, човешки ресурси, материали и др.</p>
            @include('form_partials.textarea', ['name' => "changes[$a][resources_used]", 'class' => 'mb-3'])

            <p><b>Постигнати резултати:</b></p>
            <p>Постигнатите резултати показват аргумента за необходимостта от приемането на нормативния акт. Това са състояния, положения, действия и т.н., настъпили в рамките на прилагането на нормативния акт.</p>
            @include('form_partials.textarea', ['name' => "changes[$a][achieved_results]", 'class' => 'mb-3'])

            <p><b>Последици (преки ефекти):</b></p>
            <p>Това са преките, непосредствените ефекти от приемането на нормативния акт, чиито проявления се регистрират в краткосрочен план след приемането на нормативния акт.</p>
            @include('form_partials.textarea', ['name' => "changes[$a][direct_effects]", 'class' => 'mb-3'])

            <p><b>Въздействия:</b></p>
            <p>Това са трансформиращите ефекти, чиито проявления се регистрират в дългосрочен план след приемането на нормативния акт (наричани и „косвени“).</p>
            @include('form_partials.textarea', ['name' => "changes[$a][impacts]", 'class' => 'mb-3'])

            <h6 class="mt-3">А3.	Причинно-следствени връзки между приемането/изменението на нормативния акт, последиците и въздействията от него, промени в обществените отношения, промяна в поведението на адресатите на акта и др.</h6>
            @include('form_partials.textarea', ['name' => "changes[$a][links_regulatory_acts]", 'class' => 'mb-3'])

            <h6 class="mt-3">А4.	Основни акценти от мотивите, съответно доклада към проекта на нормативния акт преди приемането му, частичната или цялостната предварителна оценка на въздействието, когато са извършени такива;</h6>
            @include('form_partials.textarea', ['name' => "changes[$a][main_highlights]", 'class' => 'mb-3'])

            <h6 class="mt-3">А5.	Резултати от изследвана съдебна практика, свързана с нормативния акт.</h6>
            @include('form_partials.textarea', ['name' => "changes[$a][results_court]", 'class' => 'mb-3'])

            <h4 class="mt-5">2. Критерии за оценка</h4>
            <p>При извършване на последваща оценка на въздействието могат да се прилагат различни критерии, за да се оценят резултатите от прилагането на нормативния акт. В изложението по-долу са представени най-често използваните критерии за последваща оценка на въздействие (междинно и последващо оценяване). Възможните критерии са няколко (Ръководството, РМС № 885 от 2020 г., стр. 17 – 20):</p>

            <h6 class="mt-3">Критерий 1.	Постигане на целите</h6>
            <p>Постигане на целите – този критерий показва степента, в която целите от приемането или изменението на нормативния акт са постигнати, независимо дали това се дължи на прилагането на нормативния акт.</p>
            @include('form_partials.textarea', ['name' => "changes[$a][criteria1]", 'class' => 'mb-3'])

            <h6 class="mt-3">Критерий 2.	Ефективност</h6>
            <p>Ефективност – този критерий показва степента, в която постигането на целите, заложени при приемането или изменението на нормативния акт, се дължи на прилагането на нормативния акт.</p>
            @include('form_partials.textarea', ['name' => "changes[$a][criteria2]", 'class' => 'mb-3'])

            <h6 class="mt-3">Критерий 3.	Ефикасност</h6>
            <p>Ефикасност – този критерий измерва постигането на целите, заложени при приемането или изменението на нормативния акт, с минимално използване на ресурсите при прилагането на нормативния акт. </p>
            @include('form_partials.textarea', ['name' => "changes[$a][criteria3]", 'class' => 'mb-3'])

            <h6 class="mt-3">Критерий 4.	Устойчивост</h6>
            <p>Устойчивост – критерий за оценяване на степента на трайно разрешаване на идентифицираните проблеми.</p>
            @include('form_partials.textarea', ['name' => "changes[$a][criteria4]", 'class' => 'mb-3'])

            <h6 class="mt-3">Критерий 5.	Полезност</h6>
            <p>Полезност – критерий за измерване на степента на удовлетворяване на очакванията на адресатите на политиката и/или на нормативния акт</p>
            @include('form_partials.textarea', ['name' => "changes[$a][criteria5]", 'class' => 'mb-3'])

            <h6 class="mt-3">3. Въпроси за оценка</h6>
            <p>Въпросите, които се поставят за разглеждане от всяка последваща оценка на въздействието, са две групи: общи и конкретни. Общите въпроси за разглеждане могат да бъдат поставени при всяко последващо оценяване. Задължително е обаче да бъдат зададени и конкретните въпроси, които са специфични за текущо оценяваните интервенции, и които се отнасят до всеки от критериите за оценка: постигане на целите, ефективност, ефикасност, устойчивост и полезност на интервенциите. (Ръководство, РМС № 885 от 2020 г., стр. 20-21)</p>
            <p><i>Определени въпроси за оценка:</i></p>
            @include('form_partials.array_textarea', ['name' => "changes[$a][questions][]", 'buttonLabel' => 'forms.question', 'class' => 'mb-3'])
            <p>(Определените конкретни въпроси за оценка (Ръководство, РМС № 885 от 2020 г., стр. 20-21):</p>
        </td>
    </tr>
    @endfor
</table>

@include('form_partials.add_array_button', ['name' => $nameSimple, 'buttonLabel' => 'forms.change'])
