<h5>I. Резюме</h5>
<p>Съдържанието и структурата на резюмето се определя от екипа, извършващ последващата оценка на въздействието, като се вземат предвид изследваните проблеми, акцентите и основните изводи от оценката.</p>
@include('form_partials.textarea', ['name' => 'resume'])

<h5 class="mt-3">II.	Основна част на доклада</h5>
<p class="text-danger">
    <i>NB! Минималното съдържание на основната част на доклада на последващата оценка на въздействието е нормативно установено (чл. 41 от НОМИОВ) с цел установяване на единен подход при структурирането на последващите оценки на въздействието, извършвани от администрацията.</i>
</p>

<h5 class="mt-3">II. 1. Увод</h5>
<p>Посочват се причините за извършването на последващата оценка на въздействието, периодът на извършване на оценката, екипът на оценката и неговото сформиране, използваните източници на данни, бележки, уточнения, таблици и фигури и т.н.</p>
@include('form_partials.textarea', ['name' => 'introduction'])

<h5 class="mt-3">II. 2. Цели</h5>
<p class="text-danger">
    <i>[Посочват се целите, които са поставени пред последващата оценка на въздействието. Теорията определя четири основни цели, с които се характеризира последващата оценка на въздействието:
    <br>&check; подобряване формулирането на политики (изработване на нормативни актове)
    <br>&check; подобряване на прилагането на нормативния акт
    <br>&check; отчетност от прилагането на нормативния акт
    <br>&check; извличане на изводи от прилагането на нормативния акт
    <br>(Ръководство, РМС № 885 от 2020 г., стр. 10)]
    </i>
</p>
<p>Поставените цели на настоящата последваща оценка на въздействието са следните:</p>
@include('form_partials.array_textarea', ['name' => 'goals[]', 'buttonLabel' => 'forms.goal'])

<h5 class="mt-3">II. 3. Обхват и структура на оценката </h5>
@include('form_partials.textarea', ['name' => 'scope_and_structure'])
<p class="text-danger">
    <i>
        *  Определянето на обхвата на последващото оценяване изисква посочване на „обекта“ на оценката – целият нормативен акт, действащ към момента на извършване на оценката; част от нормативния акт; отделна негова разпоредба; конкретно изменение на нормативния акт през времето; период на действие на акта, негова част или изменение; териториален обхват на действие на акта, негова част или изменение и т.н.
        <br>**  Структурата е представена, в случай че се оценяват повече от едно изменение/разпоредба/период на действие и т.н.
        <br>***  В случай че се оценява само едно изменение/разпоредба/период на действие и т.н., посочване на отделни изменения не е необходимо и разделите не се мултиплицират.
    </i>
</p>
