<?php

namespace App\Enums;

use ArchTech\Enums\Names;
use ArchTech\Enums\Options;
use ArchTech\Enums\Values;

enum OldNationalPlanEnum: int
{
    use Names, Options, Values;

    case FIRST = 1;
    case SECOND = 2;

    case THIRD = 3;

    public static function nameByValue($searchVal): string
    {
        $keyName = '';
        foreach (self::options() as $key => $val) {
            if ($val == $searchVal) {
                $keyName = $key;
            }
        }
        return __('custom.old_pan_names.' . $keyName);
    }


    public static function fromDateByValue($searchVal): string
    {
        $dates = [
            self::FIRST->value => '01.06.2012',
            self::SECOND->value => '01.01.2014',
            self::THIRD->value => '01.07.2016',
        ];
        return $dates[$searchVal];
    }

    public static function toDateByValue($searchVal): string
    {
        $dates = [
            self::FIRST->value => '31.12.2013',
            self::SECOND->value => '31.12.2015',
            self::THIRD->value => '30.06.2018',
        ];
        return $dates[$searchVal];
    }

    public static function planData($id = 0, $lang)
    {
        $data = array(
            self::FIRST->value => array(
                'files' => array(
                    'bg' => array(
                        [
                            'path' => 'old_ogp_plan/1/Plan-BG.pdf',
                            'name' => 'Оперативен план (БГ)',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                    'en' => array(
                        [
                            'path' => 'old_ogp_plan/1/PLAN-BG-ENGlast_0-1.pdf',
                            'name' => 'Operational plan (EN)',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    )
                ),
                'evaluations' => array(
                    'bg' => array(
                        [
                            'path' => 'old_ogp_plan/2/OGP-selfassessment.pdf',
                            'name' => 'Отчет на правителството',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                        [
                            'path' => 'old_ogp_plan/2/bulgaria_rev.pdf',
                            'name' => 'Отчет на независимия изследовател',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                    'en' => array(
                        [
                            'path' => 'old_ogp_plan/2/Bulgarian self-assessement Report 1st Action Plan.pdf',
                            'name' => 'Government report',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                        [
                            'path' => 'old_ogp_plan/2/IRM report -Bulgarian 1 Action Plan.pdf',
                            'name' => 'Independent researcher\'s report',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                ),
                'content' => array(
                    'bg' => '<p>През месец юни 2012 г. Министерският съвет прие Оперативен план с конкретни мерки за изпълнение на поетите ангажименти на Република България към Глобалната инициатива по "Партньорството за открито управление".<br>При разработването на конкретните мерки по оперативния план водещите принципи са били четирите ключови принципа на откритото управление: прозрачност, участие на гражданите, отчетност и технологично обновление.<br>Планът е разработен за период до декември 2013 г. и включва конкретни мерки, очаквани резултати от тяхното изпълнение, отговорни институции, срок, източници на финансиране и измерими индикатори.<br>Мерките, за изпълнение на поетите ангажименти, във връзка с присъединяването на Република България към Глобалната инициатива "Партньорство за открито управление", са в приоритетните направления, предвидени в Плана за действие:</p>
                            <ul>
                                <li>По-ефективно управление на публичните средства/ресурси;</li>
                                <li>Повишаване на фирмената отчетност и отговорност.</li>
                            </ul>
                            <p>Предвидени са и общи мерки за подобряване на условията за прилагането на принципите за открито управление.</p>',
                    'en' => '<p>In June 2012, the Council of Ministers adopted an Operational Plan with specific measures for the implementation of the commitments undertaken by the Republic of Bulgaria to the Global Initiative on the "Open Government Partnership".<br>In developing the specific measures under the Operational Plan, the guiding principles were the four key principles of open government: transparency, citizen participation, accountability and technological innovation.<br>The Plan was developed for the period until December 2013 and includes specific measures, expected results from their implementation, responsible institutions, deadline, sources of funding and measurable indicators.<br>The measures for the implementation of the commitments undertaken in connection with the accession of the Republic of Bulgaria to the Global Initiative on the "Open Government Partnership" are in the priority areas provided for in the Action Plan:</p>
                            <ul>
                                <li>More effective management of public funds/resources;</li>
                                <li>Increasing corporate accountability and responsibility.</li>
                            </ul>
                            <p>General measures are also envisaged to improve the conditions for the implementation of open governance principles.</p>',
                ),
                'ogDescription' => array(
                    'bg' => 'През месец юни 2012 г. Министерският съвет прие Оперативен план с конкретни мерки за изпълнение на поетите ангажименти на Република България към Глобалната инициатива по "Партньорството за открито управление".',
                    'en' => 'In June 2012, the Council of Ministers adopted an Operational Plan with specific measures for the implementation of the commitments undertaken by the Republic of Bulgaria to the Global Initiative on the "Open Government Partnership".',
                ),
                'arrangements' => array(
                    'bg' => array(
                        [
                            'name' => 'Нова Стратегия за управление на държавния дълг за периода 2012- 2014 г.',
                            'expect_result' => 'Синтезирани общи насоки за политиката по управление на държавния дълг в тригодишен период. Осигуряване на условия за прозрачност и отчетност при управлението на държавния дълг.',
                            'institution' => 'Министерство на финансите',
                            'end_deadline' => '2012 г.',
                            'finance' => 'Бюджет на МФ',
                            'indicators' => 'Одобрена нова Стратегия за управление на държавния дълг за периода 2012-2014 г.',
                        ],
                        [
                            'name' => 'Разработване на цялостна Визия за създаване на механизъм за финансиране на гражданския сектор и на Стратегия за подкрепа на развитието на гражданските организации в Република България.',
                            'expect_result' => 'Определяне на възможности за финансиране на организациите, за които няма законово уредена действаща практика за партньорството с държавата и общините, постигане на повече прозрачност при използване на средствата от бюджета, предназначени за НПО.',
                            'institution' => 'Министър по управление на средствата от Европейския съюз;<br>Министерство на финансите',
                            'end_deadline' => '2012 г.',
                            'finance' => '',
                            'indicators' => 'Разработена Визия и Стратегия за развитието на гражданските организации в Република България',
                        ],
                        [
                            'name' => 'Промени в бюджетното законодателство за установяване на фискални правила и на процедури за по-ефективно и прозрачно управление на публичните финанси, в това число въвеждане на т.нар. “Бюджет за гражданите”, съдържащ кратко описание на промените, които се правят в политиките, както във финансирането на отделни, важни за гражданите сектори.',
                            'expect_result' => 'Законово регламентиране на фискални правила и процедури, гарантиращи устойчивост на публичните финанси, по-ефективното им управление и спазване на фискалните цели, както и осигуряващи достъпност и прозрачност за обществото, в това число – изготвяне и публикуване на т. н. „Бюджет за гражданите.”',
                            'institution' => '',
                            'end_deadline' => 'В съответствие със сроковете в законодателната програма на МС за второто полугодие на 2012 г. За т.н. “Бюджет за гражданите”, съгласно сроковете по бюджетна процедура за подготовка на закона за държавния бюджет.',
                            'finance' => '',
                            'indicators' => 'Изготвен и публикуван “Бюджет за гражданите.”',
                        ],
                        [
                            'name' => 'Публикуване на финансовите отчети и на отчетите за изпълнение на постигнатите резултати на министерствата и ведомствата, вкл. и на техните второстепенни разпоредители с бюджетни кредити (ВРБК).',
                            'expect_result' => 'Подобрена отчетност и бюджетна прозрачност и по-ясна отговорност за изразходваните ресурси и постигнатите резултати.',
                            'institution' => 'Министерство на финансите и останалите първостепенни разпоредители с бюджетни кредити (ПРБК).',
                            'end_deadline' => 'В съответствие със сроковете, заложени в нормативните актове – за периодичните финансови отчети и отчетите за степента на изпълнение на политиките и програмите на ПРБК, разработващи програмни бюджети.',
                            'finance' => 'Бюджет на ПРБК',
                            'indicators' => 'Публикувани отчети.',
                        ],
                        [
                            'name' => 'Публикуване на информация за данъчните разходи (преференции) от страна на Министерството на финансите.',
                            'expect_result' => 'Бюджетна прозрачност',
                            'institution' => 'Министерство на финансите',
                            'end_deadline' => '2012 г.',
                            'finance' => 'Бюджет на МФ',
                            'indicators' => 'Въведена информационна система.',
                        ],
                        [
                            'name' => 'Публикуването на информация за данъчно-ревизионните актове на Националната агенция за приходите по приключили ревизии.',
                            'expect_result' => 'Осигуряване на публичност и прозрачност чрез информираност при спазване на изискванията на действащото законодателство за опазване на данъчната и осигурителната информация и друга защитена от закон информация.',
                            'institution' => 'Министерство на финансите<br>НАП',
                            'end_deadline' => 'Постоянен. След 20-число на месец, следващ тримесечието.',
                            'finance' => '',
                            'indicators' => 'Брой издадени ревизионни актове.<br>Среден размер на допълнително-установените задължения на един ревизионен акт.<br>Публикувана информация.',
                        ],
                        [
                            'name' => 'Нова Национална стратегия за развитие на минната индустрия',
                            'expect_result' => 'Повишаване прозрачността на политиката за управление на подземните богатства.',
                            'institution' => 'Министерство на икономиката, енергетиката и туризма',
                            'end_deadline' => '2012 г',
                            'finance' => 'Бюджет на МИЕТ',
                            'indicators' => 'Одобрена от МС Стратегия',
                        ],
                        [
                            'name' => 'Нов Закон за подземните богатства',
                            'expect_result' => 'Въвеждат се нови  мерки гарантиращи прилагането на добрите европейски и световни практики по управлението на подземните богатства.',
                            'institution' => 'Министерство на икономиката, енергетиката и туризма',
                            'end_deadline' => '2013 г',
                            'finance' => 'Бюджет на МИЕТ',
                            'indicators' => 'Одобрен от МС проект на Закон за подземните богатства',
                        ],
                        [
                            'name' => 'Публична интернет информационна система за местоположението, групата на полезните изкопаеми и състоянието на запасите и/или ресурсите на подземните богатства с установени находища; специализирани карти и регистри на разрешенията за търсене и проучване и на концесиите за добив на подземни богатства.',
                            'expect_result' => 'Насърчаване на гражданите да използват технологии;<br>Осигуряване на публичност и прозрачност чрез информираност<br>Гарантира правата на всички граждани да получават официални преписи и извлечения от базата данни.',
                            'institution' => 'Министерство на икономиката, енергетиката и туризма',
                            'end_deadline' => '2012 г.',
                            'finance' => 'Бюджет на МИЕТ',
                            'indicators' => 'Наличие на информационна система',
                        ],
                        [
                            'name' => 'Прозрачност на управлението на подземните богатства чрез привличане на независими високо квалифицирани експерти за участие в: провеждането на тръжните и конкурсните процедури за предоставяне на права за подземни богатства; приемането на геоложки доклади, изготвени от титулярите на права; осъществяването на контрола по отношение на дейностите по търсене, проучване и добив на подземни богатства.',
                            'expect_result' => 'Насърчаване на гражданското участие в управлението.<br>Осигуряване на прозрачност в дейността на администрацията.<br>Гарантиране на правата на всички граждани да получаван официални преписи и извлечения от базата данни.',
                            'institution' => 'Министерство на икономиката, енергетиката и туризма',
                            'end_deadline' => '2012 г.',
                            'finance' => 'Бюджет на МИЕТ',
                            'indicators' => 'Въвеждане на практиката в Национална стратегия за развитие на минната индустрия чрез  предвиждане на мерки за насърчаване и разширяване на гражданското участие в управлението на подземни богатства.<br>Нормативно въвеждане на мерките в Закона за подземните богатства.',
                        ],
                        [
                            'name' => 'Извършване на оценка на въздействието на нормативни актове, които имат съществено влияние върху бизнес средата, включително последваща оценка на въздействието на нормативни актове, като подборът на актовете се извършва съвместно с бизнеса.',
                            'expect_result' => 'Насърчаване на гражданското участие в управлението;<br>Подобряване на бизнес средата с активното участие на бизнеса',
                            'institution' => 'Всички ведомства на централната администрация',
                            'end_deadline' => 'Постоянен',
                            'finance' => 'Бюджетите на ведомствата',
                            'indicators' => 'Изготвени оценки',
                        ],
                        [
                            'name' => 'Отчетност и прозрачност на дейността на лицата, предоставящи здравни услуги, чрез изграждането на Национална здравно-информационна система и осигуряване на достъп на гражданите до системата чрез електронен идентификатор. Качеството на медицинските услуги ще бъдe под постоянен институционален и обществен контрол.',
                            'expect_result' => 'Отчетност и прозрачност на дейността на лицата, предоставящи здравни услуги.<br>Подобряване на здравните услуги чрез прилагане на иновативни технологии за оптимизиране на ефикасността на процесите в системата на здравеопазването на всички нива.',
                            'institution' => 'Министерство на здравеопазването и Национална здравно- осигурителна  каса',
                            'end_deadline' => '2013 г.',
                            'finance' => 'Средства от фондове на ЕС и държавен бюджет',
                            'indicators' => 'Изграждане на Национална здравно-информационна система;<br>Осигурен достъп на гражданите до системата чрез електронен идентификатор',
                        ],
                        [
                            'name' => 'Аутсорсване на дейности от държавата към бизнеса.<br>Анализ на практиките в саморегулиращите се сектори и идентифициране на секторите, в които регулирането може да бъде прехвърлено от държавата към бизнеса',
                            'expect_result' => 'Насърчаване на гражданското участие в управлението;<br>Повишаване отговорността на бизнеса',
                            'institution' => 'Министерство на икономиката, енергетиката и туризма',
                            'end_deadline' => '2013 г.',
                            'finance' => 'Бюджет на МИЕТ',
                            'indicators' => 'Изготвени нормативни промени<br>Брой извършени анализи',
                        ],
                        [
                            'name' => 'Подобряване практиката на консултациите с бизнеса чрез активен диалог при формирането на конкретни политики и тяхното прилагане.',
                            'expect_result' => 'Насърчаване на гражданското участие в управлението; Повишаване отговорността на бизнеса чрез включването му при разработването на политиките. Обратна връзка с обществеността',
                            'institution' => 'Всички ведомства на централната администрация',
                            'end_deadline' => 'Постоянен',
                            'finance' => 'Бюджетите на ведомствата',
                            'indicators' => 'Проведени срещи, работни групи, брой завършени обществени обсъждания и др.'
                        ],
                        [
                            'name' => 'Повишаване информираността на гражданите по отношение принципите на корпоративната социална отговорност',
                            'expect_result' => 'Формиране на специфичен за обществото контекст на КСО',
                            'institution' => 'МИЕТ<br>МТСП',
                            'end_deadline' => '2012-2013',
                            'finance' => 'Бюджетите на ведомствата',
                            'indicators' => 'Брой организирани семинари, конференции',
                        ],
                        [
                            'name' => 'Законодателни мерки за насърчаване на социално-отговорни инвестиции, производство и мениджмънт в МСП',
                            'expect_result' => 'Предпоставка за устойчив растеж',
                            'institution' => 'МИЕТ',
                            'end_deadline' => '2012-2013',
                            'finance' => 'Бюджет на ведомството',
                            'indicators' => 'Брой законодателни промени с преференции за предприятията',
                        ],
                        [
                            'name' => 'Иницииране на годишна класация за предприятия с най-отговорно корпоративно поведение; Критерии: социално ангажирани инвестиции, реализирани икономии на енергия и ресурси, брой работни места, принос към развитието на общината.',
                            'expect_result' => 'Създаване на стимул за КСО в предприятията',
                            'institution' => 'МИЕТ и МТСП в партньорство с НСОРБ',
                            'end_deadline' => '2013',
                            'finance' => 'Бюджетите на ведомствата',
                            'indicators' => 'Брой фирми, номинирани за участие;<br>Видове огласяване и медийни изяви',
                        ],
                        [
                            'name' => 'Насърчаване спазването на екологичното законодателство – като важно условие за конкурентоспособност на производствените предприятия.',
                            'expect_result' => 'Въвличане на повече фирми в екологично отговорно производство',
                            'institution' => 'МИЕТ<br>МТСП в партньорство  с НСОРБ',
                            'end_deadline' => '2013',
                            'finance' => 'Бюджетите на ведомствата',
                            'indicators' => 'Създадени адекватни облекчения за фирмите',
                        ],
                        [
                            'name' => 'Организиране на дискусионни форуми на национално и местно ниво за популяризиране на възможностите за корпоративна социална отговорност (КСО) сред широк кръг представители на бизнеса и за представяне на добри практики по КСО.',
                            'expect_result' => 'Насърчаване на гражданското участие в управлението;<br>Въвличане на повече фирми в инициативата на КСО',
                            'institution' => 'Министерство на труда и социалната политика',
                            'end_deadline' => '2012 г.',
                            'finance' => 'Бюджет на МТСП',
                            'indicators' => 'Организирани форуми',
                        ],
                        [
                            'name' => 'Интегриране на превантивните инструменти по околна среда с корпоративните политики чрез повишаване информираността на бизнеса, включително по отношение въвеждането на системи за управление на околната среда ISO 14001, EMAS, схемата за Еко маркировка на ЕС',
                            'expect_result' => 'Насърчаване на гражданското участие в управлението;<br>Въвличане на повече фирми в инициативите, свързани с опазването на околната среда',
                            'institution' => 'Всички ведомства',
                            'end_deadline' => '2013 г.',
                            'finance' => 'Бюджетите на ведомствата',
                            'indicators' => 'Информационни мероприятия',
                        ],
                        [
                            'name' => 'Усъвършенстване на Единния портал за достъп до електронни административни услуги и надграждане с функциите на Единното звено за контакт.',
                            'expect_result' => '<ul>
                                                     <li>Популяризиране на е-управлението и повишаване на доверието у гражданите и бизнеса;</li>
                                                     <li>Изпълнение на Директивата за услугите;</li>
                                                     <li>Обучени избрани целеви групи от администрацията;</li>
                                                     <li>Усъвършенстван портал на електронното управление, предоставящ информация чрез различни комуникационни канали.</li>
                                                </ul>',
                            'institution' => 'МТИТС',
                            'end_deadline' => '2013',
                            'finance' => 'Проект по ОПАК',
                            'indicators' => '<ul>
                                                 <li>Усъвършенстван портал на централизираната платформа;</li>
                                                 <li>Брой внедрени електронни административни услуги.</li>
                                             </ul>',
                        ],
                        [
                            'name' => 'Актуализиране на съдържанието на Регистрите за оперативна съвместимост (Регистър на регистрите и данните – РРД, Регистър на електронните услуги – РЕУ и Регистър на информационните обекти – РИО, Регистър на стандартите, Списък на акредитираните лица и Списък на сертифицираните системи и продукти) на електронното правителство.',
                            'expect_result' => '<ul>
                                                    <li>Намаляване на разходите на администрациите при обмен на информация и взаимодействие между системите им;</li>
                                                    <li>Създаване на условия за по-ефективно публично управление;</li>
                                                    <li>Усъвършенстване на централните системи на електронното управление;</li>
                                                    <li>Усъвършенстване на процесите за предоставяне на електронни административни услуги;</li>
                                                    <li>Усъвършенстване на оперативната съвместимост и осигуряване на възможности за интеграция на европейско ниво.</li>
                                                 </ul>',
                            'institution' => 'МТИТС',
                            'end_deadline' => '2013',
                            'finance' => 'Проект по ОПАК',
                            'indicators' => '<ul>
                                                  <li>Изградена платформа за създаване, съхранение, архивиране и управление на електронни документи, данни и съдържание в администрацията;</li>
                                                    <li>Разработена система за мониторинг и управление на ОСИС</li>
                                                </ul>',
                        ],
                        [
                            'name' => 'Осигуряване на експлоатационна поддръжка на Единния портал за достъп до електронни административни услуги.',
                            'expect_result' => '',
                            'institution' => 'МТИТС',
                            'end_deadline' => '2013',
                            'finance' => 'Проект по ОПАК',
                            'indicators' => 'Изградена централизирана система за мониторинг и управление на информационната сигурност и оперативна съвместимост.',
                        ],
                        [
                            'name' => 'Осигуряване на експлоатационна поддръжка на Регистрите за оперативна съвместимост (Регистър на регистрите и данните – РРД, Регистър на електронните услуги – РЕУ и Регистър на информационните обекти – РИО, Регистър на стандартите, Списъка на акредитираните лица и Списък на сертифицираните системи и продукти) на електронното правителство.',
                            'expect_result' => '',
                            'institution' => 'МТИТС',
                            'end_deadline' => '2013',
                            'finance' => 'Проект по ОПАК',
                            'indicators' => 'Вписани в регистрите на ЕП първични и комплекси е-услуги.',
                        ],
                        [
                            'name' => 'Изграждане на Административна информационна система на кадастъра (КАИС)',
                            'expect_result' => '<ul>
                                                    <li>Предоставяне на електронни и комплексни административни услуги от Агенцията по геодезия, картография и кадастър (АГКК), чрез разработване и внедряване на софтуер в съответствие с Закона за електронното управление (ЗЕУ);</li>
                                                    <li>Разработване на вътрешни правила за документооборота на електронни документи и документи на хартиен носител и реализация на електронна система за управление на жалби, предложения и сигнали;</li>
                                                    <li>Оптимизация и осигуряване на достъп до услуги за незрящи;</li>
                                                    <li>Оптимизация и осигуряване на достъп до услуги а чуждоговорящи клиенти на услуги чрез online транслитерация.</li>
                                                </ul>',
                            'institution' => 'Агенцията по геодезия, картография и кадастър',
                            'end_deadline' => '2013 г.',
                            'finance' => 'Проект по ОПАК',
                            'indicators' => 'Разработена и внедрена Информационна система за предоставяне на електронни и комплексни административни услуги от АГКК',
                        ],
                        [
                            'name' => 'Изграждане на Национална здравно-информационна система, електронно здравно досие, електронна рецепта, електронно направление и т.н.',
                            'expect_result' => 'Развитие на електронното здравеопазване;<br>Повишаване на качеството, контрола и прозрачността при предоставянето на здравни услуги',
                            'institution' => 'Министерство на здравеопазването и Национална здравно- осигурителна  каса',
                            'end_deadline' => '2013 г.',
                            'finance' => 'Средства от фондове на ЕС и държавен бюджет',
                            'indicators' => 'Изградени Национална здравно-информационна система, електронно здравно досие, електронна рецепта, електронно направление и други електронни здравни услуги',
                        ],
                        [
                            'name' => 'Осигуряване на достъп на гражданите до системата чрез електронен идентификатор, който може да бъде използван и за достъп до електронни здравни услуги',
                            'expect_result' => 'Развитие на електронното здравеопазване<br>Достъп до всички електронни услуги на гражданите',
                            'institution' => 'МТИТС',
                            'end_deadline' => '2013',
                            'finance' => 'Проект по ОПАК',
                            'indicators' => 'Създаването на единен електронен идентификатор с който гражданите да се идентифицират при ползването на електронни услуги. Същият идентификатор може да бъде използван и за достъп до електронни здравни услуги',
                        ],
                        [
                            'name' => 'Развитие на интернет страницата на МС за увеличаване на обхвата на информацията, достъпна за гражданите, задаване на добри практики за откритост и прозрачност, задаване на стандарти за информационните масиви и ресурси, използвани в Администрацията на МС.',
                            'expect_result' => 'Осигуряване на публичност и прозрачност чрез информираност',
                            'institution' => 'Администрация на МС',
                            'end_deadline' => '2012',
                            'finance' => 'Бюджет на МС',
                            'indicators' => 'Подобрена интернет страницата на МС',
                        ],
                        [
                            'name' => 'Публичност на правилата, по които работят второстепенните разпоредители с бюджетни кредити към МС, както и на техните финансови резултати и отчети за постигнати резултати.',
                            'expect_result' => 'Подобрена отчетност и бюджетна прозрачност и по-ясна отговорност за изразходваните ресурси и постигнатите резултати.',
                            'institution' => 'Администрация на МС',
                            'end_deadline' => 'В съответствие със сроковете, заложени в нормативните актове – за периодичните финансови отчети и отчетите за степента на изпълнение на политиките и програмите',
                            'finance' => 'Бюджет на МС',
                            'indicators' => 'Подобрена интернет страницата на МС',
                        ],
                        [
                            'name' => 'Контрол за спазването на законовите изисквания за публичност и информираност и публикуване на резултати от проведените проверки на интернет страницата на МС',
                            'expect_result' => 'Повишаване публичността и информираността на гражданите',
                            'institution' => 'Администрация на МС',
                            'end_deadline' => 'Постоянен',
                            'finance' => '',
                            'indicators' => 'Брой извършени проверки и публикации на резултатите от тях.',
                        ],
                        [
                            'name' => 'Подобряване и публичност на Портала за обществени консултации (www.strategy.bg) за по-широко използване',
                            'expect_result' => 'Осигуряване на публичност и прозрачност чрез информираност',
                            'institution' => 'Администрация на МС',
                            'end_deadline' => '2012',
                            'finance' => '',
                            'indicators' => 'Подобрен Портала за обществени консултации',
                        ],
                        [
                            'name' => 'Разширяване на обхвата за публично използване на информационната система за управление и наблюдение за използване на средствата от Структурните и Кохезионния фондове.',
                            'expect_result' => 'Разширяване на възможностите за повторно използване на данните от системата, включително във файлови формати, позволяващи лесна машинна обработка на информацията.',
                            'institution' => 'Администрация на МС',
                            'end_deadline' => '2013',
                            'finance' => '',
                            'indicators' => 'Разширен обем на представената публична информация за реалното постигане на индикаторите по проектите и оперативните програми .',
                        ],
                        [
                            'name' => 'Разработване на ЗИД на Закона за достъп до обществена информация с цел създаване на единни параметри/стандарти за изготвяне и публикуване на актуалната информация от администрациите',
                            'expect_result' => 'Подобряване на публичността и прозрачността чрез информираност',
                            'institution' => 'МП, Заинтересовани ведомства, Администрация на МС, в партньорство с НПО',
                            'end_deadline' => 'Първо полугодие на 2013',
                            'finance' => '',
                            'indicators' => 'Одобрен от МС ЗИД на Закона за достъп до обществена информация',
                        ]
                    ),
                    'en' => array(
                        [
                            'name' => 'New Strategy for Government Debt Management for the period 2012–2014',
                            'expect_result' => 'Synthesized general guidelines for government debt management policy over a three-year period. Ensuring conditions for transparency and accountability in government debt management.',
                            'institution' => 'Ministry of Finance',
                            'end_deadline' => '2012',
                            'finance' => 'Budget of the Ministry of Finance',
                            'indicators' => 'Approved new Strategy for Government Debt Management for the period 2012–2014',
                        ],
                        [
                            'name' => 'Development of a comprehensive Vision for establishing a mechanism for financing the civil sector and a Strategy for supporting the development of civil organizations in the Republic of Bulgaria.',
                            'expect_result' => 'Identifying financing opportunities for organizations for which there is no legally established practice for partnership with the state and municipalities; achieving greater transparency in the use of budget funds intended for NGOs.',
                            'institution' => 'Minister for EU Funds Management;<br>Ministry of Finance',
                            'end_deadline' => '2012',
                            'finance' => '',
                            'indicators' => 'Developed Vision and Strategy for the development of civil organizations in the Republic of Bulgaria',
                        ],
                        [
                            'name' => 'Amendments to budget legislation to establish fiscal rules and procedures for more effective and transparent public finance management, including introduction of the so-called “Citizen’s Budget” containing a brief description of changes made in policies and in the financing of sectors important to citizens.',
                            'expect_result' => 'Legally regulated fiscal rules and procedures ensuring sustainability of public finances, more efficient management and compliance with fiscal goals, as well as providing accessibility and transparency for society, including preparation and publication of a “Citizen’s Budget”.',
                            'institution' => '',
                            'end_deadline' => 'According to the deadlines in the Council of Ministers’ legislative program for the second half of 2012. For the “Citizen’s Budget” – according to the deadlines set in the budget procedure for preparing the State Budget Act.',
                            'finance' => '',
                            'indicators' => 'Prepared and published “Citizen’s Budget”.',
                        ],
                        [
                            'name' => 'Publication of financial statements and performance reports of ministries and agencies, including their secondary budget-spending units (SBSUs).',
                            'expect_result' => 'Improved accountability and budget transparency, and clearer responsibility for the use of resources and the results achieved.',
                            'institution' => 'Ministry of Finance and all primary budget-spending units (PBSUs).',
                            'end_deadline' => 'According to the deadlines established in the regulatory acts – for periodic financial statements and reports on the degree of implementation of policies and programs of PBSUs developing program budgets.',
                            'finance' => 'Budgets of the PBSUs',
                            'indicators' => 'Published reports.',
                        ],
                        [
                            'name' => 'Publication of information on tax expenditures (preferences) by the Ministry of Finance.',
                            'expect_result' => 'Budget transparency',
                            'institution' => 'Ministry of Finance',
                            'end_deadline' => '2012',
                            'finance' => 'Budget of the Ministry of Finance',
                            'indicators' => 'Implemented information system.',
                        ],
                        [
                            'name' => 'Publication of information on tax-audit acts issued by the National Revenue Agency after completed audits.',
                            'expect_result' => 'Ensuring publicity and transparency through informing the public while complying with legal requirements for protection of tax, social security, and other legally protected information.',
                            'institution' => 'Ministry of Finance<br>NRA',
                            'end_deadline' => 'Ongoing. After the 20th of the month following each quarter.',
                            'finance' => '',
                            'indicators' => 'Number of issued audit acts.<br>Average amount of additionally assessed liabilities per audit act.<br>Published information.',
                        ],
                        [
                            'name' => 'New National Strategy for the Development of the Mining Industry',
                            'expect_result' => 'Increased transparency of the policy for management of underground natural resources.',
                            'institution' => 'Ministry of Economy, Energy and Tourism',
                            'end_deadline' => '2012',
                            'finance' => 'Budget of the MEET',
                            'indicators' => 'Strategy approved by the Council of Ministers',
                        ],
                        [
                            'name' => 'New Law on Underground Resources',
                            'expect_result' => 'Introduction of new measures ensuring the application of best European and global practices in the management of underground resources.',
                            'institution' => 'Ministry of Economy, Energy and Tourism',
                            'end_deadline' => '2013',
                            'finance' => 'Budget of the MEET',
                            'indicators' => 'Draft Law on Underground Resources approved by the Council of Ministers',
                        ],
                        [
                            'name' => 'Public online information system on the location, mineral groups, and status of reserves/resources of underground natural resources with established deposits; specialized maps and registers of permits for exploration and concessions for extraction.',
                            'expect_result' => 'Encouraging citizens to use technologies;<br>Ensuring publicity and transparency through informing the public;<br>Guaranteeing citizens’ rights to receive official copies and extracts from the database.',
                            'institution' => 'Ministry of Economy, Energy and Tourism',
                            'end_deadline' => '2012',
                            'finance' => 'Budget of the MEET',
                            'indicators' => 'Available information system',
                        ],
                        [
                            'name' => 'Transparency in the management of underground resources through involvement of independent highly qualified experts in tender and competitive procedures for granting rights; acceptance of geological reports; and control of activities related to exploration and extraction.',
                            'expect_result' => 'Encouraging civic participation in governance;<br>Ensuring transparency in administrative activities;<br>Guaranteeing citizens’ rights to obtain official copies and extracts from the database.',
                            'institution' => 'Ministry of Economy, Energy and Tourism',
                            'end_deadline' => '2012',
                            'finance' => 'Budget of the MEET',
                            'indicators' => 'Practice incorporated into the National Strategy for Development of the Mining Industry, including measures for encouraging civic participation.<br>Normative introduction in the Law on Underground Resources.',
                        ],
                        [
                            'name' => 'Impact assessment of regulatory acts significantly affecting the business environment, including ex-post impact assessment, selected jointly with business.',
                            'expect_result' => 'Encouraging civic participation in governance;<br>Improving business environment with active participation of businesses.',
                            'institution' => 'All central government institutions',
                            'end_deadline' => 'Ongoing',
                            'finance' => 'Budgets of the institutions',
                            'indicators' => 'Prepared impact assessments',
                        ],
                        [
                            'name' => 'Accountability and transparency of healthcare providers through the development of a National Health Information System and ensuring citizen access via an electronic identifier. Quality of medical services will be subject to continuous institutional and public control.',
                            'expect_result' => 'Accountability and transparency of healthcare providers.<br>Improvement of healthcare services through innovative technologies for optimizing efficiency at all levels.',
                            'institution' => 'Ministry of Health and National Health Insurance Fund',
                            'end_deadline' => '2013',
                            'finance' => 'EU funds and state budget',
                            'indicators' => 'Developed National Health Information System;<br>Ensured citizen access via electronic identifier',
                        ],
                        [
                            'name' => 'Outsourcing activities from the state to business.<br>Analysis of practices in self-regulated sectors and identification of sectors where regulation may be transferred from the state to business.',
                            'expect_result' => 'Encouraging civic participation in governance;<br>Increasing business responsibility',
                            'institution' => 'Ministry of Economy, Energy and Tourism',
                            'end_deadline' => '2013',
                            'finance' => 'Budget of the MEET',
                            'indicators' => 'Prepared legislative changes<br>Number of analyses carried out',
                        ],
                        [
                            'name' => 'Improving consultation practices with business through active dialogue during policy formation and implementation.',
                            'expect_result' => 'Encouraging civic participation in governance; Increasing business responsibility through its involvement in policy development. Public feedback.',
                            'institution' => 'All central government institutions',
                            'end_deadline' => 'Ongoing',
                            'finance' => 'Budgets of the institutions',
                            'indicators' => 'Held meetings, working groups, completed public consultations, etc.',
                        ],
                        [
                            'name' => 'Increasing public awareness of the principles of corporate social responsibility (CSR)',
                            'expect_result' => 'Formation of a society-specific CSR context',
                            'institution' => 'MEET<br>MLSP',
                            'end_deadline' => '2012–2013',
                            'finance' => 'Institutional budgets',
                            'indicators' => 'Number of organized seminars, conferences',
                        ],
                        [
                            'name' => 'Legislative measures to encourage socially responsible investments, production, and management in SMEs',
                            'expect_result' => 'Prerequisite for sustainable growth',
                            'institution' => 'MEET',
                            'end_deadline' => '2012–2013',
                            'finance' => 'Budget of the institution',
                            'indicators' => 'Number of legislative changes with preferences for enterprises',
                        ],
                        [
                            'name' => 'Initiation of an annual ranking for enterprises with the most responsible corporate behaviour; Criteria: socially engaged investments, achieved energy and resource savings, number of jobs, contribution to municipal development.',
                            'expect_result' => 'Creating incentives for CSR in enterprises',
                            'institution' => 'MEET and MLSP in partnership with NAMRB',
                            'end_deadline' => '2013',
                            'finance' => 'Institutional budgets',
                            'indicators' => 'Number of nominated companies;<br>Types of media coverage and publicity',
                        ],
                        [
                            'name' => 'Encouraging compliance with environmental legislation – an important factor for the competitiveness of production enterprises.',
                            'expect_result' => 'Involving more companies in environmentally responsible production',
                            'institution' => 'MEET<br>MLSP in partnership with NAMRB',
                            'end_deadline' => '2013',
                            'finance' => 'Institutional budgets',
                            'indicators' => 'Established adequate incentives for companies',
                        ],
                        [
                            'name' => 'Organizing discussion forums at national and local level to promote CSR opportunities among a broad range of businesses and to present CSR best practices.',
                            'expect_result' => 'Encouraging civic participation in governance;<br>Involving more companies in CSR initiatives',
                            'institution' => 'Ministry of Labour and Social Policy',
                            'end_deadline' => '2012',
                            'finance' => 'Budget of the MLSP',
                            'indicators' => 'Organized forums',
                        ],
                        [
                            'name' => 'Integrating environmental prevention instruments into corporate policies by increasing business awareness, including regarding environmental management systems ISO 14001, EMAS, and the EU Ecolabel scheme',
                            'expect_result' => 'Encouraging civic participation in governance;<br>Involving more companies in environmental protection initiatives',
                            'institution' => 'All institutions',
                            'end_deadline' => '2013',
                            'finance' => 'Institutional budgets',
                            'indicators' => 'Information events',
                        ],
                        [
                            'name' => 'Improving the Unified Portal for access to electronic administrative services and upgrading it with the functions of the Single Point of Contact.',
                            'expect_result' => '<ul>
                                 <li>Promoting e-government and increasing public and business trust;</li>
                                 <li>Implementation of the Services Directive;</li>
                                 <li>Training of selected target groups within the administration;</li>
                                 <li>Improved e-government portal providing information through various communication channels.</li>
                            </ul>',
                            'institution' => 'MTITS',
                            'end_deadline' => '2013',
                            'finance' => 'OPAC project',
                            'indicators' => '<ul>
                             <li>Improved portal on the centralized platform;</li>
                             <li>Number of implemented electronic administrative services.</li>
                         </ul>',
                        ],
                        [
                            'name' => 'Updating the content of the interoperability registers (Register of Registers and Data – RRD, Register of Electronic Services – RES, Register of Information Objects – RIO, Register of Standards, List of Accredited Entities, and List of Certified Systems and Products) of e-government.',
                            'expect_result' => '<ul>
                                <li>Reducing administrative costs for information exchange and system interaction;</li>
                                <li>Creating conditions for more effective public administration;</li>
                                <li>Improving central e-government systems;</li>
                                <li>Improving processes for delivering electronic administrative services;</li>
                                <li>Enhancing interoperability and enabling European-level integration.</li>
                             </ul>',
                            'institution' => 'MTITS',
                            'end_deadline' => '2013',
                            'finance' => 'OPAC project',
                            'indicators' => '<ul>
                              <li>Built platform for creation, storage, archiving and management of electronic documents, data, and content in administration;</li>
                              <li>Developed monitoring and management system for OSIS.</li>
                         </ul>',
                        ],
                        [
                            'name' => 'Ensuring operational support for the Unified Portal for access to electronic administrative services.',
                            'expect_result' => '',
                            'institution' => 'MTITS',
                            'end_deadline' => '2013',
                            'finance' => 'OPAC project',
                            'indicators' => 'Developed centralized system for monitoring and managing information security and interoperability.',
                        ],
                        [
                            'name' => 'Ensuring operational support for the Interoperability Registers (RRD, RES, RIO, Register of standards, List of accredited entities, List of certified systems and products).',
                            'expect_result' => '',
                            'institution' => 'MTITS',
                            'end_deadline' => '2013',
                            'finance' => 'OPAC project',
                            'indicators' => 'Registered primary and composite e-services in the e-government registers.',
                        ],
                        [
                            'name' => 'Development of the Administrative Information System of the Cadastre (KAIS)',
                            'expect_result' => '<ul>
                                <li>Provision of electronic and composite administrative services by the Agency for Geodesy, Cartography and Cadastre (AGCC) through software compliant with the Electronic Governance Act;</li>
                                <li>Development of internal rules for document flow management and an electronic system for complaints, suggestions, and signals;</li>
                                <li>Optimization and accessibility of services for visually impaired users;</li>
                                <li>Optimization and access for foreign-language users through online transliteration.</li>
                           </ul>',
                            'institution' => 'Agency for Geodesy, Cartography and Cadastre',
                            'end_deadline' => '2013',
                            'finance' => 'OPAC project',
                            'indicators' => 'Developed and implemented Information System for electronic and composite services from AGCC',
                        ],
                        [
                            'name' => 'Development of a National Health Information System, electronic health record, electronic prescription, electronic referral, etc.',
                            'expect_result' => 'Development of e-health;<br>Improvement of quality, control, and transparency in the provision of health services',
                            'institution' => 'Ministry of Health and National Health Insurance Fund',
                            'end_deadline' => '2013',
                            'finance' => 'EU funds and state budget',
                            'indicators' => 'Developed National Health Information System, electronic health record, e-prescription, e-referral and other e-health services',
                        ],
                        [
                            'name' => 'Ensuring citizen access to the system through an electronic identifier, which may also be used for access to electronic health services',
                            'expect_result' => 'Development of e-health<br>Access to all electronic services for citizens',
                            'institution' => 'MTITS',
                            'end_deadline' => '2013',
                            'finance' => 'OPAC project',
                            'indicators' => 'Created unified electronic identifier enabling citizens to access e-services, including e-health services',
                        ],
                        [
                            'name' => 'Development of the Council of Ministers’ website to expand the scope of information accessible to citizens, set good practices for openness and transparency, and create standards for information resources used in the CM administration.',
                            'expect_result' => 'Ensuring publicity and transparency through information',
                            'institution' => 'Council of Ministers Administration',
                            'end_deadline' => '2012',
                            'finance' => 'Budget of the CM',
                            'indicators' => 'Improved CM website',
                        ],
                        [
                            'name' => 'Publicity of the rules governing the secondary budget-spending units of the CM, as well as their financial results and performance reports.',
                            'expect_result' => 'Improved accountability and budget transparency, clearer responsibility for resources used and results achieved.',
                            'institution' => 'Council of Ministers Administration',
                            'end_deadline' => 'According to the deadlines in regulations – for periodic financial statements and program implementation reports',
                            'finance' => 'Budget of the CM',
                            'indicators' => 'Improved CM website',
                        ],
                        [
                            'name' => 'Control over compliance with legal requirements for publicity and information, and publication of results from inspections on the CM website',
                            'expect_result' => 'Increased publicity and citizen awareness',
                            'institution' => 'Council of Ministers Administration',
                            'end_deadline' => 'Ongoing',
                            'finance' => '',
                            'indicators' => 'Number of inspections conducted and publications of results',
                        ],
                        [
                            'name' => 'Improvement and publicity of the Public Consultation Portal (www.strategy.bg) for broader use',
                            'expect_result' => 'Ensuring publicity and transparency through information',
                            'institution' => 'Council of Ministers Administration',
                            'end_deadline' => '2012',
                            'finance' => '',
                            'indicators' => 'Improved Public Consultation Portal',
                        ],
                        [
                            'name' => 'Expanding public use of the information system for management and monitoring of EU Structural and Cohesion Funds.',
                            'expect_result' => 'Expanding possibilities for re-use of system data, including in file formats allowing easy machine processing.',
                            'institution' => 'Council of Ministers Administration',
                            'end_deadline' => '2013',
                            'finance' => '',
                            'indicators' => 'Expanded volume of publicly available information on indicator achievement under projects and operational programs',
                        ],
                        [
                            'name' => 'Drafting amendments to the Access to Public Information Act to create unified parameters/standards for preparing and publishing up-to-date information from public administrations',
                            'expect_result' => 'Improved publicity and transparency through information',
                            'institution' => 'Ministry of Justice, relevant institutions, CM Administration, in partnership with NGOs',
                            'end_deadline' => 'First half of 2013',
                            'finance' => '',
                            'indicators' => 'Draft amendments to the Access to Public Information Act approved by the CM',
                        ]
                    ),
                )
            ),
            self::SECOND->value => array(
                'files' => array(
                    'bg' => array(
                        [
                            'path' => 'old_ogp_plan/2/Втори-план-ПОУ-финал-одобрен-МС.pdf',
                            'name' => 'Втори план за действие на Република България по инициативата “Партньорство за открито управление” (БГ)',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
//                        [
//                            'path' => 'old_ogp_plan/2/ОБОБЩЕНИ_КОМЕНТАРИ_ОТ_НПО_СЕКТОРА_И_ГРАЖДАНСКОТО_ОБЩЕСТВО_ПО_ПРОЕКТ_НА_ВТОРИ_ПЛАН_ЗА_ДЕЙСТВИЕ_ПОУ.pdf',
//                            'name' => 'Обобщени коментари/предложения от неправителствения сектор и гражданското общество по проекта на Втори план за действие по инициативата „Партньорство за открито управление“, получени в процеса на неговото обсъждане',
//                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
//                        ],
//                        [
//                            'path' => 'old_ogp_plan/2/Proposals_BCNP.pdf',
//                            'name' => 'Предложения на Българския център за нестопанско право',
//                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
//                        ],
//                        [
//                            'path' => 'old_ogp_plan/2/Proposals_FO.bg.pdf',
//                            'name' => 'Предложения на Фондация "Общество.бг"',
//                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
//                        ],
//                        [
//                            'path' => 'old_ogp_plan/2/Proposals_Boyan_Yurukov.pdf',
//                            'name' => 'Предложения на Боян Юруков',
//                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
//                        ],
//                        [
//                            'path' => 'old_ogp_plan/2/Proposals_PDOI.pdf',
//                            'name' => 'Предложения на Програма за достъп до информация',
//                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
//                        ],
                        [
                            'path' => 'old_ogp_plan/2/15RH503.pdf',
                            'name' => 'Нови ангажименти в рамките на Втория план за действие на Република България за участие в Инициативата „Партньорство за открито управление“',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                    'en' => array(
                        [
                            'path' => '/old_ogp_plan/1/OGP-second-plan-Bulgaria-final-Revised-July-8-2015-1.pdf',
                            'name' => 'Second Action Plan of the Republic of Bulgaria under the Open Government Partnership Initiative',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                        [
                            'path' => 'old_ogp_plan/2/NAP2_New_Commitments_EN_Final.pdf',
                            'name' => 'New commitments within the framework of the Second Action Plan of the Republic of Bulgaria for participation in the Open Government Partnership Initiative',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    )
                ),
                'evaluations' => array(
                    'bg' => array(
                        [
                            'path' => 'old_ogp_plan/2/Interim_Self-Assessment_Report_BG.pdf',
                            'name' => 'Government report',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                        [
                            'path' => 'old_ogp_plan/2/Bulgaria_EoT_2014-2016_BUL.pdf',
                            'name' => 'Independent researcher\'s report',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                    'en' => array(
                        [
                            'path' => 'old_ogp_plan/2/Bulgarian self-assesment Report 2nd Action Plan.pdf',
                            'name' => 'Government report',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                        [
                            'path' => 'old_ogp_plan/2/IRM Report - Bulgaria 2nd Action Plan.pdf',
                            'name' => 'Independent researcher\'s report',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                ),
                'content' => array(
                    'bg' => array(
                        [
                            'title' => 'Въведение',
                            'content' => 'България се присъедини към Инициативата „Партньорство за открито управление“ през
                            2012 г. С участието си в инициативата българското правителство желаеше и продължава да
                            желае да играе активна роля за изграждане на общество, основано на повече прозрачност в
                            управлението, гражданско участие, отговорност, отчетност и технологично обновление.
                            Участието на България в инициативата се разглежда като ефективен инструмент за
                            сътрудничество и обмен на добри практики със страни, имащи признати постижения в
                            областта на откритото управление.<br>
                            В началния етап на своето участие в инициативата България реши да насочи усилията си за
                            постигане на по-ефективно управление на публичните ресурси и за повишаване на
                            корпоративната отговорност. Страната постигна добри резултати особено по отношение на
                            публичността и по-високото ниво на отчетност на публичните власти. Публикуването на
                            информация за различни аспекти от дейността на администрацията, както и консултирането
                            на проекти на нормативни актове и стратегически документи вече е задължение на
                            публичните власти, но по-важно – превръща се все повече в осъзната необходимост, която
                            гарантира по-добри резултати при прилагането на политики. Някои от ангажиментите,
                            включени в първия план за действие ще залегнат и в плана за действие за периода 2013-
                            2015 г., защото носят полезност за обществото.<br>
                            Друг кръг от въпроси, включени в първия план за действие на България по Инициативата
                            „Партньорство за открито управление“, по-специално онези, които се отнасят до
                            насърчаването на корпоративната социална отговорност, се оказаха теми със сравнително
                            ограничен ефект, най-вече поради слабата информираност в обществото за ползите от този
                            подход и от факта, че водещата страна в процеса има бизнеса и в по-малка степен
                            правителството.<br>
                            В рамките на диалога с неправителствените организации по изработване на втория план за
                            действие към инициативата „Партньорство за открито управление“ се очертаха няколко
                            направления, в посока, на които да се насочат усилията на правителството за утвърждаване
                            на принципите на откритото управление. На преден план излизат нови предизвикателства.
                            Това са сфери, които до момента не са били достатъчно добре засегнати, но които все повече
                            са във фокуса на общественото внимание. Сред този кръг от нови приоритетни въпроси е и
                            въпросът за отворените данни.<br>
                            Независимо че това е сравнително нова тема за България, осъзната е потребността да се
                            отговори на поставения от активните неправителствени организации въпрос за
                            насърчаването на принципа на отворените данни в управлението. Правителството желае да
                            се превърне в активен участник и да даде тласък на предоставянето на отворени данни от
                            страна на институциите. Безспорен е потенциала на отварянето на данни за генерирането на
                            нови бизнес възможности. Заложените в плана мерки в областта на отворените данни са
                            малко на брой, но представляват първата необходима стъпка за въвеждане на идеята за
                            отворените данни в управлението, като инструмент за постигане на важните принципи на
                            откритото управление за прозрачност и гражданско участие.'
                        ],
                        [
                            'title' => 'Положени усилия в рамките на инициативата „Партньорство за открито управление“ до момента',
                            'content' => 'Република България официално се присъедини към инициативата през месец април 2012 г.
                            С протоколно решение на 11 април 2012 г., Министерският съвет одобри Първия план за
                            действие във връзка с присъединяването на Република България към Глобалната инициатива
                            “Партньорство за открито управление”. Със същото протоколно решение е възложено на
                            секретаря на Съвета за развитие при Министерския съвет да представи Оперативен план за
                            изпълнение на поетите ангажименти в Плана за действие, приет с Решение на Министерския
                            съвет на 29 юни 2012 г.<br>
                            Първият план е разработен съвместно с неправителствени организации и обхваща периода
                            до месец декември 2013 г. Мерките, за изпълнение на поетите ангажименти, във връзка с
                            присъединяването на Република България към Глобалната инициатива “Партньорство за
                            открито управление”, са в приоритетните направления:
                             По-ефективно управление на публичните средства/ресурси;
                             Повишаване на фирмената отчетност и отговорност.
                            Цялостната координация и комуникация по изпълнение на Плана за действие се
                            осъществява интерактивно на портала за обществени консултации в раздел „Партньорство за
                            открито управление“: http://www.strategy.bg.<br>
                            В изпълнение на ангажимента за постигане на по-висока бюджетна прозрачност през
                            изминалата една година са приети два нови стратегически документа и пакет от изменения и
                            допълнения в бюджетното законодателство. Всички актове са съгласувани с
                            неправителствения сектор и с гражданите. Усъвършенстваната нормативна рамка създава
                            необходимите условия за прозрачно, устойчиво и по-ефективно управление на публичните
                            средства. В отговор на очакването на гражданите за прозрачност и достъпност на
                            информацията институциите редовно публикуват на интернет страниците си актуални данни
                            за разходите си.<br>
                            Правителството предприе законодателни промени за въвеждане на задължителна оценка на
                            въздействието на нормативните актове. Тази стъпка създава условия за по-високо ниво на
                            отговорност и прозрачност в работата на институциите и администрацията при изготвянето
                            на нормативните актове.<br>
                            Подготвените бяха изменения и допълнение в Закона за обществените поръчки, с което се
                            цели пълна прозрачност и контрол при провеждането и изпълнението на поръчките и
                            улесняване достъпа на малките и средни предприятия до пазара на обществените поръчки.
                            Въвеждането на електронно правителство е приоритет в държавното управление. През
                            изминалата една година се изпълнява пакет от проекти, които ще дадат тласък на
                            електронното правителство. Особено внимание се отделя на електронното здравеопазване,
                            като през април 2013 г. стартира въвеждането на електронно пациентско досие. В процес на
                            въвеждане е и система за по-добро съгласуване и интегриране по цялата верига на здравните
                            услуги и обмен на здравни данни.<br>
                            Министерството на икономиката и енергетиката инициира създаването на нова Стратегия за
                            развитие на минната индустрия и нов Закон за подземните богатства, с които ще се
                            гарантира прозрачност на управлението на подземните богатства. Проектите са обект на
                            широка дискусия между правителството, браншовите организации, неправителствения
                            сектор и гражданите във формат „работни групи“ и он-лайн консултации.
                            Диалогът между институциите, социалните партньори, неправителствения сектор и
                            гражданските движения е приоритет в работата на правителството. Във втората половина на
                            2013 г. е възстановена активната работа на Националния съвет за тристранно
                            сътрудничество – орган за консултации и дебат между правителството, работодателите и
                            синдикатите. Към всяко министерство функционира Обществен съвет, ръководен от
                            съответния министър. В състава на тези съвети участват браншови организации,
                            неправителствените организации и граждански сдружения. Над 50 работни групи (adHoc), с
                            активно участие на бизнеса и гражданите работят по актуални проблеми.
                            Независим експерт, съгласно Независимия механизъм за оценка, прилаган на Инициативата
                            изготви преглед на изпълнението на мерките, предвидени в първия план за действие на
                            страната и направи препоръки за включване на ангажименти във Втория план за действие.
                            Оценката за изпълнението на първия план за действие показва, че България е изпълнила
                            почти всички поети ангажименти. За някои от ангажиментите е направена препоръка за
                            мониторинг върху прилагането им или тяхното надграждане във Втория план за действие
                            (например Стратегията за управление на държавния дълг, Стратегията за гражданските
                            организации в Република България, Законът за подземните богатства, промени в Закона за
                            достъпа до обществена информация).<br>
                            С Протоколно решение от заседанието на Министерския съвет на 27 ноември 2013 г. беше
                            одобрен Доклада за самооценка по Плана за действие във връзка с присъединяването на
                            Република България към Глобалната инициатива за партньорство за открито управление.
                            Правителството възложи на министъра на регионалното развитие да отговаря за
                            координацията и участието на Република България в „Партньорството за открито
                            управление“.<br>
                            Правителството ще продължи да работи за преодоляване на предизвикателствата, свързани
                            с: подобряване на партньорството между администрацията и гражданското общество,
                            подобряване на административните услуги и законодателната рамка и отвореност на
                            администрацията, чрез подобряване на достъпа до информация и данни.
                            В новия план ще бъдат надградени мерки, започнати през първия план за действие и в
                            съответствие с препоръките от Доклада на независимия механизъм за оценка за България
                            2012-2013 (Independent Reporting Mechanism Progress Report, Bulgaria 2012-2013) . Ще се
                            изпълняват мерки, насочени към усъвършенстване на процеса на участие на гражданското
                            общество в процеса на формиране на политики. Ще продължат инициативите за по-добра
                            бюджетна прозрачност и предоставяне на финансова информация на достъпен за
                            обществото език. Ще продължи работата в сферата на по-доброто управление на природните
                            ресурси; ще улесни достъпа до обществена информация и ще се усъвършенства анализа на
                            въздействието на нормативните актове върху малкия и среден бизнес, което ще доведе до
                            намаляване на административната тежест върху малкия и среден бизнес и ще стимулира
                            икономическия растеж.'
                        ],
                        [
                            'title' => 'Процес на разработка на разработване на национален план за действие',
                            'content' => 'Под ръководството на министъра на регионалното развитие е сформирана
                            междуведомствена работна група за подготовката на Втория план за действие на Република
                            България по участие в инициативата „Партньорство за открито управление.
                            На сайта за обществени консултации www.strategy.bg в специалната му секция
                            „Партньорство за открито управление“ беше дадена възможност за изпращане на
                            предложения от неправителствения сектор и гражданското общество за ангажименти, които
                            да залегнат във Втория план за действие. Предложения можеха да се дискутират и в он-лайн
                            дискусионния панел за инициативата за партньорство за открито управление на
                            www.strategy.bg. Бяха проведени срещи на междуведомствената работна група, която
                            включва представители на администрацията за обсъждане на Втория план за действие и
                            постъпилите предложения от гражданското общество. Бяха организирани и съвместни
                            срещи на представителите на междуведомствената работна група с представители на
                            бизнеса, неправителствения сектор, гражданското общество и местните власти. Проектът на
                            план е поместен и на сайта за обществени консултации www.strategy.bg. Там са публикувани
                            и получените предложения за ангажименти от неправителствения сектор в процеса на
                            подготовка на Плана. Определено е контактно лице от Министерство на регионалното
                            развитие, което осъществява връзка с неправителствения сектор по време на подготовка на
                            документа.<br>
                            Мерките от втория план за действие са разработени в съответствие с предложения на
                            неправителствени и граждански организации в Република България, представителите на
                            държавната администрация и препоръките в доклада за България, съгласно Независимия
                            механизъм за оценка, както и насоките, дадени по време на регионалната среща за Европа на
                            страните, участнички в инициативата „Партньорство за открито управление“, проведена
                            през месец май 2014 г. в гр. Дъблин, Ирландия.'
                        ]
                    ),
                    'en' => array(
                        [
                            'title' => 'Introduction',
                            'content' => 'Bulgaria joined the “Open Government Partnership” initiative in 2012. By participating
        in the initiative, the Bulgarian government wished—and continues to wish—to play an active
        role in building a society based on greater transparency in governance, citizen participation,
        responsibility, accountability, and technological innovation. Bulgaria’s participation in the
        initiative is viewed as an effective tool for cooperation and exchange of good practices with
        countries that have recognized achievements in the field of open government.<br>
        In the initial stage of its participation in the initiative, Bulgaria decided to direct its efforts toward
        achieving more effective management of public resources and increasing corporate
        responsibility. The country achieved good results, especially in terms of publicity and a higher
        level of accountability of public authorities. The publication of information on various aspects
        of administrative activities, as well as the public consultation of draft legislation and strategic
        documents, has already become an obligation for public authorities—but more importantly, it
        is increasingly becoming a recognized necessity that ensures better policy implementation
        outcomes. Some of the commitments included in the first action plan will also be incorporated
        into the 2013–2015 action plan because they provide ongoing value for society.<br>
        Another set of topics included in Bulgaria’s first action plan under the “Open Government
        Partnership” initiative—particularly those related to promoting corporate social
        responsibility—turned out to have relatively limited impact, mostly due to weak public
        awareness of the benefits of this approach and the fact that the business sector, rather than the
        government, plays the leading role in the process.<br>
        During the dialogue with NGOs in preparing the second action plan for the “Open Government
        Partnership” initiative, several directions emerged in which the government should focus its
        efforts to uphold the principles of open government. New challenges have come to the
        forefront—areas that had not been sufficiently addressed until now but are increasingly in the
        public spotlight. Among this new set of priority issues is the topic of open data.<br>
        Although this is a relatively new topic for Bulgaria, there is a clear understanding of the need to
        respond to the call from active NGOs to promote the principle of open data in governance.
        The government aims to become an active participant and give momentum to the provision of
        open data by institutions. The potential of open data to generate new business opportunities is
        undeniable. The measures included in the plan in the field of open data are few in number, but
        they represent the first necessary step in introducing the concept of open data into governance
        as a tool for achieving the key principles of open government—transparency and citizen
        participation.'
                        ],
                        [
                            'title' => 'Efforts undertaken within the “Open Government Partnership” initiative so far',
                            'content' => 'The Republic of Bulgaria officially joined the initiative in April 2012. By protocol
        decision of 11 April 2012, the Council of Ministers approved the First Action Plan related to
        Bulgaria’s accession to the Global “Open Government Partnership” initiative. The same
        decision tasked the Secretary of the Development Council at the Council of Ministers with
        presenting an Operational Plan for implementing the commitments in the Action Plan, adopted
        by the Council of Ministers on 29 June 2012.<br>
        The first plan was developed jointly with NGOs and covered the period until December 2013.
        The measures for fulfilling the commitments made upon Bulgaria’s accession to the Global “Open
        Government Partnership” initiative fall into the following priority areas:
        – More effective management of public funds/resources;
        – Increasing corporate accountability and responsibility.
        Overall coordination and communication on the implementation of the Action Plan is carried
        out interactively on the public consultation portal in the “Open Government Partnership”
        section: http://www.strategy.bg.<br>
        To meet the commitment of achieving higher budget transparency, two new strategic
        documents and a package of amendments to budget legislation were adopted over the past
        year. All acts were coordinated with the NGO sector and citizens. The improved regulatory
        framework provides the necessary conditions for transparent, sustainable, and more effective
        management of public funds. In response to public expectations for transparency and access to
        information, institutions regularly publish up-to-date data on their spending on their websites.<br>
        The government undertook legislative changes to introduce mandatory impact assessments for
        legislation. This step creates conditions for higher levels of responsibility and transparency in
        the work of institutions and the administration when drafting legislation.<br>
        Amendments to the Public Procurement Act were prepared with the aim of full transparency
        and control in the conduct and execution of procurement procedures and to facilitate access for
        small and medium-sized enterprises to the public procurement market.
        Implementing e-government is a priority in state governance. Over the past year, a package of
        projects has been implemented that will give new momentum to e-government. Special
        attention has been given to e-healthcare, with the introduction of the electronic patient record
        beginning in April 2013. A system for better coordination and integration of services across the
        entire healthcare chain and for the exchange of health data is also being introduced.<br>
        The Ministry of Economy and Energy initiated the development of a new Strategy for the
        Development of the Mining Industry and a new Underground Resources Act to ensure the
        transparent management of underground resources. These projects are subject to broad
        discussion between the government, industry associations, NGOs, and citizens through working
        groups and online consultations.
        Dialogue between institutions, social partners, NGOs, and civic movements is a priority for the
        government. In the second half of 2013, the active work of the National Council for
        Tripartite Cooperation—an advisory and debate forum between the government, employers,
        and trade unions—was restored. Each ministry also has a Public Council chaired by the
        respective minister, with participation from industry associations, NGOs, and civic groups. More
        than 50 ad-hoc working groups with active participation from business and citizens work on
        current issues.
        An independent expert, under the Independent Reporting Mechanism, prepared a review of the
        implementation of the measures in Bulgaria’s first action plan and made recommendations for
        commitments to be included in the Second Action Plan. The assessment shows that Bulgaria
        fulfilled almost all commitments. For some commitments, recommendations were made for
        monitoring or further development in the Second Action Plan (such as the Debt Management
        Strategy, the Strategy for Civil Organizations, the Underground Resources Act, and amendments
        to the Access to Public Information Act).<br>
        By protocol decision of 27 November 2013, the Council of Ministers approved the
        self-assessment report on the Action Plan for Bulgaria’s participation in the Global “Open
        Government Partnership” initiative. The government assigned the Minister of Regional
        Development to be responsible for coordination and participation in the initiative.<br>
        The government will continue working to address challenges related to improving cooperation
        between the administration and civil society, enhancing administrative services and the legal
        framework, and increasing the openness of the administration through improved access to
        information and data.
        The new plan will build on measures begun under the first action plan and in accordance with
        recommendations from the Independent Reporting Mechanism Progress Report, Bulgaria
        2012–2013. Measures will continue to improve citizen participation in policymaking, budget
        transparency, the provision of accessible financial information, improved management of
        natural resources, better access to public information, and improved regulatory impact analysis
        on SMEs, reducing administrative burden and fostering economic growth.'
                        ],
                        [
                            'title' => 'Process for developing the national action plan',
                            'content' => 'Under the leadership of the Minister of Regional Development, an inter-agency working
        group was formed to prepare Bulgaria’s Second Action Plan under the “Open Government
        Partnership” initiative.
        On the public consultation website www.strategy.bg, in its special “Open Government
        Partnership” section, the opportunity was provided for NGOs and civil society to submit
        proposals for commitments to be included in the Second Action Plan. Proposals could also be
        discussed in the online discussion panel for the initiative on www.strategy.bg. Meetings of the
        inter-agency working group were held to discuss the Second Action Plan and the proposals
        received from civil society. Joint meetings between the inter-agency group, businesses, NGOs,
        civil society, and local authorities were also organized. The draft plan is published on the public
        consultation website. The proposals submitted by NGOs during preparation are also available
        there. A contact person from the Ministry of Regional Development was appointed to liaise with
        the NGO sector during the preparation of the document.<br>
        The measures in the second action plan were developed based on proposals from NGOs and
        civil society, representatives of public administration, recommendations from the Independent
        Reporting Mechanism assessment for Bulgaria, as well as the guidance provided during the
        regional meeting for Europe among OGP countries held in May 2014 in Dublin, Ireland.'
                        ]
                    ),
                ),
                'ogDescription' => array(
                    'bg' => 'България се присъедини към Инициативата „Партньорство за открито управление“ през 2012 г. С участието си в инициативата българското правителство желаеше и продължава да желае да играе активна роля за изграждане на общество',
                    'en' => 'Bulgaria joined the Open Government Partnership Initiative in 2012. By participating in the initiative, the Bulgarian government wanted and continues to want to play an active role in building a society',
                ),
                'arrangements' => array(
                    'bg' => array(
                        [
                            'name' => 'Тясно партньорство между администрацията и гражданското общество',
                            'leading_institution' => 'Водеща институция за цялостното изпълнение на ангажимента: Администрация на Министерския съвет. За изпълнение на отделните мерки:
                                <br>Мярка 1: Министерство на правосъдието и Администрация на Министерския съвет
                                <br>Мярка 2: Администрация на Министерския съвет и централна администрация
                                <br>Мярка 3: Министерство на правосъдието, Администрация на Министерския съвет',
                            'other_person' => 'Да',
                            'problem_question' => 'Ниска степен на ангажираност и участие на гражданското общество в процеса на вземане на решения',
                            'base_goal' => 'Усъвършенстване на процеса на участие на гражданите и гражданските организации в изработването на нормативни актове; Подобряване партньорството между администрацията, гражданското общество и бизнеса чрез механизма за провеждане на обществени съвети, функциониращи към отделните институции и гарантиране на повече публичност и прозрачност.',
                            'challenge' => 'Засилване на обществения морал',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Промени в Закона за нормативните актове: пропорционално адаптиране на минималния задължителен срок от 14 до 30 дни за провеждане на обществени консултации по проекти на нормативни документи, според значимостта на проблема и засегнатите страни и в съответствие с добрите европейски практики; подобрена прозрачност и процедура по обсъждане на проекти за нормативни актове.',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => 'Юли 2014 г.',
                                    'to_date' => '2016 г.',
                                ],
                                [
                                    'name' => 'Подобрена процедура за участие на граждани и граждански организации в обществените консултации:
                                        <ul>
                                            <li>Публикуване на он-лайн информация за: състав на съветите; покани, дневен ред, протоколи, информация за взети решения в рамките на заседанията и тяхното изпълнение; периодичен публичен отчет за дейността им. (информацията ще се публикува на портала на консултативните съвети – www.saveti.government.bg).</li>
                                            <li>Изработване на ясни правила, процедури и критерии за избор/определяне на представители на гражданските организации в консултативни и обществени съвети</li>
                                        </ul>',
                                    'exist' => 'Продължаване на съществуващ ангажимент',
                                    'from_date' => 'Юли 2014 г.',
                                    'to_date' => '2016 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Подобряване на обществените услуги и законодателната рамка<br>По-добра бюджетна прозрачност
                                    <ul>
                                        <li>Откритост, прозрачност и отчетност на процесите по управление на държавния дълг</li>
                                        <li>Повишаване на достъпността, разбираемостта и възприемането на публикуваната от Министерството на финансите информация за обществеността</li>
                                    </ul>',
                            'leading_institution' => 'Министерство на финансите',
                            'other_person' => 'Да',
                            'problem_question' => 'Ангажиментът гарантира на обществото информираност по отношение на важни аспекти, свързани с дълговата проблематика и дава възможност за осигуряване на публичност и предвидимост на провежданите политики в тази област',
                            'base_goal' => 'Синтезиране на основните насоки на дълговата политика в средносрочен времеви интервал в контекста на провеждането на ефективно управление на суверенните задължения, както и предоставяне на детайлна информация в различен разрез за състоянието и динамиката на държавния дълг',
                            'challenge' => 'Подобряване на обществените услуги<br>По-ефективно управление на публичните средства',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Изпълнение на Стратегията за управление на държавния дълг 2012- 2014 г. ',
                                    'exist' => 'Съществуващ',
                                    'from_date' => 'Януари 2012 г.',
                                    'to_date' => 'Декември 2014 г.',
                                ],
                                [
                                    'name' => 'Разработване, одобрение от Министерски съвет и изпълнение на Стратегия за управление на държавния дълг 2015-2017 г.',
                                    'exist' => 'Съществуващ',
                                    'from_date' => 'Декември 2014 г.',
                                    'to_date' => 'Декември 2017 г.',
                                ],
                                [
                                    'name' => 'Публикуване на интернет страницата на Министерство на финансите на бюлетин „Държавен дълг“',
                                    'exist' => 'Съществуващ',
                                    'from_date' => 'Ежемесечно',
                                    'to_date' => '',
                                ],
                                [
                                    'name' => 'Публикуване на интернет страницата на Министерството на финансите на Годишен обзор за състоянието на държавния дълг',
                                    'exist' => 'Съществуващ',
                                    'from_date' => 'Ежегодно',
                                    'to_date' => '',
                                ],
                                [
                                    'name' => 'Публикуване на официалната информация за консолидирания дълг и гаранциите на сектор „Държавно управление“ на интернет страницата на Министерство на финансите',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => 'От 1 януари 2014 г.',
                                    'to_date' => 'На всеки три месеца/ежегодно',
                                ],
                            )
                        ],
                        [
                            'name' => 'Подобряване на обществените услуги и законодателната рамка<br>По-добра бюджетна прозрачност
                                    <ul>
                                        <li>Откритост, прозрачност и отчетност на процесите по управление на държавния дълг</li>
                                        <li>Повишаване на достъпността, разбираемостта и възприемането на публикуваната от Министерството на финансите информация за обществеността</li>
                                    </ul>',
                            'leading_institution' => 'Министерство на финансите',
                            'other_person' => 'Да',
                            'problem_question' => 'Публикуваната от Министерство на финансите информация е разбираема за ограничен брой тясно специализирани потребители',
                            'base_goal' => 'Предоставяне на публикуваната от Министерство на финансите във вид, достъпен за по-широк кръг от потребители',
                            'challenge' => 'Подобряване на обществените услуги<br>По-ефективно управление на публичните средства',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Изследване сред потребителите на достъпността, разбираемостта и възприемането на публикуваната от Министерство на финансите информация за обществеността',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => 'Септември 2014 г.',
                                    'to_date' => 'Декември 2014 г.',
                                ],
                                [
                                    'name' => 'Разработване на концепция за повишаване на достъпността, разбираемостта и възприемането на публикуваната от Министерство на финансите информация за обществеността',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => 'Януари 2015 г.',
                                    'to_date' => 'Май 2015 г.',
                                ],
                                [
                                    'name' => 'Изпълнение на мерките от концепцията за повишаване на достъпността, разбираемостта и възприемането на публикуваната от Министерство на финансите информация за обществеността',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => 'Юни 2015 г.',
                                    'to_date' => 'Януари 2016 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Подобряване на обществените услуги и законодателната рамка<br>По-добро управление на природните ресурси',
                            'leading_institution' => 'Министерство на икономиката и енергетиката',
                            'other_person' => 'Да',
                            'problem_question' => 'Необходимост от увеличаване на общественото доверие при управлението на природните богатства, подобряване на социалната отговорност и предотвратяване на социални конфликти, чрез по-голяма прозрачност и обществен контрол.',
                            'base_goal' => 'Осигуряване на прозрачност при провеждане на контрола по разрешения за търсене и проучване или за проучване и по предоставени концесии за добив на подземни богатства и осигуряване на публичност на резултатите',
                            'challenge' => 'Подобряване на обществените услуги',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Приет Закон за изменение и допълнение на Закона за подземните богатства',
                                    'exist' => 'Съществуващ ангажимент',
                                    'from_date' => '2012 г.',
                                    'to_date' => '2014 г.',
                                ],
                                [
                                    'name' => 'Приета Наредба за обхвата и реда за извършване и приемане на резултатите от контрола по предоставени разрешения за търсене и проучване или за проучване и по предоставени концесии за добив на подземни богатства',
                                    'exist' => 'Съществуващ ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => '2015 г.',
                                ]
                            )
                        ],
                        [
                            'name' => 'Подобряване на обществените услуги и законодателната рамка<br>По-добра оценка на въздействието на нормативните актове – въвеждане на МСП тест',
                            'leading_institution' => 'Министерство на икономиката и енергетиката,<br>Администрация на Министерския съвет',
                            'other_person' => 'Да',
                            'problem_question' => 'Липса на достатъчен анализ на въздействието на нормативните актове върху дейността на малкия и среден бизнес в България, които представлява 99% от общия брой предприятия в страната',
                            'base_goal' => 'Анализ на въздействието на нормативните актове върху МСП, намаляване на административната тежест върху малкия и среден бизнес',
                            'challenge' => 'Подобряване на обществените услуги',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Закон за изменение и допълнение на нормативните актове, който да въведе задължението за МСП тест',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => '2015 г.',
                                ],
                                [
                                    'name' => 'Проект на Методика за извършване на МСП-тест',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => '2015 г.',
                                ],
                                [
                                    'name' => 'Формуляр за МСП-тест',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => '2015 г.',
                                ]
                            )
                        ],
                        [
                            'name' => 'По-ефективно управление на публичните средства<br>Гражданско участие, откритост и прозрачност при разработването на проект на нов Закон за държавните такси',
                            'leading_institution' => 'Администрация на Министерския съвет',
                            'other_person' => 'Министерство на финансите и Министерство на икономиката и енергетиката, с участието на гражданското общество',
                            'problem_question' => 'Съществува необходимост от:
                                                <ul>
                                                    <li>Подобряване на ефективността и ефикасността на политиката по отношение на таксите</li>
                                                    <li>Осъществяване на ефективна координация в администрацията и на партньорство с бизнеса и неправителствения сектор по въпросите, свързани с политиката за таксите</li>
                                                    <li>Осигуряване на прозрачност и условия за мониторинг и контрол върху изпълнението на политиката за таксите</li>
                                                </ul>',
                            'base_goal' => 'Добро управление посредством нова политика за таксите, осигуряваща избягване на неоправдано финансово натоварване върху гражданите и бизнеса. Реализация на ефективна и ефикасна социално-икономическа политика посредством такси, определени на основата на изградена система от принципи и ясни правила.',
                            'challenge' => 'По-ефективно управление на публичните средства<br>Подобряване на обществените услуги',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Проект на Закон за държавните такси',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => 'Март 2013 г.',
                                    'to_date' => 'Септември 2014 г.',
                                ],
                                [
                                    'name' => 'Проект на Специализирана методика за оценка на въздействието при въвеждане или актуализиране на държавни такси',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => 'Март 2013 г.',
                                    'to_date' => 'Септември 2014 г.',
                                ],
                                [
                                    'name' => 'Проект на Методика за определяне размера на таксите',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => 'Март 2013 г.',
                                    'to_date' => 'Септември 2014 г.',
                                ],
                                [
                                    'name' => 'Проект на Единна тарифа за таксите',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => 'Март 2013 г.',
                                    'to_date' => 'Септември 2014 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Откритост на администрацията<br>Използване на отворените данни',
                            'leading_institution' => 'Администрация на Министерски съвет, Министерство на транспорта, информационните технологии и съобщенията, всички останали администрации',
                            'other_person' => 'Да',
                            'problem_question' => 'Темата за отворените данни е нова за повечето страни и правителства, включително и за България. Българската администрация полага целенасочени усилия за повишаване на отчетността и прозрачността при работата си, като използва възможностите на новите технологии. В следващите години в съответствие с политиката на ЕС са необходими допълнителни усилия за въвеждане на отворените данни в администрацията. В този процес след за което ще бъдат направени съответните постъпки.',
                            'base_goal' => 'Въвеждане на принципите на отворените данни в работата на администрацията и започване на инициативи за прилагане на отворените данни в диалог с неправителствения сектор, бизнеса и гражданското общество.',
                            'challenge' => 'Подобряване на обществените услуги <br>Засилване на обществения морал',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Изменение и допълнение на Закона за достъп до обществената информация.
                                                <br>Промените ще целят:
                                                <br>Повишаване на откритостта на
                                                администрацията и улесняване достъпа до
                                                обществена информация чрез:
                                                <ul>
                                                    <li>Разширяване и детайлизиране на задълженията за публикуване на информация;</li>
                                                    <li>Засилване на координацията и контрола по изпълнението на закона;</li>
                                                    <li>Транспониране на Директива 2013/37/EC за изменение на Директива 2003/98/ЕО относно повторната употреба на информацията в обществения сектор – предвидени промени и бъдещи действия</li>
                                                </ul>',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => 'Юли 2015 г.',
                                ],
                                [
                                    'name' => 'Изготвяне на технически насоки за предоставяне на публична информация, притежавана от институциите в отворен формат',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => '2015 г.',
                                ],
                                [
                                    'name' => 'Приоритизиране на информацията в отворен формат (регистри, отчети и др.) – доклад за приоритизирани регистри, отчети, статистически данни и др., които могат да бъдат предоставени в отворен формат',
                                    'exist' => 'Нов ангажимент ',
                                    'from_date' => '2015 г.',
                                    'to_date' => '2015 г.',
                                ],
                                [
                                    'name' => 'Започване на процедура за присъединяване към Конвенцията за достъпа до официални документи на Съвета на Европа',
                                    'exist' => 'Нов ангажимент',
                                    'from_date' => '2014 г.',
                                    'to_date' => '2016 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Усъвършенствана система за управление на риска от възникване на конфликт на интереси',
                            'leading_institution' => 'Министерството на правосъдието, Министерския съвет (МС)',
                            'other_person' => 'Да',
                            'problem_question' => 'Настоящата система предвижда сравнително тесен кръг от лица, които са задължени да подават декларации за конфликт на интереси и имущество, както и недостатъчен обем информация, събиран чрез декларациите. Липсва последователна практика за проверка на декларираните данни',
                            'base_goal' => 'По-висока степен на превенция на възникване на конфликт на интереси',
                            'challenge' => 'Засилване на обществения морал',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Въвеждане на нова структура за обработка на декларациите за конфликт на интереси и на имущество, която включва следните основни нови принципи и елементи:
                                                <ul>
                                                    <li>Пълна електронизация на обработката на двата вида декларации;</li>
                                                    <li>Обхващане чрез електронни декларации на държавните служители от централната власт и териториалната администрация;</li>
                                                    <li>Разширяване на обема информация, събирана чрез декларациите, с цел подобряване на анализа на риска и разкриване на корупционни деяния;</li>
                                                    <li>Възлагане на отговорности по събиране и първоначална обработка на декларациите на инспекторатите и на областната администрация;</li>
                                                    <li>Правомощия за одит и проверка на декларациите на висшите държавни длъжности, както и разширени правомощия за данъчни и банкови тайни;</li>
                                                    <li>Възлагане на одитиране на декларациите с установен риск на НАП - за държавните служители</li>
                                                </ul>',
                                    'exist' => 'Да',
                                    'from_date' => '01.12.2015 г.',
                                    'to_date' => '31.12.2016 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Въвеждане на концепция и практика на съдилища, ориентирани къмрешаване на конкретни проблеми в България',
                            'leading_institution' => 'Министерството на правосъдието',
                            'other_person' => 'Да',
                            'problem_question' => 'Българският съд оставя усещането за „технократско“, по „буквата на закона“ правораздаване. Независимо, че последиците от съдебното решение излизат извън пределите на съда, той не е интегриран с другите местни публични институции, от които зависи ефективната защита на уязвимите социални групи и преодоляването на социалното неравенство – здравеопазване, социална работа, публичен ред, образование, култура и др. Липсват умения у съдиите за адекватно третиране на представители на различни уязвими социални групи (например: деца, наркозависими, лица, страдащи от душевни заболявания, и др.), участващи в съдебния процес или, ако са налице такива умения, то те са интуитивно развити',
                            'base_goal' => 'Необходимост от осъзнаване на разбирането за съда като организация в определен социален контекст. Това важи особено силно за първоинстанционните съдилища',
                            'challenge' => 'Подобряване на обществените услуги',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Изработване на методология за работа на съдии с лица от уязвими социални групи, основана на емперични проучвания и знания, предоставени от американски експерти/съдии по модела на т.нар. „съдилища, ориентирани към решаването на проблеми“ (problem-solving courts). Конкретни измерими индикатори могат да бъдат:
                                                <ul>
                                                    <li>Брой участващи експерти;</li>
                                                    <li>Брой участващи съдии;</li>
                                                    <li>Налична методология;</li>
                                                    <li></li>
                                                    <li></li>
                                                    <li></li>
                                                </ul>',
                                    'exist' => 'Да',
                                    'from_date' => '01.06.2015 г.',
                                    'to_date' => '31.12. 2016 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Въвеждане на система за провеждане на електронни обществени поръчки',
                            'leading_institution' => 'Министерството на икономиката',
                            'other_person' => 'Да, МТИТС, Министерството на финансите, Министерството на здравеопазването, МС, ЕСМИС, НСОРБ и др.',
                            'problem_question' => 'Настоящата система за провеждане на обществени поръчки носи риск от злоупотреби поради все още силния субективен елемент, недостатъчна прозрачност и липса на стандартизирани работни процеси при осъществяване на определени етапи от процедурите',
                            'base_goal' => 'Улеснен достъп и намалени бюрократични изисквания и разходи за участие в процедури за обществени поръчки за бизнеса и създаване на възможност за ефективен публичен контрол с цел избягване на злоупотреби',
                            'challenge' => 'Подобряване на обществените услуги<br>По-ефективно управление на публичните средства',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Промени в Закона за обществените поръчки, регламентиращи провеждане на процедури по възлагане на обществени поръчки по електронен път',
                                    'exist' => 'Нов',
                                    'from_date' => '01.03.2015 г.',
                                    'to_date' => '01.03.2016 г.',
                                ],
                                [
                                    'name' => 'Въвеждане на Единен национален портал за електронни обществени поръчки, поетапно въвеждане на различните стадии от процеса на електронно възлагане
                                    <br>Въвеждане на модул за електронно обявяване',
                                    'exist' => '',
                                    'from_date' => '01.01.2016 г. ',
                                    'to_date' => '31.12.2016 г.',
                                ]
                            )
                        ],
                        [
                            'name' => 'Подобряване на ползваемостта на публикуваните данни от системата за електронни бюджетни разплащания (СЕБРА)',
                            'leading_institution' => 'Министерството на финансите, МС',
                            'other_person' => 'Да',
                            'problem_question' => 'Публикуваните в момента данни са в разнороден формат и представят твърде обобщена картина на плащанията, което представлява бариера за ползването им от по-широк кръг потребители, тъй като изисква допълнителна експертиза и ресурс за вторична обработка',
                            'base_goal' => 'Постигане на по-високо равнище на фискална прозрачност и отчетност',
                            'challenge' => 'Засилване на обществения морал<br>По-ефективно управление на публичните средства',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Въвеждане на единен формат на публикуване на данните от различните ведомства и единна точка за сваляне на данните',
                                    'exist' => 'Нов в рамките на инициативата ',
                                    'from_date' => '01.06.2015 г.',
                                    'to_date' => '31.12.2015 г.',
                                ],
                            )
                        ],
                        [
                            'name' => 'Подобряване на последващия контрол върху дейността по възлагане и изпълнение на договори за обществени поръчки и въвеждане на унифицирана последователна практика за контрол и отчетност',
                            'leading_institution' => 'Министерство на финансите, АДФИ',
                            'other_person' => 'Да',
                            'problem_question' => 'Твърде разнородна практика на последващ контрол и липса на последователно усилие за анализ на установените нарушения с оглед на очертаване на зони на висок риск и адресиране на повтарящи се нарушения',
                            'base_goal' => 'Подобряване на последващия контрол върху дейността по възлагане и изпълнение на договори за обществени поръчки и въвеждане на унифицирана последователна практика за контрол и отчетност',
                            'challenge' => 'Подобряване на обществения морал<br>По-ефективно управление на публичните средства',
                            'progress' => [
                                'Прозрачност' => 'Да',
                                'Отговорност (отчетност) ' => 'Да',
                                'Обществено участие' => 'Да'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Разработване на ръководство за унифициране на последващия контрол (избягване припокриването на проверките и еднакво третиране на нарушенията от контролните органи)',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => '01.06.2015 г.',
                                    'to_date' => '31.12. 2015 г.',
                                ],
                                [
                                    'name' => 'Анализ на установените нарушения (включително конфликт на интереси) във връзка с възлагането на обществени поръчки и наложените санкции в тази връзка',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => '01.06.2015 г.',
                                    'to_date' => '31.12.2015 г.',
                                ],
                                [
                                    'name' => 'Въвеждане на индикатори и система за периодично отчитане на нарушенията в практиката по наложените административни наказания',
                                    'exist' => 'Нов в рамките на инициативата',
                                    'from_date' => 'юли 2014 г.',
                                    'to_date' => 'декември 2016 г.',
                                ]
                            )
                        ],
                    ),
                    'en' => array(
                        [
                            'name' => 'Close partnership between the administration and civil society',
                            'leading_institution' => 'Leading institution for the overall implementation of the commitment: Council of Ministers Administration. For the implementation of the individual measures:
        <br>Measure 1: Ministry of Justice and Council of Ministers Administration
        <br>Measure 2: Council of Ministers Administration and central administration
        <br>Measure 3: Ministry of Justice, Council of Ministers Administration',
                            'other_person' => 'Yes',
                            'problem_question' => 'Low level of engagement and participation of civil society in the decision-making process',
                            'base_goal' => 'Improvement of the process of participation of citizens and civil organizations in drafting normative acts; Improving the partnership between the administration, civil society, and business through the mechanism of public councils functioning within individual institutions, and ensuring greater publicity and transparency.',
                            'challenge' => 'Strengthening public morality',
                            'progress' => [
                                'Transparency' => 'Yes',
                                'Accountability ' => 'Yes',
                                'Public participation' => 'Yes'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Amendments to the Law on Normative Acts: proportionate adaptation of the minimum mandatory period from 14 to 30 days for conducting public consultations on draft normative documents, depending on the importance of the issue and the stakeholders involved, and in accordance with good European practices; improved transparency and procedure for discussing draft normative acts.',
                                    'exist' => 'New commitment',
                                    'from_date' => 'July 2014',
                                    'to_date' => '2016',
                                ],
                                [
                                    'name' => 'Improved procedure for the participation of citizens and civil organizations in public consultations:
                <ul>
                    <li>Publishing online information about: the composition of the councils; invitations, agendas, minutes, information on decisions taken during meetings and their implementation; periodic public reports on their activities. (the information will be published on the portal of the consultative councils – www.saveti.government.bg).</li>
                    <li>Development of clear rules, procedures, and criteria for the selection/appointment of representatives of civil organizations to consultative and public councils</li>
                </ul>',
                                    'exist' => 'Continuation of an existing commitment',
                                    'from_date' => 'July 2014',
                                    'to_date' => '2016',
                                ],
                            )
                        ],
                        [
                            'name' => 'Improvement of public services and legislative framework<br>Better budget transparency
            <ul>
                <li>Openness, transparency, and accountability in the management of public debt</li>
                <li>Increasing the accessibility, clarity, and understanding of information published by the Ministry of Finance for the public</li>
            </ul>',
                            'leading_institution' => 'Ministry of Finance',
                            'other_person' => 'Yes',
                            'problem_question' => 'The commitment ensures that the public is informed on important aspects related to debt issues and allows for ensuring publicity and predictability of policies implemented in this area',
                            'base_goal' => 'Synthesizing the main directions of debt policy over a medium-term period in the context of effective management of sovereign obligations, as well as providing detailed information in various breakdowns on the state and dynamics of public debt',
                            'challenge' => 'Improvement of public services<br>More effective management of public funds',
                            'progress' => [
                                'Transparency' => 'Yes',
                                'Accountability ' => 'Yes',
                                'Public participation' => 'Yes'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Implementation of the Public Debt Management Strategy 2012-2014',
                                    'exist' => 'Existing',
                                    'from_date' => 'January 2012',
                                    'to_date' => 'December 2014',
                                ],
                                [
                                    'name' => 'Development, approval by the Council of Ministers, and implementation of the Public Debt Management Strategy 2015-2017',
                                    'exist' => 'Existing',
                                    'from_date' => 'December 2014',
                                    'to_date' => 'December 2017',
                                ],
                                [
                                    'name' => 'Publishing the "Public Debt" bulletin on the Ministry of Finance website',
                                    'exist' => 'Existing',
                                    'from_date' => 'Monthly',
                                    'to_date' => '',
                                ],
                                [
                                    'name' => 'Publishing the Annual Overview of the state of public debt on the Ministry of Finance website',
                                    'exist' => 'Existing',
                                    'from_date' => 'Annually',
                                    'to_date' => '',
                                ],
                                [
                                    'name' => 'Publishing official information on the consolidated debt and guarantees of the "Public Administration" sector on the Ministry of Finance website',
                                    'exist' => 'New commitment',
                                    'from_date' => 'From January 1, 2014',
                                    'to_date' => 'Every three months/annually',
                                ],
                            )
                        ],
                        [
                            'name' => 'Improvement of public services and legislative framework<br>Better budget transparency
            <ul>
                <li>Openness, transparency, and accountability in the management of public debt</li>
                <li>Increasing the accessibility, clarity, and understanding of information published by the Ministry of Finance for the public</li>
            </ul>',
                            'leading_institution' => 'Ministry of Finance',
                            'other_person' => 'Yes',
                            'problem_question' => 'The information published by the Ministry of Finance is understandable to only a limited number of narrowly specialized users',
                            'base_goal' => 'Providing the information published by the Ministry of Finance in a form accessible to a broader group of users',
                            'challenge' => 'Improvement of public services<br>More effective management of public funds',
                            'progress' => [
                                'Transparency' => 'Yes',
                                'Accountability ' => 'Yes',
                                'Public participation' => 'Yes'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Survey among users on the accessibility, clarity, and understanding of information published by the Ministry of Finance for the public',
                                    'exist' => 'New commitment',
                                    'from_date' => 'September 2014',
                                    'to_date' => 'December 2014',
                                ],
                                [
                                    'name' => 'Development of a concept to improve accessibility, clarity, and understanding of information published by the Ministry of Finance for the public',
                                    'exist' => 'New commitment',
                                    'from_date' => 'January 2015',
                                    'to_date' => 'May 2015',
                                ],
                                [
                                    'name' => 'Implementation of measures from the concept to improve accessibility, clarity, and understanding of information published by the Ministry of Finance for the public',
                                    'exist' => 'New commitment',
                                    'from_date' => 'June 2015',
                                    'to_date' => 'January 2016',
                                ],
                            )
                        ],
                        [
                            'name' => 'Improvement of public services and legislative framework<br>Better management of natural resources',
                            'leading_institution' => 'Ministry of Economy and Energy',
                            'other_person' => 'Yes',
                            'problem_question' => 'There is a need to increase public trust in the management of natural resources, improve social responsibility, and prevent social conflicts through greater transparency and public oversight.',
                            'base_goal' => 'Ensuring transparency in the control of licenses for exploration and research, or for research and granted concessions for extraction of mineral resources, and ensuring public access to the results.',
                            'challenge' => 'Improvement of public services',
                            'progress' => [
                                'Transparency' => 'Yes',
                                'Accountability ' => 'Yes',
                                'Public participation' => 'Yes'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Adopted Law amending and supplementing the Mineral Resources Act',
                                    'exist' => 'Existing commitment',
                                    'from_date' => '2012',
                                    'to_date' => '2014',
                                ],
                                [
                                    'name' => 'Adopted Regulation on the scope and procedure for carrying out and accepting the results of control over granted licenses for exploration and research, or for research and granted concessions for extraction of mineral resources',
                                    'exist' => 'Existing commitment',
                                    'from_date' => '2014',
                                    'to_date' => '2015',
                                ]
                            )
                        ],
                        [
                            'name' => 'Improvement of public services and legislative framework<br>Better assessment of the impact of regulations – introduction of SME test',
                            'leading_institution' => 'Ministry of Economy and Energy,<br>Administration of the Council of Ministers',
                            'other_person' => 'Yes',
                            'problem_question' => 'Lack of sufficient analysis of the impact of regulations on the activities of small and medium-sized enterprises (SMEs) in Bulgaria, which represent 99% of all businesses in the country',
                            'base_goal' => 'Analysis of the impact of regulations on SMEs, reducing the administrative burden on small and medium-sized businesses',
                            'challenge' => 'Improvement of public services',
                            'progress' => [
                                'Transparency' => 'Yes',
                                'Accountability ' => 'Yes',
                                'Public participation' => 'Yes'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Law amending and supplementing regulations, which introduces the obligation to apply the SME test',
                                    'exist' => 'New commitment',
                                    'from_date' => '2014',
                                    'to_date' => '2015',
                                ],
                                [
                                    'name' => 'Draft Methodology for conducting the SME test',
                                    'exist' => 'New commitment',
                                    'from_date' => '2014',
                                    'to_date' => '2015',
                                ],
                                [
                                    'name' => 'SME test form',
                                    'exist' => 'New commitment',
                                    'from_date' => '2014',
                                    'to_date' => '2015',
                                ]
                            )
                        ],
                        [
                            'name' => 'More efficient public fund management<br>Civic participation, openness, and transparency in the development of a draft new Law on State Fees',
                            'leading_institution' => 'Administration of the Council of Ministers',
                            'other_person' => 'Ministry of Finance and Ministry of Economy and Energy, with the participation of civil society',
                            'problem_question' => 'There is a need to:
        <ul>
            <li>Improve the effectiveness and efficiency of the policy regarding fees</li>
            <li>Ensure effective coordination within the administration and partnership with businesses and the non-governmental sector on matters related to fee policy</li>
            <li>Ensure transparency and provide conditions for monitoring and control over the implementation of fee policy</li>
        </ul>',
                            'base_goal' => 'Good governance through a new fee policy, ensuring avoidance of unjustified financial burden on citizens and businesses. Implementation of an effective and efficient socio-economic policy through fees determined based on an established system of principles and clear rules.',
                            'challenge' => 'More efficient public fund management<br>Improvement of public services',
                            'progress' => [
                                'Transparency' => 'Yes',
                                'Accountability ' => 'Yes',
                                'Public participation' => 'Yes'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Draft Law on State Fees',
                                    'exist' => 'New within the initiative',
                                    'from_date' => 'March 2013',
                                    'to_date' => 'September 2014',
                                ],
                                [
                                    'name' => 'Draft Specialized Methodology for Impact Assessment when introducing or updating state fees',
                                    'exist' => 'New within the initiative',
                                    'from_date' => 'March 2013',
                                    'to_date' => 'September 2014',
                                ],
                                [
                                    'name' => 'Draft Methodology for determining the amount of fees',
                                    'exist' => 'New within the initiative',
                                    'from_date' => 'March 2013',
                                    'to_date' => 'September 2014',
                                ],
                                [
                                    'name' => 'Draft Unified Fee Tariff',
                                    'exist' => 'New within the initiative',
                                    'from_date' => 'March 2013',
                                    'to_date' => 'September 2014',
                                ],
                            )
                        ],
                        [
                            'name' => 'Administrative openness<br>Use of open data',
                            'leading_institution' => 'Administration of the Council of Ministers, Ministry of Transport, Information Technology and Communications, all other administrations',
                            'other_person' => 'Yes',
                            'problem_question' => 'The topic of open data is new for most countries and governments, including Bulgaria. The Bulgarian administration is making targeted efforts to increase accountability and transparency in its work by using the opportunities offered by new technologies. In the coming years, in line with EU policy, additional efforts are needed to introduce open data into administration. In this process, the appropriate steps will be taken.',
                            'base_goal' => 'Introduce the principles of open data in the work of the administration and start initiatives for applying open data in dialogue with the non-governmental sector, business, and civil society.',
                            'challenge' => 'Improvement of public services <br>Strengthening public ethics',
                            'progress' => [
                                'Transparency' => 'Yes',
                                'Accountability ' => 'Yes',
                                'Public participation' => 'Yes'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Amendment and supplementation of the Access to Public Information Act.
                        <br>The changes aim to:
                        <br>Increase administrative openness and facilitate access to public information through:
                        <ul>
                            <li>Expansion and detailing of obligations to publish information;</li>
                            <li>Strengthening coordination and control over the implementation of the law;</li>
                            <li>Transposition of Directive 2013/37/EC amending Directive 2003/98/EC on the re-use of public sector information – planned changes and future actions</li>
                        </ul>',
                                    'exist' => 'New commitment',
                                    'from_date' => '2014',
                                    'to_date' => 'July 2015',
                                ],
                                [
                                    'name' => 'Development of technical guidelines for providing public information held by institutions in open format',
                                    'exist' => 'New commitment',
                                    'from_date' => '2014',
                                    'to_date' => '2015',
                                ],
                                [
                                    'name' => 'Prioritization of information in open format (registers, reports, etc.) – report on prioritized registers, reports, statistical data, etc., that can be provided in open format',
                                    'exist' => 'New commitment',
                                    'from_date' => '2015',
                                    'to_date' => '2015',
                                ],
                                [
                                    'name' => 'Initiate procedure to join the Council of Europe Convention on Access to Official Documents',
                                    'exist' => 'New commitment',
                                    'from_date' => '2014',
                                    'to_date' => '2016',
                                ],
                            )
                        ],
                        [
                            'name' => 'Enhanced system for managing the risk of conflicts of interest',
                            'leading_institution' => 'Ministry of Justice, Council of Ministers (CoM)',
                            'other_person' => 'Yes',
                            'problem_question' => 'The current system covers a relatively narrow group of individuals required to submit conflict of interest and asset declarations, and the amount of information collected through these declarations is insufficient. There is no consistent practice for verifying the declared data.',
                            'base_goal' => 'Higher level of prevention of conflicts of interest',
                            'challenge' => 'Strengthening public ethics',
                            'progress' => [
                                'Transparency' => 'Yes',
                                'Accountability ' => 'Yes',
                                'Public participation' => 'Yes'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Introduction of a new structure for processing conflict of interest and asset declarations, which includes the following main new principles and elements:
                        <ul>
                            <li>Full digitalization of processing both types of declarations;</li>
                            <li>Coverage of civil servants from central and territorial administration through electronic declarations;</li>
                            <li>Expansion of the information collected through declarations to improve risk analysis and detect corrupt activities;</li>
                            <li>Assignment of responsibilities for collection and initial processing of declarations to inspectorates and regional administration;</li>
                            <li>Audit and verification powers for declarations of senior state positions, as well as extended powers regarding tax and banking secrecy;</li>
                            <li>Assignment of auditing declarations with identified risk to the National Revenue Agency (NRA) for civil servants</li>
                        </ul>',
                                    'exist' => 'Yes',
                                    'from_date' => '01.12.2015',
                                    'to_date' => '31.12.2016',
                                ],
                            )
                        ],
                        [
                            'name' => 'Introduction of the concept and practice of problem-solving courts in Bulgaria',
                            'leading_institution' => 'Ministry of Justice',
                            'other_person' => 'Yes',
                            'problem_question' => 'The Bulgarian court system gives the impression of "technocratic," strictly "letter-of-the-law" adjudication. Although the consequences of judicial decisions extend beyond the court, it is not integrated with other local public institutions essential for the effective protection of vulnerable social groups and the reduction of social inequality – such as healthcare, social services, public order, education, culture, etc. Judges often lack the skills to adequately address representatives of various vulnerable social groups (e.g., children, drug addicts, people with mental health issues, etc.) involved in judicial proceedings, or if such skills exist, they are developed only intuitively.',
                            'base_goal' => 'The need to develop an understanding of the court as an organization within a specific social context. This is especially important for first-instance courts.',
                            'challenge' => 'Improving public services',
                            'progress' => [
                                'Transparency' => 'Yes',
                                'Accountability ' => 'Yes',
                                'Public participation' => 'Yes'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Development of a methodology for judges to work with individuals from vulnerable social groups, based on empirical research and knowledge provided by American experts/judges using the "problem-solving courts" model. Specific measurable indicators can include:
                        <ul>
                            <li>Number of participating experts;</li>
                            <li>Number of participating judges;</li>
                            <li>Availability of methodology;</li>
                            <li></li>
                            <li></li>
                            <li></li>
                        </ul>',
                                    'exist' => 'Yes',
                                    'from_date' => '01.06.2015',
                                    'to_date' => '31.12.2016',
                                ],
                            )
                        ],
                        [
                            'name' => 'Introduction of a system for conducting electronic public procurements',
                            'leading_institution' => 'Ministry of Economy',
                            'other_person' => 'Yes, Ministry of Transport, IT and Communications, Ministry of Finance, Ministry of Health, Council of Ministers, ESIMS, NSORB, etc.',
                            'problem_question' => 'The current system for public procurements carries a risk of abuses due to a still strong subjective element, insufficient transparency, and lack of standardized workflows in certain stages of the procedures.',
                            'base_goal' => 'Facilitated access and reduced bureaucratic requirements and costs for businesses participating in public procurement procedures, and creating opportunities for effective public oversight to prevent abuses.',
                            'challenge' => 'Improving public services<br>More efficient management of public funds',
                            'progress' => [
                                'Transparency' => 'Yes',
                                'Accountability ' => 'Yes',
                                'Public participation' => 'Yes'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Amendments to the Public Procurement Act regulating the conduct of public procurement procedures electronically',
                                    'exist' => 'New',
                                    'from_date' => '01.03.2015',
                                    'to_date' => '01.03.2016',
                                ],
                                [
                                    'name' => 'Introduction of a Unified National Portal for electronic public procurements, with phased implementation of different stages of the electronic procurement process
                    <br>Implementation of a module for electronic announcements',
                                    'exist' => '',
                                    'from_date' => '01.01.2016',
                                    'to_date' => '31.12.2016',
                                ]
                            )
                        ],
                        [
                            'name' => 'Improving the usability of data published from the Electronic Budget Payments System (SEBRA)',
                            'leading_institution' => 'Ministry of Finance, Council of Ministers',
                            'other_person' => 'Yes',
                            'problem_question' => 'Currently published data are in heterogeneous formats and provide an overly aggregated picture of payments, which creates a barrier for use by a wider range of users, as it requires additional expertise and resources for secondary processing.',
                            'base_goal' => 'Achieving a higher level of fiscal transparency and accountability',
                            'challenge' => 'Strengthening public ethics<br>More efficient management of public funds',
                            'progress' => [
                                'Transparency' => 'Yes',
                                'Accountability ' => 'Yes',
                                'Public participation' => 'Yes'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Introduction of a unified format for publishing data from different agencies and a single point for downloading the data',
                                    'exist' => 'New within the initiative',
                                    'from_date' => '01.06.2015',
                                    'to_date' => '31.12.2015',
                                ],
                            )
                        ],
                        [
                            'name' => 'Improving the follow-up control over the awarding and execution of public procurement contracts and introducing a unified consistent practice for control and accountability',
                            'leading_institution' => 'Ministry of Finance, ADFI',
                            'other_person' => 'Yes',
                            'problem_question' => 'The follow-up control practice is too heterogeneous, and there is a lack of consistent effort to analyze identified violations in order to outline high-risk areas and address recurring breaches.',
                            'base_goal' => 'Improving follow-up control over the awarding and execution of public procurement contracts and introducing a unified consistent practice for control and accountability',
                            'challenge' => 'Improving public ethics<br>More efficient management of public funds',
                            'progress' => [
                                'Transparency' => 'Yes',
                                'Accountability ' => 'Yes',
                                'Public participation' => 'Yes'
                            ],
                            'check_arrangements' => array(
                                [
                                    'name' => 'Development of a manual to unify follow-up control (avoiding overlapping inspections and ensuring uniform treatment of violations by oversight bodies)',
                                    'exist' => 'New within the initiative',
                                    'from_date' => '01.06.2015',
                                    'to_date' => '31.12.2015',
                                ],
                                [
                                    'name' => 'Analysis of identified violations (including conflicts of interest) related to public procurement and the sanctions imposed in this regard',
                                    'exist' => 'New within the initiative',
                                    'from_date' => '01.06.2015',
                                    'to_date' => '31.12.2015',
                                ],
                                [
                                    'name' => 'Introduction of indicators and a system for periodic reporting of violations in the practice of imposed administrative sanctions',
                                    'exist' => 'New within the initiative',
                                    'from_date' => 'July 2014',
                                    'to_date' => 'December 2016',
                                ]
                            )
                        ],
                    ),
                )
            ),
            self::THIRD->value => array(
                'files' => array(
                    'bg' => array(
                        [
                            'path' => '/old_ogp_plan/3/Трети_план_ПОУ-2.pdf',
                            'name' => 'Трети национален план за действие в рамките на инициативата „Партньорство за открито управление“ 1 юли 2016 – 30 юни 2018',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                    'en' => array(
                        [
                            'path' => '/old_ogp_plan/3/NAP3-Bulgaria_EN_0.pdf',
                            'name' => 'Third National Action Plan within the framework of the Open Government Partnership initiative 1 July 2016 – 30 June 2018',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    )
                ),
                'evaluations' => array(
                    'bg' => array(
                        [
                            'path' => 'old_ogp_plan/3/Доклад_за_самооценка_на_администрацията_БГ.pdf',
                            'name' => 'Отчет на правителството',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                        [
                            'path' => 'old_ogp_plan/3/Bulgaria_End-of-Term_Report_2016-2018_BUL.pdf',
                            'name' => 'Отчет на независимия изследовател',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                    'en' => array(
                        [
                            'path' => 'old_ogp_plan/3/Доклад_за_самооценка_на_администрацията_БГ.pdf',
                            'name' => 'Government report',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                        [
                            'path' => 'old_ogp_plan/3/Bulgaria_End-of-Term_Report_2016-2018_BUL.pdf',
                            'name' => 'Independent researcher\'s report',
                            'icon' => '<i class="fas fa-file-pdf text-danger me-1"></i>'
                        ],
                    ),
                ),
                'content' => array(
                    'bg' => '<p>Третият Национален план за действие в рамките на инициативата „Партньорство за открито управление“ 1 юли 2016 – 30 юни 2018 г. е приет с Решение № 570 на Министерския съвет от 11 юли 2016 г. Преди приемането на плана беше обявен график за неговата подготовка и беше проведена онлайн обществена консултация на Портала за обществена консултации.</p>',
                    'en' => '<p>The Third National Action Plan within the framework of the Open Government Partnership initiative July 1, 2016 - June 30, 2018 was adopted by Decision No. 570 of the Council of Ministers of July 11, 2016. Before the adoption of the plan, a schedule for its preparation was announced and an online public consultation was held on the Public Consultation Portal.</p>',
                ),
                'ogDescription' => array(
                    'bg' => 'Третият Национален план за действие в рамките на инициативата „Партньорство за открито управление“ 1 юли 2016 – 30 юни 2018 г. е приет с Решение № 570 на Министерския съвет от 11 юли 2016 г.',
                    'en' => 'The Third National Action Plan within the framework of the Open Government Partnership initiative July 1, 2016 - June 30, 2018 was adopted by Decision No. 570 of the Council of Ministers of July 11, 2016.',
                ),
                'arrangements' => array(
                    'bg' => array(
                        'Електронно управление' => array(
                            [
                                'commitment' => 'Българското правителство ще подобри достъпа и качеството на публичните услуги чрез внедряване на инструментите на електронно управление',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Усъвършенстване на съществуващите и въвеждане на нови електронни услуги от НАП',
                                        'Контекст' => 'В момента Националната агенция за приходите предлага най-много услуги в електронен вид в публичната администрация, но за някои услуги все още е необходимо посещение на място, което изисква ресурс от време и представлява административна тежест за данъкоплатците.',
                                        'Основна цел' => 'Разширяване на обхвата и качеството на предлаганите от НАП електронни услуги с оглед допълнително намаляване на бюрократичните пречки чрез ориентирани към клиента услуги и подобряване вътрешните бизнес процеси и процедури.',
                                        'Амбиция' => 'Опростяване на процедурите и подобряване на подходите, ориентирани към нуждите на данъкоплатците.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката Мярката отговаря на голямото предизвикателство на ПОУ за подобряване на ефективността на публичните услуги.',
                                        'Отговорна институция' => 'Национална агенция за приходите',
                                        'Други ангажирани публични институции' => 'Министерство на финансит',
                                        'Други ангажирани заинтересовани страни' => 'Сдружения на бизнеса, организации на работодатели',
                                        'Очаквано въздействие' => 'Улеснен и удобен достъп до услуги, предлагани от НАП; намалена административна тежест за гражданите и бизнеса; икономически ползи от спестено време и човешки ресурс за бизнеса и гражданите; подобрено управление на процесите в НАП и по- висока ефективност на приходната администрация.',
                                        'Срок на изпълнение' => 'постоянен',
                                    ],
                                    [
                                        'Наименование' => 'Разработване на секторна Стратегия за е-управление в МОСВ и Пътна карта към нея за периода 2016-2020 в съответствие със Стратегията за развитие на електронно управление в Република България 2014 – 2020 г.',
                                        'Контекст' => 'Днес управлението на околната среда в контекста на устойчивото развитие е изправено пред редица предизвикателства: борба с изменението на климата и адаптация към тези промени, необходимостта от по-ефективно използване на ресурсите, спиране на загубите на биологично разнообразие, формиране на модели на поведение на обществото, щадящи околната среда и др. Електронното управление на околната среда има съществена роля за по-доброто управление на тези процеси, за предоставянето на навременна и точна информация на обществото и неговото активно участие в решаването на предизвикателствата. ',
                                        'Основна цел' => 'Стратегията за е-околна среда и пътната карта към нея са насочени към развитие на целенасочено, достъпно, предвидимо, ефективно и ефикасно електронно управление в полза на обществото и околната среда.',
                                        'Амбиция' => 'Постигане на гъвкавост и ефективност на мерките за опазване на околната среда, съкращаване на сроковете за обработка на документи, удобен достъп и публичност на процедурите.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката отговаря на предизвикателствата, свързани със съвременното управление на природните ресурси, подобряване на публичните услуги и повишаване на интегритета на управлението. Електронизирането на процесите допринася за постигане на по-висока прозрачност на решенията и действията по опазване на околната среда, както и по-високо ниво на отчетност.',
                                        'Отговорна институция' => 'Министерство на околната среда и водите, Дирекция “Човешки ресурси, информационно обслужване, връзки с обществеността и протокол”',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Неправителствени организации, бизнес, местни общности',
                                        'Очаквано въздействие' => 'Kохерентност и последователност на усилието за въвеждане на електронно управление в областта на опазване на околната среда; предвидимост, проследимост и публичност на процеса и ясно разпределение на отговорности и срокове; усъвършенстване на вътрешните процедури и консолидация на разнородни източници на информация.',
                                        'Срок на изпълнение' => 'октомври 2016 г.',
                                    ],
                                    [
                                        'Наименование' => 'Внедряване на публичен електронен регистър на инсталациите, източници на летливи органични съединения с две електронни услуги – заявление за регистрация на инсталация и заявление за вписване на промяна на обстоятелствата на регистрирана инсталация',
                                        'Контекст' => 'Задължението за поддържане на публичен електронен регистър на инсталациите, източници на летливи органични съединения е надградено с възможността необходимите документи за регистрация и/или за промяна в обстоятелствата на регистрирана инсталация да бъдат предоставяни по електронен път.',
                                        'Основна цел' => 'Да се постигне качествено по-високо ниво на обслужване на бизнеса, да се подобри информираността на гражданите и да се повиши прозрачността по отношение на опазване на качеството на атмосферния въздух.',
                                        'Амбиция' => 'Постигане на модерно обслужване и осигуряване на прозрачност на процеса по осъществяване на контрол и спазване на регулациите, свързани с опазване чистотата на атмосферния въздух.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Подобряване на ефективността на публичните услуги и повишаване на интегритета на управлението. Усъвършенстване на достъпа до информация и възможностите за включване на граждани и техните организации в процесите на мониторинг и контрол на замърсяването на атмосферния въздух.',
                                        'Отговорна институция' => 'Изпълнителна агенция по околна среда, Регионалните инспекции по околна среда и води',
                                        'Други ангажирани публични институции' => 'Министерство на околната среда и водите',
                                        'Други ангажирани заинтересовани страни' => 'Оператори на инсталации, местни общности, граждански организации',
                                        'Очаквано въздействие' => 'Съкращаване на сроковете за обработка на документи; повишена гъвкавост и ефективност на вътрешните процедури; разширен достъп; открито, бързо и прозрачно взаимодействие със заинтересованите страни; услуги с фокус върху нуждите на потребителите, възможност за генериране на информация и данни и бързата им обработка.',
                                        'Срок на изпълнение' => 'юли 2016 г.',
                                    ],
                                    [
                                        'Наименование' => 'Внедряване на НИС за отпадъци с възможност за подаване на заявления, водене на отчетност и предоставяне на информация по електронен път',
                                        'Контекст' => 'Управлението на отпадъци е тема, която привлича традиционно обществен интерес и около която често възникват противоречия между местните общности, операторите на инсталации, представителите на местното самоуправление и на централната власт. Липсата на обобщена информация и възможност за достъп до информация по електронен път допълнително задълбочава конфликтите и затруднява конструктивния диалог и постигането на взаимноприемливи решения.',
                                        'Основна цел' => 'Използване на предимствата на технологиите за осигуряване на повече информация относно управлението на отпадъците, както и намаляване на административната тежест за бизнеса.',
                                        'Амбиция' => 'Създаване на система, която позволява навременно адресиране на потенциални проблеми и разширяване на обхвата информация, предоставяна на обществото.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката осигурява по- добри публични услуги и управление на публичен ресурс чрез електронизация на процесите на отчетност. Чрез нея се увеличават достъпната за обществото информация по отношение на управление на отпадъците и се подобряват механизмите за публична отчетност на дейностите на МОСВ във връзка с управление на отпадъци.',
                                        'Отговорна институция' => 'Изпълнителна агенция по околна среда',
                                        'Други ангажирани публични институции' => 'Министерство на околната среда и водите, Регионалните инспекции по околна среда и води',
                                        'Други ангажирани заинтересовани страни' => 'Граждански организации и местни общности, бизнес',
                                        'Очаквано въздействие' => 'Подобрен контрол на фирмите, ангажирани с управление на отпадъци; улеснена и удобна процедура за подаване на заявления; разширяване на обхвата на предоставяната по електронен път информация.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Изготвяне и внедряване на софтуерни приложения в областта на здравеопазването за обработка на информацията в реално време – в т.ч. електронно направление, електронни рецепти, и др.',
                                        'Контекст' => 'В момента в България почти не се предлагат електронни услуги в сферата на здравеопазването, което води до чувствително натоварване с административна работа на медицинските професионалисти, неудобства и забавяния за пациентите и затруднен контрол на разходването на публичен ресурс.',
                                        'Основна цел' => 'Опитимизиране и електронизиране на процесите в областта на здравеопазването с оглед повишаване качеството на здравните услуги и подобряване на контрола върху разходването на публичните средства за здраве ',
                                        'Амбиция' => 'Чувствително облекчаване на административната тежест за личните лекари и подобряване на обслужването за пациентите.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката цели подобряване на публичните услуги и съпътстващ по-ефективен контрол върху разходването на публичен ресурс. Прилагането на нови технологии намалява чувствително разходите по осъществяване на вътрешен и външен контрол върху ефективността на разходване на публичен ресурс за здраве.',
                                        'Отговорна институция' => 'Министерство на здравеопазванет',
                                        'Други ангажирани публични институции' => 'Национална здравна осигурителна каса',
                                        'Други ангажирани заинтересовани страни' => 'Организации на пациенти, Сдружение на общопрактикуващите лекари',
                                        'Очаквано въздействие' => 'Значително съкращаване на времето, необходимо за издаване на направление и рецепта; възможност за проследяване на направените прегледи по направление и изписаните лекарствени средства; възможност за по-прецизен анализ на движението на направления и по-добро планиране; улеснен достъп за пациентите.',
                                        'Срок на изпълнение' => 'декември 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Трансформиране на първична регистрация на ЮЛНЦ от съдебна в административна и централизиране на първичен регистър на ЮЛНЦ в АВ чрез цялостна електронизация на регистъра',
                                        'Контекст' => 'Гражданските организации в България доскоро подлежаха на различен режим на регистрация в сравнение с останалите юридически лица - съдебна, а не административна. Тази процедура отнемаше повече време и ресурс, а поддържаният регистър бе отделен, непълно дигитализиран и нередовно актуализиран.',
                                        'Основна цел' => 'Консолидиране на информацията за регистрираните граждански организации и значително улесняване на процедурата за регистрация. Достъпност на събираната информация и възможност за лесна проверка на обстоятелства.',
                                        'Амбиция' => 'Пълно електронизиране на регистъра към Агенция по вписванията и възможност НПО да получават електронните услуги, предлагани от Агенцията.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'По-добри публични услуги и опростяване на регистрационния режим като начин за насърчаване на самоорганизацията на гражданите. Промяната чувствително улеснява процедурите по регистрация на граждански сдружения, като спестява време и финансов ресурс и осигурява повече публичност на дейностите на НПО.',
                                        'Отговорна институция' => 'Агенция по вписвания',
                                        'Други ангажирани публични институции' => 'Министерство на правосъдието',
                                        'Други ангажирани заинтересовани страни' => 'Център за изследване на демокрацията',
                                        'Очаквано въздействие' => 'Опростена и ускорена процедура на регистрация и възможност за ползване на електронни услуги по регистрацията; достъпен и пълен регистър на НПО.',
                                        'Срок на изпълнение' => 'юни 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Изграждане на връзка на ИСУН с информационни масиви на НСИ',
                                        'Контекст' => 'Информационната система за управление на европейските фондове съдържа пълната информация във връзка с проектите и бенефициентите по оперативните програми, финансирани по ЕСИФ. Понастоящем са налице идентифицирани слабости и информационни празноти в областта на разработването, мониторирането и интегрирания подход на администрациите от различни нива при използването на статистическа информация за оценка на изпълнението на дейностите по европейски и национални стратегии и по оперативните програми, съфинансирани от Европейските структурни и инвестиционни фондове 2014-2020. ',
                                        'Основна цел' => 'Осигуряване на статистическа информация по програмните индикатори с оглед по-точна, базирана на данни оценка на изпълнението и ефективността на програмите, финансирани със средства от ЕС.',
                                        'Амбиция' => 'Навременна оценка на ефекта от програмите с оглед постигане на максимални ползи от изпълнените интервенции.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката е свързана с по-ефективното управление на публичен ресурс и осигурява по-детайлна информация относно работата на държавните органи в процеса на изготвяне и изпълнение на програми, финансирани по ЕСИФ.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет, Централно координационно звено',
                                        'Други ангажирани публични институции' => 'Национален статистически институт',
                                        'Други ангажирани заинтересовани страни' => 'Бенефициенти по оперативните програми',
                                        'Очаквано въздействие' => 'Генериране на подробно, статистически обосновани отчети на изпълнението; ясна и точна оценка на ефекта от изпълнение на програмите, финансирани с европейските фондове; възможност за по-прецизно насочване на средства; публичност на резултатите.',
                                        'Срок на изпълнение' => 'декември 2017 г',
                                    ],
                                    [
                                        'Наименование' => 'Надграждане на основните системи на Агенция “Митници” за предоставяне на данни и услуги към външни системи',
                                        'Контекст' => 'Агенция „Митници“ е една от първите администрации, която предоставя електронни услуги, основно предназначени за търговския сектор. Някои от съществуващите услуги на Агенция „Митници“ са изградени върху стари технологични платформи, които изискват актуализация с цел по-голяма достъпност и улеснения при ползването на услугите. Агенция „Митници“ има задължения по ново европейско законодателство, според което е необходимо да се хармонизират митническите дейности и съответно да се надградят системите.',
                                        'Основна цел' => 'Осигуряване на ползваемост и достъпност на услугите за граждани и бизнес.',
                                        'Амбиция' => 'Намаляване на административните пречки за бизнеса и гражданите. Безпроблемно интегриране на системата на Агенция „Митници“ с други, външни за агенцията софтуерни системи.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката ще допринесе за подобряване на публичните услуги и по-ефективно управление на публичния ресурс чрез повишен и автоматизиран вътрешен контрол.',
                                        'Отговорна институция' => 'Агенция “Митници”',
                                        'Други ангажирани публични институции' => 'Министерство на финансите',
                                        'Други ангажирани заинтересовани страни' => 'Частен секто',
                                        'Очаквано въздействие' => 'Свързване с централните европейски компоненти; стабилизиране на вътрешните компоненти; предоставяне на удобни електронни услуги за гражданите и бизнеса и реализиране на възможност за предоставяне на електронизирани административни услуги като вътрешно-административни услуги с оглед реализация на комплексно административно обслужване.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Реализиране на ЦАИС “Електронни обществени поръчки с всички модули до електронно оценяване, вкл. електронно подаване на оферта. ',
                                        'Контекст' => 'Провеждането на процедури за възлагане на обществени поръчки е тема, по която обществото в България има повишена чувствителност. Понастоящем процесът на възлагане на поръчки не е напълно автоматизиран и стандартизиран, което налага кандидатите да изготвят оферти на хартиен носител и да ги подават ръчно, да отчитат разнообразни изисквания на различните възложители за сходни предмети, което е неефективно, отнема време и ресурс, а същевременно затруднява работата на администрацията по обработката и оценката на офертите.',
                                        'Основна цел' => 'Опростяване начина на провеждане на процедурите, създаване на гаранции за обективен и прозрачен процес на оценка на оферти и възлагане на договори.',
                                        'Амбиция' => 'Въвеждане на изцяло електронен процес на възлагане на обществени поръчки',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Чрез електронизация и повишена прозрачност на процедурите по възлагане на обществени поръчки се подобряват публичните услуги, повишава се интегритетът на публичните институции, подобрява се бизнес средата и се постига ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Агенция по обществени поръчки',
                                        'Други ангажирани публични институции' => 'Министерство на финансите',
                                        'Други ангажирани заинтересовани страни' => 'Възложители и стопански субекти, участващи във възлагателния процес.',
                                        'Очаквано въздействие' => 'Електронизиране на етапите на възлагателния процес; подпомагане на възложителите с въвеждане на стандартизирани бизнес процеси и образци на документи; подобрен контрол на всеки етап от провеждане на процедурите; оптимизиране на процесите по водене на регистъра на обществени поръчки.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ]
                                )
                            ],
                        ),
                        'Достъп до информация' => array(
                            [
                                'commitment' => 'Българското правителство ще продължи да подобрява достъпа до информация чрез постоянно разширяване на обхвата на публикуваната обществена информация и широко електронизиране на процесите по предоставяне на информация',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Координация и подпомагане на процеса на преразглеждане на вътрешните правила за работа по ЗДОИ за съобразяване с измененията в ЗДОИ чрез ясни механизми и отговорности за активно публикуване и вътрешен контрол.',
                                        'Контекст' => 'Задължението на публичните институции да приемат и публикуват в интернет страниците си на вътрешни правила за работа по ЗДОИ съществува от 2008 г. По данни на доклада на Министерски съвет за състоянието на администрацията от 2015 г. 482 администрации от 576 имат приети такива правила. Промените в ЗДОИ от декември 2015 г. създадоха редица нови задължения за достъп до обществена информация, активното публикуване, предоставяне на информация по електронни заявления, предоставяне на информация за повторно ползване и др., които налагат преразглеждане на вътрешните правила и ясно определяне на отговорностите в администрацията, свързани с активното публикуване в Интернет, както и вътрешния контрол на тази дейност.',
                                        'Основна цел' => 'Стандартизиране и подобрена организация на процеса по предоставяне на обществена информация, както и подобрен контрол.',
                                        'Амбиция' => 'Прозрачен процес на предоставяне на информация и улесняване на гражданите при търсенето на обществена информация и нейното повторно използван',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката създава обща рамка за подобряване на процеса по предоставяне на публична информация и повишава прозрачността в работата на публичните институции. Тя допринася за повишаване на интегритета на институциите и за подобряване на услугите, свързани с предоставяне на обществена информация.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'всички публични организации по ЗДОИ',
                                        'Други ангажирани заинтересовани страни' => 'Програма „Достъп до информация“',
                                        'Очаквано въздействие' => 'Ускоряване на процеса по привеждане на вътрешните правила в съответствие с изискванията на закона.',
                                        'Срок на изпълнение' => 'юни 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Провеждане на обучения по промените в ЗДОИ за всички служители в администрацията и особено за звената, отговарящи по ЗДОИ и публикуването в Интернет.',
                                        'Контекст' => 'През 2016 г. бяха въведени изменения в Закона за достъп до обществена информация, с които се създават задължения, свързани с активното публикуване на обществена информация от страна на институциите, увеличава се броят на субектите, задължени да публикуват активно обществена информация на своите интернет страници, увеличават се категориите информация, подлежащи на публикуване в Интернет. Промените предвиждат ръководителите на институциите в изпълнителната власт да създават и актуализират списъци с информация, която трябва да се публикува. Създава се задължение за публикуване на информация онлайн, ако тя е предоставена по три заявления, като за целта ще се разработи централна, публична, уеб- базирана Платформа за достъп до обществена информация.',
                                        'Основна цел' => 'Повишаване на капацитета на администрациите за изпълнение на ЗДОИ и предоставяне на обществена информация.',
                                        'Амбиция' => 'Налагане на нов подход на активно публикуване на обществена информация.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката е свързана с подобряване на достъпа до информация чрез увеличаване на капацитета и уменията на държавните служители за прилагане на Закона за достъп до обществена информация. Тя допринася за повишаване на интегритета на публичните институции.',
                                        'Отговорна институция' => 'Администрация на Министерския съве',
                                        'Други ангажирани публични институции' => 'Институт по публична администрация',
                                        'Други ангажирани заинтересовани страни' => 'Програма “Достъп до информация”',
                                        'Очаквано въздействие' => 'Повишени умения и мотивация на държавните служители за предоставяне на обществена информация и работа за Платформата за достъп до информация.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Водене и поддържане на публични електронни регистри от ДКХ за организаторите на хазартни игри, дейности по производство и разпространение, сервиз и внос на игрално оборудване, прекратени, отказани и отнети лицензи за организиране на хазартни игри, утвърдено игрално оборудване. Обновяване и поддържане на списък на интернет страници, чрез които се организират хазартни игри от лица, които не са получили лиценз за онлайн залагания по ЗХ ',
                                        'Контекст' => 'Хазартният бизнес е динамичен и е един от най-бързо развиващите се, който се регулира от съответните регулаторни органи във всяка една юрисдикция. Държавната комисия по хазарта поддържа свободни и безплатно достъпни публични електронни регистри, чрез които се предоставя информация за лицензирания и регулиран хазартен бизнес на територията на Република България. Регулацията на хазартната дейност се нарежда сред добре балансираните режими в Европа, което се постига чрез нормативни промени, целящи насърчаването и повишаването на инвестициите в бранша за удовлетворяване на бизнеса и държавните цели. Посредством регистрите ДКХ предоставя възможност за публичност и прозрачност на процесите в регулирания лицензиран пазар. По този начин се дава информация на всички участници в хазартните игри за регулирания пазар с цел предпазването им от участие в незаконни залагания. За да се избегнат загуби от данъци и такси при участие чрез онлайн залагания в бетинг компании без лиценз, ДКХ поддържа и периодично обновява списък на интернет страниците, чрез които се организират хазартни игри от лица, които не са получили лиценз по Закона за хазарта. Чрез публичното оповестяване на информацията в регистрите и списъците ДКХ цели да информира и защити бизнеса и участниците в хазартни игри, получили лиценз от Комисията.',
                                        'Основна цел' => 'Публичност и прозрачност на лицензираната и регулирана хазартна дейност. Защита и превенция срещу организирането на незаконен хазарт. Подобряване на бизнес средата за бетинг компаниите и повишаване на приходите в бюджета.',
                                        'Амбиция' => 'Защита на законните оператори на хазартни игри и гражданите.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката осигурява по- добри публични услуги и по-ефективно управление на публичните ресурси. Тя допринася за подобряване на достъпа до информация относно дейността на Държавната комисия по хазарта.',
                                        'Отговорна институция' => 'Държавна комисия по хазарта',
                                        'Други ангажирани публични институции' => 'Министерство на финансите',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Насърчаване на легитимните оператори, публичност и прозрачност на дейността на Държавната комисия по хазарта; подобрен контрол на хазартната дейност.',
                                        'Срок на изпълнение' => 'постоянно',
                                    ],
                                    [
                                        'Наименование' => 'Публикуване на годишните приоритети на Национална агенция за приходите (НАП), основни резултати от дейността на НАП и на резултати от проведени социологически проучвания, свързани с работата на НАП',
                                        'Контекст' => 'Националната агенция за приходите е в непрекъснат контакт както с гражданите, така и с бизнеса и е от изключителна важност те да разполагат с максимален обем информация относно нейната работа – изисквания към данъчно задължените лица, планирани дейности и резултати. Администрацията предоставя пълна и изчерпателна информация за услуги, процеси, формуляри, указания за попълване, права и задължения на клиентите, както и за различни електронни услуги със свободен достъп. Прилагат се всички канали за предоставяне на услуги с фокус върху използването на съвременните информационни и комуникационни технологии. Като институция, с която гражданите и бизнесът комуникират редовно, НАП продължава да отчита мнението на потребителите относно ефективността на услугите, които предлага, и да се стреми към допълнително намаляване на административната тежест за данъкоплатците.',
                                        'Основна цел' => 'Повишаване на прозрачността в работата на Националната агенция за приходите и намаляване на административната тежест за данъкоплатците.',
                                        'Амбиция' => 'Поддържане на подходи, ориентирани към потребителите.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката е насочена към подобряване на публичните услуги и по-ефективно управление на публични ресурси. Нейното изпълнение ще увеличи прозрачността в работата на Националната агенция за приходите.',
                                        'Отговорна институция' => 'Национална агенция за приходите',
                                        'Други ангажирани публични институции' => 'Министерство на финансите',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Подобрена предвидимост на бизнес средата; съобразяване на услугите с очакванията и нуждите на потребителите; подобрен контрол от страна на гражданите върху работата на НАП.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Публикуване на анализи/проучвания, финансирани от ЕСИФ, като ресурс за обмен и уеднаквяване на практики, картиране на ресурса по теми с подобряване на достъпа до информация',
                                        'Контекст' => 'Системата за управление и разходване на ЕСИФ съдържа минимум общи правила, принципи и ключови елементи за всички оперативни програми. Често, съответните грешки или предизвикателства при управлението на дадена програма/тип проекти, могат да послужат за отправна точка за дефинирането на приложими решения, които да бъдат „пренесени“ и върху управлението на други програми/проекти. Аналогично е положението и с „добрите практики“ в решаването на конкретни казуси на изпълнението на програмите/проектите. Публикуването на релевантна информация ще подпомогне бенефициентите в подготовката на по-качествени проекти и в подобряване на тяхното изпълнение/управлението на предоставеното им финансиране.',
                                        'Основна цел' => 'Подпомагане бенефициентите в подготовката на по-качествени проекти и подобряване на тяхното изпълнение/управлението на предоставеното им финансиране.',
                                        'Амбиция' => 'Повече съгласуваност, взаимодействие между административните структури и бенефициентите, и обмен на информация, чрез улеснен достъп до нея. Съдействие за прилагането на единен подход в управлението на ЕСИФ, вкл. еднакво третиране на хоризонталните въпроси, и повече прозрачност.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Подобряване на работата на публичните институции в предоставянето на насоки и в оказването на съдействие на бенефициентите в планирането, организирането, контрола и изпълнението на мерки, съфинансирани с европейския публичен ресурс. Принос за по-ефективното управление на този ресурс, в съответствие с правилата, „научените уроци“ и добрите практики.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет, Централно координационно звено',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Уеднаквени практики на публикуване; разширен достъп до аналитична експертиза, натрупана по програми и проекти, финансирани по ЕСИФ.',
                                        'Срок на изпълнение' => 'постоянно',
                                    ],
                                    [
                                        'Наименование' => 'Създаване на регистър на всички независими регулаторни, надзорни и контролни органи, назначавани от НС (самостоятелно или съвместно с МС и/или президента) с информация за институционални сайтове, правомощия, мандати, членове, нормативна база, решения ',
                                        'Контекст' => 'В България съществуват редица регулаторни, надзорни и контролни органи, които имат ключова роля в области като финансов контрол, защита на потребители, защита на конкуренцията и много други. Понастоящем липсва консолидирана информация за тях: функции, правомощия, решения.',
                                        'Основна цел' => 'Улесняване на достъпа до информация относно работата на регулаторните органи и повишена прозрачност на тяхната дейност.',
                                        'Амбиция' => 'По-активен граждански контрол на работата на регулаторните, надзорни и контролни органи.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката цели улесняване на достъпа до информация относно работата на регулаторните органи и повишена прозрачност на тяхната дейност. Чрез нея се постига подобряване на интегритета на публичните институции и по-ефективно управление на публичните ресурси.',
                                        'Отговорна институция' => 'Администрация на Министерския съвет',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Център за либерални стратегии, Български институт за правни инициативи',
                                        'Очаквано въздействие' => 'Структуриране и консолидиране на наличната информация и попълване на празноти в нея; по-ефективен граждански контрол върху дейността на регулаторните органи.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Изграждане на информационна система по събиране, дигитализация и съхранение на националния държавен архив на Националния институт за недвижимо културно наследство, както и въвеждане на електронни услуги за граждани, служители на държавната и общинската администрация чрез създаване на дигитален публичен архив и електронен регистър на недвижимите културни ценности с национално и световно значение и недвижимите археологически културни ценности с национално значение.',
                                        'Контекст' => 'Към момента липсва добре работеща и структурирана дигитална система за Националния документален архивен фонд при НИНКН. Системата на архивиране е неподходяща при разглеждане на преписки. Това води до затрудняване при търсенето на информация и забавяне при изготвяне на документи, свързани със статута. Дигитализирането на Регистъра и Националния документален архивен фонд при НИНКН не се случва (освен частично за Регистъра). По време на работния процес в НИНКН се събира информация в цифров вид (снимки, текстове, чертежи и др.), които не винаги се отлагат в архив.',
                                        'Основна цел' => 'Разширяване на обхвата и достъпността на предоставяната обществена информация и последващо по-активно включване на гражданите в дейностите по контрол и опазване на недвижимото културно наследство.',
                                        'Амбиция' => 'Пълна актуализация и достъпност на информацията за недвижимото културно наследство.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката осигурява разширен достъп до информация, като същевременно увеличава възможностите за упражняване на граждански контрол върху дейностите по управление и опазване на недвижимото културно наследство. Тя е насочена към подобряване на публичните услуги и увеличаване на интегритета на публичните институции.',
                                        'Отговорна институция' => 'Министерство на културата',
                                        'Други ангажирани публични институции' => 'Национален институт за недвижимо културно наследство',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Актуализиран, пълен и електронно достъпен архив на недвижимото културно наследство; подобрен обмен на информация и възможност за бързи проверки; създадени електронни услуги за граждани и общини, улесняващи изпълнението на дейности по възстановяване, консервиране и контрол на недвижимото културно наследство.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ]
                                )
                            ],
                        ),
                        'Отворени градове' => array(
                            [
                                'commitment' => 'Българското правителство ще си сътрудничи с и ще насърчава местните власти с цел въвеждане и развитие на практики на отворено управление на местно равнище',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Приемане на програма за отваряне на данни на местно ниво, която да съдържа списък от бази данни и график за отварянето им',
                                        'Контекст' => 'Усилието за публикуване на обществена информация в отворен, машинно-четим формат е съсредоточено основно на централно равнище, като се редки примерите за активно публикуване от общини. От друга страна, интересът и търсенето на общинските данни е изключително голям, като те имат потенциал да отключат редица икономически и социални ползи от употребата на данни в отворен формат.',
                                        'Основна цел' => 'Разширяване на обхвата на политиката за отворени данни и създаване на нови възможности за гражданско участие на местно ниво.',
                                        'Амбиция' => 'Постепенно включване на големите градове в инициативата за отворени данни и отключване на икономическия и социален потенциал на обществената информация в отворен формат.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката води до подобрен достъп до информация и разширяване на обхвата на публикуване на данни в отворен формат. Тя цели осигуряване на по-добри публични услуги на местно равнище, по-ефективно управление на публичните ресурси и подобрен интегритет на местната власт',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Национално сдружение на общините в България',
                                        'Други ангажирани заинтересовани страни' => 'Община София, Сдружение „НПО Линкс“',
                                        'Очаквано въздействие' => 'Повишена прозрачност на общинските политики, създадени продукти и услуги, базирани на данни на местните администрации, по-активно включване на гражданите в разработването на общински публични услуги и процеса на взимане на решения на местно равнище',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Осигуряване на по-висока прозрачност на публичните финанси на местно ниво – пилотно въвеждане на „граждански бюджет“ в Община София.',
                                        'Контекст' => 'Повечето българските общини публикуват активно информация за своите бюджети, но често тази информация е твърде сложна и нейната оценка и анализ изискват специализирана експертиза от страна на гражданите. Това от своя страна демотивира повечето граждани и подтиска гражданското участие в едно толкова важна област каквато са общинските финанси',
                                        'Основна цел' => 'Стимулиране на гражданско участие чрез осигуряване на разбираема информация относно общинските бюджети или т.нар. „граждански бюджет“.',
                                        'Амбиция' => 'Въвеждане на практиката на изготвяне на „бюджет на гражданите“ на общинско ниво.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката е насочена към по-активно и информирано участие на гражданите в процесите на управление и контрол на общинските бюджети. Тя цели по-ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Столична община',
                                        'Други ангажирани публични институции' => 'Национално сдружение на общините в България',
                                        'Други ангажирани заинтересовани страни' => 'Общини',
                                        'Очаквано въздействие' => 'По-добро познаване на очакванията на гражданите и развиване на капацитет за представяне на сложна финансова информация по разбираем и достъпен за гражданите начин; разработване на ефективни форми за комуникация; по-активно участие на гражданите в управлението на общинските бюджети.',
                                        'Срок на изпълнение' => 'юни 2017 г.',
                                    ]
                                )
                            ],
                        ),
                        'Гражданско участие' => array(
                            [
                                'commitment' => 'Българското правителство ще активизира диалога си с гражданското общество чрез иновативни форми на взаимодействие, позволяващи обратна връзка и съавторство при формулиране на политики',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Подобряване на качеството на провежданите обществени консултации чрез подобряване на функционалностите на портала за обществени комуникации; разработване на единни стандарти за избор на членове на обществени и консултативни съвети, за публичност на тяхната дейност и ясни механизми за прилагане на техните решения; подготовка в сътрудничество с граждански организации на обучителни програми за държавни служители за организиране на ефективни обществени консултации, разработване на практически насоки/ наръчник за включване на гражданите и предоставяне на обратна връзка по направените предложения по време на обществените консултации.',
                                        'Контекст' => 'Новите изменения на Закона за нормативните актове въвеждат повишени изисквания за качеството на провежданите обществени консултации. Освен това натрупаният до сега опит показва, че се налице някои слабости при провеждане на обществени обсъждания, които следва да бъдат адресирани с оглед по-активното включване на заинтересованите страни и постигане на по-високо качество на крайния продукт от консултациите. За целта е необходимо да се повишат уменията на представителите на администрацията за провеждане на ефективни обсъждания, а новите изисквания следва да бъдат отразени и в Портала за обществени консултации, като основен канал за комуникация със заинтересованите страни по всички предложения за нормативни актове и стратегически документи. Тъй като е създаден през 2008 г. много от неговите функционалности вече не отговарят на технологичното развитие и нуждите на потребителите - основно по отношение на обратна връзка по направени коментари и предложение и възможност за краудсорсинг, търсене на документи и др. ',
                                        'Основна цел' => 'Подобряване на качеството на обществените консултации и по-активно ангажиране на заинтересованите страни в процеса на формулиране на политики и изготвяне на нормативни актове.',
                                        'Амбиция' => 'Използване на предимствата на новите технологии за разширяване на обхвата на включените в обществените консултации заинтересовани страни.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Цялостното усъвършенстване на процедурите по провеждане на обществени консултации и разширяването на каналите за включване осигурява възможност за участие на по-голям брой заинтересовани страни и създава гаранции за по-високо доверие в процеса. Чрез мярката ще бъде подобрен интегритета на публичните институции',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Институт по публична администрация, Съвет за административна реформа',
                                        'Други ангажирани заинтересовани страни' => 'Български център за нестопанско право, Форум “Граждански инициативи”',
                                        'Очаквано въздействие' => 'Увеличен брой включени в обществените консултации заинтересовани страни; увеличено качество на обществените консултации; подобрени вътрешни процедури за провеждане на обществени консултации; подобрени умения на държавните служители за участие и модериране на публични обсъждания.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Въвеждане на възможност за национална електронна подписка за национална и местна гражданска инициатива, както и намаляване на бюрокрацията и количеството лични данни, които се събират и съпътстващо изменение на Закона за прякото участие на гражданите в държавната власт.',
                                        'Контекст' => 'Понастоящем Законът за прякото участие на гражданите в държавната власт не предвижда възможност за организиране на електронна подписка за национална и местна гражданска инициатива, като такава възможност е предвидена единствено за европейска гражданска инициатива.',
                                        'Основна цел' => 'Активиране на гражданско участие чрез улесняване на процедурите за организиране на национални и местни граждански инициативи',
                                        'Амбиция' => 'Разширяване на възможностите българските граждани да влияят на управлението.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Новите технологии увеличават и значително улесняват самоорганизацията на гражданите с оглед по – активно участие в процеса на взимане на решения. Мярката допринася за подобряване на интегритета на публичните институции',
                                        'Отговорна институция' => 'Администрация на Министерски съве',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Български център за нестопанско право, Форум “Граждански инициативи”',
                                        'Очаквано въздействие' => 'Насърчаване на самоорганизацията на гражданите и гражданските инициативи; намалени бюрократични пречки пред прякото участие на гражданите.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Създаване на постоянна платформа за съвместно наблюдение и оценка на изпълнение на плановете по ПОУ със заинтересованите страни',
                                        'Контекст' => 'Подходът за включване на заинтересованите страни в мониторинг и оценка на изпълнението на ангажиментите в Плановете за действие на България по ПОУ не е систематичен и структуриран. Той разчита на активност от страна на НПО и другите заинтересовани страни, но поради все още слабата познатост на инициативата и липсата на ясен механизъм за действие, твърде ограничен брой представители на гражданския сектор се включват в процеса на проследяване на изпълнението.',
                                        'Основна цел' => 'Стимулиране на активно участие и повишаване на качеството на изпълнение чрез създаване на структуриран механизъм за проследяване на напредъка и изпълнението на националните планове за действие по ПОУ.',
                                        'Амбиция' => 'Постоянно подобряване на качеството на изпълнение на националните планове и ангажиране на всички заинтересовани страни в процеса на оценка и мониторинг.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Създаването на постоянен механизъм за съвместно наблюдение и оценка дава възможност да се увеличи честотата на предоставяне на информация относно изпълнението на ангажиментите по ПОУ, да се осигури предвидимост на диалога, да се създадат устойчиви форми на сътрудничество, а оттам да се стимулира гражданското участие. Чрез мярката се постига подобрен интегритет на публичните институции.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Министерства, отговорни за изпълнение на мерки по плановете',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Повишена прозрачност на процеса по изпълнение на националните планове; участие на по-голям брой заинтересовани страни; идентифициране и коригирани на слабости при изпълнението; стратегически подход при изпълнението и оценката.',
                                        'Срок на изпълнение' => 'октомври 2016 г.',
                                    ],
                                    [
                                        'Наименование' => 'Пилотно въвеждане на нов метод за анализ на сложни и отворени въпроси при формулиране на политически решения при управлението на ЕСИФ в сътрудничество с партньорите (design-thinking): провеждане на семинар със заинтересовани страни, посветен на практическото прилагане на политиките по околна среда и политиката срещу изменението на климата като хоризонтална политика при управлението на ЕСИФ',
                                        'Контекст' => 'Колаборативният подход (co-design, design-thinking) е все още слабо използван в България при решаване на комплексни въпроси при формулиране на политически решения. В консултативния процес се разчита предимно на конвенционални методи, които често са по- статични и недостатъчно гъвкави, и залагат на модели на съвместна работа, които по-скоро ограничават креативността и иновативността.',
                                        'Основна цел' => 'Въвеждане на иновативни модели на консултиране и повишаване на качеството на формулираните политики.',
                                        'Амбиция' => 'Налагане на нова колаборативна култура на формулиране и изпълнение на политики.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Новите подходи за колаборативно формулиране на решения и политики допринасят за повече равнопоставеност и баланс в процеса на консултиране, дават възможност да се споделят различни мнения, като по този начин стимулират гражданското участие. Мярката цели подобряване на интегритета на публичните институции и по - ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет, Централно координационно звено ',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Създадени умения у представителите на управлението за прилагане на подхода design-thinking за решаване на комплексни въпроси, свързани с формулиране на политики; стимулиране на креативността на заинтересованите страни; насърчаване на иновативни подходи за консултиране.',
                                        'Срок на изпълнение' => 'декември 2016 г.',
                                    ],
                                    [
                                        'Наименование' => ' Разработване и организиране на форуми по разработването на Стратегия за корпоративна социална отговорност',
                                        'Контекст' => 'Стимулирането на корпоративна социална отговорност е тема, която присъства в обществения дебат от години, но до момента инициативите за корпоративна социална отговорност са основно резултат от самоорганизация на фирмите и в много малка степен се насърчават систематично от публичните институции.',
                                        'Основна цел' => 'Да се въведат ясни механизми за насърчаване на корпоративна социална отговорност в сътрудничество с бизнес',
                                        'Амбиция' => 'Осигурява на систематичност и фокус на процеса на стимулиране на корпоративна социална отговорност и използване на потенциала и ресурса на бизнеса за предоставяне на по- добри социални услуги.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката стимулира колаборативен подход, активно включване на представителите на бизнеса и гражданите, и прозрачност на процеса по изготвяне на стратегически документи, по-конкретно Стратегия за корпоративна социална отговорност. Тя гарантира повишен интегритет на публичните институции и по-добри публични услуги в социалната сфера.',
                                        'Отговорна институция' => 'Министерство на труда и социалната политика',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Бизнес организации',
                                        'Очаквано въздействие' => 'Улесняване на бизнеса при изпълнението на инициативи за корпоративна социална отговорност; подобрено сътрудничество между държавата и бизнеса в социалната сфера; предвидимост и систематичност на държавните стимули за корпоративната социална отговорност.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ]
                                )
                            ],
                            [
                                'commitment' => 'Българското правителство ще подобрява средата и ще предприеме стъпки за подкрепа на развитието на гражданските организации',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Актуализиране на Стратегията за подкрепа развитието на гражданските организации и приемане на нов план и отговорна институция за изпълнението й',
                                        'Контекст' => 'Стратегията за подкрепа развитието на гражданските организации е с изтекло действие и понастоящем няма отговорна институция, която е ангажирана с нейното актуализиране и последващо изпълнение',
                                        'Основна цел' => 'Създаване на условия за ефективна работа на гражданските организации и активно участие в процесите на взимане на решения, формулиране на политики, и контрол на управлението. ',
                                        'Амбиция' => 'Жизнеспособен граждански сектор, който допринася активно за подобряване на управлението, предоставя ефективни услуги и увеличава своята експертиза.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката има за цел да създаде подходящи условия за развитие на гражданските организации и да стимулира партньорството между тях и институциите на национално и местно ниво.Тя ще допринесе за подобрен интегритет на публичните институции.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Български център за нестопанско право, Форум “Граждански инициативи”',
                                        'Очаквано въздействие' => 'Подкрепа за развитието на гражданските организации.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ]
                                )
                            ],
                        ),
                        'Почтено управление (интегритет)' => array(
                            [
                                'commitment' => 'Българското правителство ще работи за увеличаване на почтеността в управлението и подобряване на вътрешния и външен контрол върху дейността на институциите',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Създаване на публичен регистър за бюджетен и проектен контрол на електронното управление',
                                        'Контекст' => 'Въвеждането на електронно управление в България е широкомащабна и приоритетна задача на българското правителство. В рамките на инициативата за електронно управление предстои да бъдат изпълнени редица големи проекти с висока финансова стойност',
                                        'Основна цел' => 'Осигуряване на прозрачност чрез публичен достъп до всички проектни идеи в рамките на е-управление.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката цели да подобри достъпа и обмена на информация и да подобри прозрачността и отчетността на дейностите по изграждане на електронно управление в България. Чрез нея се постига подобряване на интегритета на публичните институции и по-ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Агенция за електронно управление (предстои да бъде създадена)',
                                        'Други ангажирани заинтересовани страни' => 'Фирми от ИТ сектора',
                                        'Очаквано въздействие' => 'Подобряване на проследимостта на проектите; предотвратяване на дублиране на дейности; ефективен граждански контрол.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Реализиране на универсална ЦАИС „Анализ на корупционния риск“',
                                        'Контекст' => 'Антикорупционните звена в различните сектори на управлението имат нужда от инструмент, с който да анализират потенциалния риск при лица, заемащи публични длъжност. В момента процесът е разпокъсан, недостатъчно ефективен и включва ръчна проверка на множество обстоятелства в множество информационни архиви и единици. ЦАИС “Анализ на корупционния риск” ще бъде система, внедрена както на централно, така и на секторно ниво, която автоматично ще анализира корупционен риск, свързан с длъжностни лица, комбинирайки информация от много източници и регистри и ще позволява извършване на периодични и ad-hoc проверки. Системата предвижда и функционалност за генериране на публичен агрегиран отчет. ',
                                        'Основна цел' => 'Подобряване на процесите по вътрешен контрол и намаляване на корупционния риск.',
                                        'Амбиция' => 'Напълно автоматизиран процес на контрол.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Чрез създаването на система за анализ на корупционния риск и изграждането на функционалност за генериране на публичен генериран отчет се осигурява възможност за по-активен граждански контрол и информирано участие на гражданите в усилията за предотвратяване на корупционни практики и конфликт на интереси. Мярката цели подобряване на интегритета на публичните институции и по-ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Министерство на правосъдието',
                                        'Други ангажирани публични институции' => 'Център за превенция и противодействие на корупцията и организираната престъпност',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Консолидиран и по-ефективен процес на анализ на корупционен риск; чрез публичните отчети се активизира граждански натиск.',
                                        'Срок на изпълнение' => 'септември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'На основание чл. 10, ал. 11 от ЗМ при назначаване и повишаване в длъжност в Агенция "Митници", лицата трябва да имат положителен резултат от изследване за професионална и психологическа пригодност. Изготвен и внесен проект на наредба в Министерство на финансите.',
                                        'Контекст' => 'Агенция „Митници“ носи характеристиките на администрация, чиято дейност е свързана с националната сигурност и обществения ред. В чл. 10, ал. 11 от Закона за митниците е отчетена спецификата на митническата дейност и функциите на администрацията на територията на страната, като част от митническата територия на Европейския съюз. Поставянето на изисквания за извършване на професионална и психологическа пригодност към лицата, кандидатстващи за длъжност в Агенция „Митници“ и към служителите при повишаване в длъжност, е обосновано от високите очаквания от дейността на митническите органи в Република България като част от администрацията на Европейския съюз. Назначаването на всяка длъжност на държавен служител се извършва чрез конкуренция, основана на професионални качества. Чрез регламентирана процедура за извършване на изследване за професионална и психологическа пригодност, Агенция „Митници“ има за цел да се проверяват знанията, уменията и нагласите на кандидата за служител в митническата администрация, относно справянето със задачи, които са свързани със задълженията на съответната длъжност, включително и при ситуации, пораждащи условия за контрапродуктивно поведение. За изпълнение на длъжност в митническата администрация се изисква кандидатът да притежава честност и нагласа за придържане към установените правни, организационни, морални и социални норми. С чл. 10, ал. 11 от Закона за митниците е отчетена спецификата на митническата дейност и високите изисквания към служителите с цел постигане на резултати от осъществяването й. Очакваните резултати от изследването за професионална и психологическа пригодност са набиране и задържане на персонал, който има и може да поддържа високи стандарти на интегритет, безпристрастност и осигуряване на адекватно обучение и професионално развитие на митническите служители. Само едновременното прилагане на тестове за професионална компетентност и изследване за професионална и психологическа пригодност ще доведе до създаване на цялостна представа за профила на кандидата, подходящ за работа в митническата администрация. ',
                                        'Основна цел' => 'Ефективна превенция на нерегламентирани практики и намаляване на корупционния риск чрез мерки за подбор и вътрешен контрол на персонала.',
                                        'Амбиция' => 'Превръщане на Агенция “Митници” в модел за ефективно справяне с корупционния натиск.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Подобряване на интегритета на публичните институции и по-ефективно управление на публични ресурси',
                                        'Отговорна институция' => 'Агенция “Митници”',
                                        'Други ангажирани публични институции' => 'Министерство на финансите',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Намален корупционен риск; активна превенция на корупционни практики; по-ефективна работа на Агенцията.',
                                        'Срок на изпълнение' => 'постоянно',
                                    ],
                                    [
                                        'Наименование' => 'Осигуряване на прозрачност на дейността и процесите на управление на митническата администрация чрез подържане на различни видове канали за подаване на сигнали от гражданите ("горещ телефон"), информационна система на Националния  съвет по антикорупционни политики, e-mail, писмено чрез деловодствата и кутии за сигнали) и предприемане на съответни действия по постъпилите сигнали и предложения',
                                        'Контекст' => 'Превенцията и противодействието на корупцията е един от приоритетите в дейността на Агенция "Митници" и е от съществено значение за ефективната работа на агенцията.',
                                        'Основна цел' => 'Ангажиране на обществеността за превенция на корупционни практики и разширяване на наличните канали за комуникация по темата.',
                                        'Отговорна институция' => 'Агенция “Митници”',
                                        'Други ангажирани публични институции' => 'Министерство на финансите',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Подобряване на прозрачността в работата на Агенция “Митници”; увеличен брой сигнали; подобрена обратна връзка по постъпили сигнали; подобряване на вътрешните процедури.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Въвеждане на изменения в Закона за обществени поръчки, предвиждащи предварителна проверка на кандидати за поръчки над определена минимална сума и разкриване на крайния собственик на кандидата',
                                        'Контекст' => 'Темата за обществените поръчки, особено свързани с големи инфраструктурни проекти, е особено чувствителна за обществото. Съществуващите неясноти относно собствеността на компании, кандидатстващи или изпълняващи обществени поръчки, подкопава доверието в справедливостта на процеса на възлагане и поражда съмнения за нерегламентиран натиск, скрито влияние и корупция. ',
                                        'Основна цел' => 'Подобряване на вътрешния контрол при разходване на публичен ресурс и намаляване на корупционния риск в процеса на възлагане на обществени поръчки. Постигане на яснота и прозрачност относно собствеността на компании, опериращи с публичен ресурс.',
                                        'Амбиция' => 'Подобряване на бизнес средата и намаляване на възможностите компании с неясни цели и собственост да се ползват с конкурентно предимство пред легитимни, спазващи правилата кандидати',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Чрез тази мярка се повишава прозрачността в процеса на възлагане на обществени поръчки. Осигурява се повече отчетност при оценката на потенциални кандидати. Така се подобрява интегритета на публичните институции и се постига по-ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Министерство на правосъдиет',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Избягване на публично съмнение по отношение на възлагането на големи обществени поръчки; ограничаване на възможността за създаване на кухи компании с цел участие в обществени поръчки; създаване на инструмент за борба с корупцията и предотвратяване на използването на публичен ресурс за участие в престъпна дейност като пране на пари, трафик на хора, оръжие, наркотици и др.; възможност държавните институции да упражняват контрол върху реалните собственици; възможност банки, финансови институции и компании да извършват лесни и бързи проверки на свои контрагенти.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ]
                                )
                            ],
                        ),
                        'Отворени данни' => array(
                            [
                                'commitment' => 'Българското правителство ще продължи усилията си за публикуване на публична информация в отворен формат като въведе мерки за повишаване на качеството на данните и за широкото им използване от заинтересованите страни',
                                'arrangements' => array(
                                    [
                                        'Наименование' => 'Надграждане и усъвършенстване на портала за отворени данни с добавяне на нови функционалности – йерархичност на организациите, по-добро търсене, issue tracker за масиви от данни, инструменти за автоматично качване на данни, сигнал за ниско качество на данните, сертификат за институции с високи постижения, възможност за обратна връзка и др.',
                                        'Контекст' => 'Понастоящем порталът е в демо версия и не поддържа редица ключови функционалности.',
                                        'Основна цел' => 'Подобряване на Портала за отворени данни и на качеството на публикуваните масиви от данни чрез автоматизиране на процесите, свързани с публикуване на обществена информация в машинно-четим формат.',
                                        'Амбиция' => 'Подобрена ползваемост на портала и на данните, публикувани в него',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Чрез подобрена ползваемост, разширени функционалности и повишено качество на данните се стимулира по- активна употреба на публичните данни от граждански организации и бизнес и възможност за информиран, базиран на данни принос към взимането на решения и формулиране на политики. Мярката е насочена към подобряване на интегритета на публичните институции, по-ефективно управление на публичен ресурс и по-добри публични услуги. ',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'По-високо качество и ползваемост на масивите от данни; по-активна ангажираност на потребителите и по-ефективна комуникация с тях; повече услуги и продукти, базирани на отворени данни.',
                                        'Срок на изпълнение' => 'декември 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Публикуване на данни от ИСУН2020 относно програмите и проектите, вкл. напредък на изпълнението',
                                        'Контекст' => 'Понастоящем на портала са публикувани данни от системата, като е необходимо тяхното постоянно актуализиране и подобряване.',
                                        'Основна цел' => 'Повишаване на ползваемостта на публикуваната информация и разширяване на обхвата ползватели.',
                                        'Амбиция' => 'Активен публичен контрол върху изпълнението на програми и проекти, финансирани по ЕСИФ.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Разширяване на обхвата на достъпната информация в машинно – четим формат. Чрез мярката се постига подобряване на интегритета на публичните институции, по-ефективно управление на публичен ресурс и по-добри публични услуги.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет, Централно координационно звено',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'По-високо качество на анализите и визуализации, свързани с ефективността на програмите и проектите; подобрен процес на програмиране и планиране, базиран на данни; повишена прозрачност и ангажираност на заинтересованите страни.',
                                        'Срок на изпълнение' => 'постоянен',
                                    ],
                                    [
                                        'Наименование' => 'Провеждане на публични събития за популяризиране на предимствата на отворените данни сред потребителите и събиране на реални примери за икономическите и социални ползи',
                                        'Контекст' => 'България отбелязва чувствителен напредък по отношение на активното публикуване на обществена информация в отворен формат. На този етап обаче този напредък не води до съпътстващо значително увеличение на ползването, което се дължи на това, че процесът е твърде нов и ползвателите все още не са запознати добре с него, не притежават необходимите умения за работа с данни, и не отчитат предимствата на подходите, базирани на данни.',
                                        'Основна цел' => 'Активизиране на ползването на отворени данни при формулиране на политики, създаване на услуги и продукти, базирани на данни, упражняване на контрол върху институциите.',
                                        'Амбиция' => 'Генериране на реални икономически и социални ползи от публикуването на данни в отворен формат.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката насърчава по- активното ангажиране на граждани и бизнес в разработването на продукти и услуги, базирани на данни, в обработката и анализа на данни с цел информирано участие в публичния дебат. Тя цели подобряване на интегритета на публичните институции, по-ефективно управление на публичен ресурс и по-добри публични услуги.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Собственици на данн',
                                        'Други ангажирани заинтересовани страни' => 'ИТ специалисти, анализатори, медии',
                                        'Очаквано въздействие' => 'Увеличен интерес към масивите от данни на портала; създадени нови продукти и услуги, базирани на данни; изграждане на екосистема от ползватели.',
                                        'Срок на изпълнение' => 'постоянно',
                                    ],
                                    [
                                        'Наименование' => 'Изготвяне и разпространяване на наръчник за работа с отворени данни',
                                        'Контекст' => 'Работата с данни е сравнително ново умение за всички потребители и в частност за представителите на администрацията. В рамките на управлението все още са редки примерите за формулиране на политики и взимане на решения въз основа на отворени данни.',
                                        'Основна цел' => 'Насърчаване на държавните служители да ползват данни при изпълнение на техните задължения и подобряване на техните умения за обработка и анализ на данни.',
                                        'Амбиция' => 'Все по-активно ползване на данни при разработване на политики.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Наръчникът ще подобри уменията на потребителите за работа с данни, а оттам и достъпността на публикуваните в отворен формат данни. Мярката е насочена към подобряване на интегритета на публичните институции, по-ефективно управление на публичен ресурс и по-добри публични услуги.',
                                        'Отговорна институция' => 'Администрация на Министерски съвет',
                                        'Други ангажирани публични институции' => 'Институт по публична администрация',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Повишени умения на държавните служители за обработка и анализ на данни.',
                                        'Срок на изпълнение' => 'юни 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Актуализиране, поддържане и разработване на GIS приложения на регистъра на защитени територии в България',
                                        'Контекст' => 'Околната среда е сфера, в която GIS приложенията допринасят съществена за оценка и планиране, опазване и управление на ресурсите, информиране на населението и докладване пред контролни и регулаторни органи. В момента е разработено само едно GIS приложение към електронния регистър на защитените територии в България.',
                                        'Основна цел' => 'Подобряване на вземането на решения и точно насочване на мерките за опазване на защитените територии. По-активно използване на гражданския потенциал за защита и опазване на защитените територии.',
                                        'Амбиция' => 'Осигуряване на качествени информационни услуги за вътрешни и външни потребители.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката спомага за увеличаване на наличната информация и нейното картографирани, като по този начин допринася за повече прозрачност на дейностите по опазване на околната среда и възможност гражданските организации за оказват качествен контрол върху процеса на взимане на решения в тази област. Чрез нея се постига по-ефективно управление на публични ресурси и по-добри публични услуги.',
                                        'Отговорна институция' => 'Министерство на околната среда и водите, Дирекция „Национална служба за защита на природата“',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'По-висока ефективност и навременност на мерките за опазване на защитени територии; включване на екологични организации и граждани в процеса по опазване и управление на защитени територии; създаване на картографски визуализации, проследяване на различни сценарии и визуализиране на описателни данни на базата на пространствени явления.',
                                        'Срок на изпълнение' => 'май 2018 г.',
                                    ],
                                    [
                                        'Наименование' => 'Публикуване на таблица с макроикономическа прогноза два пъти годишно',
                                        'Контекст' => 'Понастоящем макроикономическата прогноза се публикува в PDF, което не е отворен, машинночетим формат.',
                                        'Основна цел' => 'Повишаване на финансовата прозрачност и отчетността на управлението.',
                                        'Амбиция' => 'Разширяване на обхвата от данни, публикувани в портала за отворени дан',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката допринася за увеличаване на обема, качеството и ползваемостта на предоставяната финансова информация. Тя цели по-ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Министерство на финансите',
                                        'Други ангажирани публични институции' => 'Няма',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'лесняване на обработката; засилване на прозрачността и отчетността при управлението на публичните финанси; по-точни анализи',
                                        'Срок на изпълнение' => 'Ежегодно, на шестмесечие, съответно в месеците април и октомври.',
                                    ],
                                    [
                                        'Наименование' => 'Публикуване на данни в отворен формат относно миграционните процеси',
                                        'Контекст' => 'Данните не се публикуват в отворен, машинно-четим формат.',
                                        'Основна цел' => 'Улесняване на обработката и активизиране на гражданското участие по темата',
                                        'Амбиция' => 'Разработване на приложения с цел адресиране на съществуващите обществени страхове.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката осигурява възможност за лесна обработка и анализ на публични данни и информирано участие на граждански организации при формулиране на политики по отношение на миграцията. Чрез нея се постигат подобряване на интегритета на публичните институции и по-ефективно управление на публични ресурси.',
                                        'Отговорна институция' => 'Министерство на вътрешните работи',
                                        'Други ангажирани публични институции' => 'няма',
                                        'Други ангажирани заинтересовани страни' => 'Институт за развитие на публичната среда',
                                        'Очаквано въздействие' => 'Активно включване на заинтересованите страни в усилията за управление на мигрантската криза; повишено познаване на процесите и възможност за бърза реакция при възникнали проблеми; формулиране на политики по отношение на мигрантите, основани на точна и навременна информация.',
                                        'Срок на изпълнение' => 'юни 2017 г.',
                                    ],
                                    [
                                        'Наименование' => 'Доразвитие на ЕИСПП и предоставяне на публичен достъп до информация в ядрото на системата, свързан с инициативата Open Data, както и при предоставянето на КАО',
                                        'Контекст' => 'Данните, свързани с работата на съдебната система, са обект на сериозен интерес от страна на анализатори, медии и граждани. Същевременно те са ценен ресурс за самите представители на съдебната система, тъй като техният анализ може да допринесе за подобряване на работата й и повишаване на доверието между граждани и правораздаващи органи. Понастоящем такива данни не се публикуват в машинно-четим формат.',
                                        'Основна цел' => 'Увеличаване на прозрачността и ефективността на съдебната система.',
                                        'Амбиция' => 'Постепенно увеличаване на доверието на гражданите в органите на съдебната власт.',
                                        'Релевантност и съответствие с големите предизвикателства на ПОУ' => 'Мярката е насочена към увеличаване на обема на наличната публична информация и повишаване на качеството и ползваемостта й. Тя адресира предизвикателствата, свързани с по-добри публични услуги и подобрен интегритет на публичните институции .',
                                        'Отговорна институция' => 'Висш съдебен съвет',
                                        'Други ангажирани публични институции' => 'Министерство на правосъдието',
                                        'Други ангажирани заинтересовани страни' => 'Няма',
                                        'Очаквано въздействие' => 'Въвеждане на нови подходи за взимане на решения, базирани на данни; идентифициране на слабости в работата на системата на основата на обективни данни; включване на заинтересованите страни в усилията за реформа на съдебната система.',
                                        'Срок на изпълнение' => 'юни 2018 г.',
                                    ],
                                )
                            ],
                        )
                    ),
                    'en' => array(
                        'Electronic Governance' => array(
                            [
                                'commitment' => 'The Bulgarian government will improve access to and quality of public services through the implementation of e-governance tools',
                                'arrangements' => array(
                                    [
                                        'Title' => 'Enhancement of existing and introduction of new electronic services by the National Revenue Agency (NRA)',
                                        'Context' => 'Currently, the NRA offers the most electronic services in the public administration, but some services still require in-person visits, which consumes time and represents an administrative burden for taxpayers.',
                                        'Main Goal' => 'Expand the scope and quality of NRA electronic services to further reduce bureaucratic obstacles through citizen-oriented services and improve internal business processes.',
                                        'Ambition' => 'Simplify procedures and improve approaches oriented to taxpayers’ needs.',
                                        'Relevance to Key Challenges' => 'This measure addresses the key challenge of improving public service efficiency.',
                                        'Responsible Institution' => 'National Revenue Agency',
                                        'Other Public Institutions Involved' => 'Ministry of Finance',
                                        'Other Stakeholders' => 'Business associations, employers’ organizations',
                                        'Expected Impact' => 'Easier and convenient access to NRA services; reduced administrative burden for citizens and businesses; economic benefits from time and resource savings; improved process management and higher efficiency of the revenue administration.',
                                        'Timeline' => 'Ongoing',
                                    ],
                                    [
                                        'Title' => 'Development of a sectoral e-Government Strategy in the Ministry of Environment and Water (MOEW) and Roadmap for 2016–2020 in accordance with the National e-Government Strategy 2014–2020',
                                        'Context' => 'Environmental management faces challenges such as climate change adaptation, resource efficiency, biodiversity loss prevention, and promoting eco-friendly societal behavior. E-governance plays a key role in managing these processes, providing timely information, and enabling public participation.',
                                        'Main Goal' => 'Develop targeted, accessible, predictable, efficient, and effective e-governance for the benefit of society and the environment.',
                                        'Ambition' => 'Achieve flexibility and efficiency in environmental measures, shorten document processing times, ensure public access, and transparency in procedures.',
                                        'Relevance to Key Challenges' => 'Addresses challenges in modern natural resource management, improving public services, and governance integrity. Digitization enhances transparency and accountability.',
                                        'Responsible Institution' => 'Ministry of Environment and Water, Directorate “Human Resources, Information Services, Public Relations and Protocol”',
                                        'Other Public Institutions Involved' => 'None',
                                        'Other Stakeholders' => 'NGOs, business, local communities',
                                        'Expected Impact' => 'Consistency and predictability in implementing e-governance in environmental management; improved internal procedures and consolidated data sources.',
                                        'Timeline' => 'October 2016',
                                    ],
                                    [
                                        'Title' => 'Implementation of a public electronic register of installations and sources of volatile organic compounds, with two electronic services – registration application and application for changes in registered installations',
                                        'Context' => 'Maintaining a public electronic register now allows applications for registration or changes to be submitted electronically.',
                                        'Main Goal' => 'Achieve higher-quality service for businesses, improve public awareness, and increase transparency regarding air quality management.',
                                        'Ambition' => 'Provide modern services and ensure transparency in regulatory compliance.',
                                        'Relevance to Key Challenges' => 'Enhances public service efficiency and governance integrity; improves public access and engagement in monitoring air pollution.',
                                        'Responsible Institution' => 'Executive Environment Agency, Regional Environmental and Water Inspectorates',
                                        'Other Public Institutions Involved' => 'Ministry of Environment and Water',
                                        'Other Stakeholders' => 'Facility operators, local communities, civic organizations',
                                        'Expected Impact' => 'Reduced processing times, improved flexibility and efficiency of internal procedures, broader access, and transparent stakeholder interaction.',
                                        'Timeline' => 'July 2016',
                                    ],
                                    [
                                        'Title' => 'Implementation of a Waste Management Information System (WMIS) allowing electronic submission, record-keeping, and information provision',
                                        'Context' => 'Waste management generates public interest and often leads to conflicts among communities, operators, and authorities. Lack of consolidated electronic information exacerbates conflicts and complicates dialogue.',
                                        'Main Goal' => 'Leverage technology to provide more information about waste management and reduce administrative burden on businesses.',
                                        'Ambition' => 'Create a system enabling timely addressing of potential issues and broadening information access for the public.',
                                        'Relevance to Key Challenges' => 'Improves public services and resource management through digitization; enhances public accountability and access to waste management information.',
                                        'Responsible Institution' => 'Executive Environment Agency',
                                        'Other Public Institutions Involved' => 'Ministry of Environment and Water, Regional Inspectorates',
                                        'Other Stakeholders' => 'Civic organizations, local communities, businesses',
                                        'Expected Impact' => 'Better monitoring of waste management companies; easier application submission; broader availability of electronic information.',
                                        'Timeline' => 'December 2017',
                                    ],
                                    [
                                        'Title' => 'Development and implementation of healthcare software applications for real-time information processing – e-referrals, e-prescriptions, etc.',
                                        'Context' => 'Electronic healthcare services are rare in Bulgaria, resulting in administrative burden for medical professionals and delays for patients.',
                                        'Main Goal' => 'Optimize and digitize healthcare processes to improve service quality and control over public healthcare spending.',
                                        'Ambition' => 'Significantly reduce administrative burden for doctors and improve patient service.',
                                        'Relevance to Key Challenges' => 'Improves public services and enables more effective monitoring of public health expenditure.',
                                        'Responsible Institution' => 'Ministry of Health',
                                        'Other Public Institutions Involved' => 'National Health Insurance Fund',
                                        'Other Stakeholders' => 'Patient organizations, General Practitioners’ Association',
                                        'Expected Impact' => 'Reduced time to issue referrals and prescriptions; tracking of visits and prescriptions; better planning and patient access.',
                                        'Timeline' => 'December 2018',
                                    ],
                                    [
                                        'Title' => 'Transform primary registration of Non-Profit Legal Entities (NPLE) from judicial to administrative and centralize the NPLE registry via full digitization',
                                        'Context' => 'Previously, NPLEs were registered through courts, requiring more time and resources, and the registry was fragmented and poorly updated.',
                                        'Main Goal' => 'Consolidate NPLE information and simplify registration; ensure accessible and verifiable information.',
                                        'Ambition' => 'Full digitization of the registry within the Registry Agency and provision of electronic services for NGOs.',
                                        'Relevance to Key Challenges' => 'Enhances public services and simplifies registration, promoting civic organization.',
                                        'Responsible Institution' => 'Registry Agency',
                                        'Other Public Institutions Involved' => 'Ministry of Justice',
                                        'Other Stakeholders' => 'Center for the Study of Democracy',
                                        'Expected Impact' => 'Simplified and accelerated registration procedure; access to a complete electronic NGO registry.',
                                        'Timeline' => 'June 2017',
                                    ],
                                    [
                                        'Title' => 'Integration of the Management Information System for EU Funds (MIS EF) with National Statistical Institute datasets',
                                        'Context' => 'The EU Funds Management Information System holds project and beneficiary information, but there are gaps in monitoring and integrated data use.',
                                        'Main Goal' => 'Provide statistical data on program indicators for better performance and efficiency assessment of EU-funded programs.',
                                        'Ambition' => 'Timely assessment of program impact to maximize benefits.',
                                        'Relevance to Key Challenges' => 'Supports more efficient public resource management and provides detailed information on government program execution.',
                                        'Responsible Institution' => 'Administration of Council of Ministers, Central Coordination Unit',
                                        'Other Public Institutions Involved' => 'National Statistical Institute',
                                        'Other Stakeholders' => 'Beneficiaries of operational programs',
                                        'Expected Impact' => 'Generation of detailed statistical reports; clear evaluation of program outcomes; better targeting of funds; transparency.',
                                        'Timeline' => 'December 2017',
                                    ],
                                    [
                                        'Title' => 'Upgrade core systems of Customs Agency to provide data and services to external systems',
                                        'Context' => 'The Customs Agency offers electronic services mainly for the trade sector, but existing services are on old platforms requiring updates for accessibility and EU compliance.',
                                        'Main Goal' => 'Ensure usability and accessibility of services for citizens and businesses.',
                                        'Ambition' => 'Reduce administrative obstacles and integrate Customs systems with external software.',
                                        'Relevance to Key Challenges' => 'Improves public services and efficient resource management through automated internal control.',
                                        'Responsible Institution' => 'Customs Agency',
                                        'Other Public Institutions Involved' => 'Ministry of Finance',
                                        'Other Stakeholders' => 'Private sector',
                                        'Expected Impact' => 'Integration with EU components; stable internal systems; convenient electronic services for citizens and businesses.',
                                        'Timeline' => 'June 2018',
                                    ],
                                    [
                                        'Title' => 'Implementation of the Electronic Public Procurement Information System (e-Procurement) with all modules including electronic evaluation and offer submission',
                                        'Context' => 'Public procurement procedures are sensitive in Bulgaria and currently not fully automated, requiring manual preparation and submission of bids.',
                                        'Main Goal' => 'Simplify procurement procedures and ensure objective, transparent evaluation and contract awarding.',
                                        'Ambition' => 'Fully electronic public procurement process',
                                        'Relevance to Key Challenges' => 'Digitization and transparency improve public services, integrity of institutions, business environment, and public resource management.',
                                        'Responsible Institution' => 'Public Procurement Agency',
                                        'Other Public Institutions Involved' => 'Ministry of Finance',
                                        'Other Stakeholders' => 'Contracting authorities and business entities participating in procurement',
                                        'Expected Impact' => 'Electronic process for all procurement stages; standardized processes and templates; improved control and optimized registry management.',
                                        'Timeline' => 'June 2018',
                                    ]
                                )
                            ]
                        ),
                        'Access to Information' => array(
                            [
                                'commitment' => 'The Bulgarian government will continue improving access to information by constantly expanding the scope of published public information and widely digitizing information provision processes',
                                'arrangements' => array(
                                    [
                                        'Title' => 'Coordination and support in revising internal rules for implementing the Access to Public Information Act (APIA), ensuring compliance with APIA amendments through clear mechanisms and responsibilities for proactive publication and internal control.',
                                        'Context' => 'Public institutions have been required to adopt and publish internal rules for APIA since 2008. By 2015, 482 out of 576 administrations had such rules. Amendments in December 2015 introduced new obligations, including proactive publication, electronic provision of information, and reuse of information, requiring review of internal rules and clear responsibilities.',
                                        'Main Goal' => 'Standardize and improve the organization of public information provision processes and internal control.',
                                        'Ambition' => 'Transparent process for information provision and easier access for citizens.',
                                        'Relevance to Key Challenges' => 'Provides a framework to improve public information processes, enhance transparency, and strengthen institutional integrity.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers',
                                        'Other Public Institutions Involved' => 'All public bodies under APIA',
                                        'Other Stakeholders' => 'Access to Information Program',
                                        'Expected Impact' => 'Accelerated alignment of internal rules with legal requirements.',
                                        'Timeline' => 'June 2017',
                                    ],
                                    [
                                        'Title' => 'Training on APIA amendments for all public administration employees, especially units responsible for APIA compliance and online publication.',
                                        'Context' => 'In 2016, APIA amendments introduced new obligations for proactive publication, expanded categories of information to be published online, and required institutions to maintain updated lists of information for publication. A central web-based platform for public information access will be developed.',
                                        'Main Goal' => 'Increase administrative capacity to implement APIA and provide public information.',
                                        'Ambition' => 'Promote a proactive approach to publishing public information.',
                                        'Relevance to Key Challenges' => 'Improves access to information by increasing the skills and capacity of civil servants, enhancing institutional integrity.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers',
                                        'Other Public Institutions Involved' => 'Institute of Public Administration',
                                        'Other Stakeholders' => 'Access to Information Program',
                                        'Expected Impact' => 'Enhanced skills and motivation of civil servants for providing public information and using the Information Access Platform.',
                                        'Timeline' => 'December 2017',
                                    ],
                                    [
                                        'Title' => 'Maintenance of public electronic registers by the State Gambling Commission (SGC) for gambling operators, production/distribution activities, gaming equipment service and import, revoked/refused licenses, and approved gaming equipment. Update and maintain a list of websites offering gambling without a license.',
                                        'Context' => 'The gambling sector is dynamic and regulated. SGC maintains publicly accessible registers to provide transparency on licensed and regulated gambling activities. Lists of unlicensed online operators protect citizens and revenue collection.',
                                        'Main Goal' => 'Transparency of licensed gambling activity and prevention of illegal gambling. Improve the business environment and increase budget revenues.',
                                        'Ambition' => 'Protect legal gambling operators and citizens.',
                                        'Relevance to Key Challenges' => 'Improves public services and management of public resources; enhances access to information about SGC activities.',
                                        'Responsible Institution' => 'State Gambling Commission',
                                        'Other Public Institutions Involved' => 'Ministry of Finance',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Promotes legitimate operators; transparency in SGC operations; better control of gambling activities.',
                                        'Timeline' => 'Ongoing',
                                    ],
                                    [
                                        'Title' => 'Publishing annual priorities of the National Revenue Agency (NRA), main results of NRA activities, and results of sociological surveys related to NRA work.',
                                        'Context' => 'The NRA is in constant contact with citizens and businesses. It provides comprehensive information on services, forms, guidance, rights and obligations, and freely available electronic services, leveraging modern ICT tools.',
                                        'Main Goal' => 'Increase transparency of NRA activities and reduce administrative burden for taxpayers.',
                                        'Ambition' => 'Maintain citizen- and business-oriented approaches.',
                                        'Relevance to Key Challenges' => 'Improves public services and public resource management; increases transparency of NRA operations.',
                                        'Responsible Institution' => 'National Revenue Agency',
                                        'Other Public Institutions Involved' => 'Ministry of Finance',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Improved predictability of business environment; services aligned with user needs; enhanced citizen oversight of NRA activities.',
                                        'Timeline' => 'June 2018',
                                    ],
                                    [
                                        'Title' => 'Publishing analyses/studies funded by ESIF to support information exchange, harmonize practices, and map resources by topics for improved access to information.',
                                        'Context' => 'ESIF management and expenditure systems contain common rules and principles. Sharing lessons learned and best practices across programs and projects helps beneficiaries prepare better projects and improve execution.',
                                        'Main Goal' => 'Support beneficiaries in preparing high-quality projects and improving project management and funding utilization.',
                                        'Ambition' => 'Greater consistency, administrative interaction, and information exchange for transparency and uniform ESIF management.',
                                        'Relevance to Key Challenges' => 'Enhances guidance for beneficiaries, improves public resource management, and supports effective application of rules and best practices.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers, Central Coordination Unit',
                                        'Other Public Institutions Involved' => 'None',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Harmonized publication practices; wider access to analytical expertise accumulated from ESIF-funded programs and projects.',
                                        'Timeline' => 'Ongoing',
                                    ],
                                    [
                                        'Title' => 'Create a registry of all independent regulatory, supervisory, and control bodies appointed by the National Assembly, with information on institutional websites, powers, mandates, members, legal basis, and decisions.',
                                        'Context' => 'Many regulatory and supervisory bodies exist in Bulgaria, but consolidated information on their functions, powers, and decisions is lacking.',
                                        'Main Goal' => 'Facilitate access to information about regulatory bodies and increase transparency.',
                                        'Ambition' => 'Enable more active citizen oversight of regulatory and supervisory bodies.',
                                        'Relevance to Key Challenges' => 'Enhances public access to information and transparency, strengthening institutional integrity and public resource management.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers',
                                        'Other Public Institutions Involved' => 'None',
                                        'Other Stakeholders' => 'Center for Liberal Strategies, Bulgarian Institute for Legal Initiatives',
                                        'Expected Impact' => 'Structured and consolidated information; more effective citizen oversight of regulatory bodies.',
                                        'Timeline' => 'June 2018',
                                    ],
                                    [
                                        'Title' => 'Develop an information system for the collection, digitization, and storage of the national state archive at the National Institute for Immovable Cultural Heritage (NIICH), and implement electronic services for citizens and government employees through a digital public archive and electronic register of immovable cultural and archaeological heritage.',
                                        'Context' => 'Currently, Bulgaria lacks a well-structured digital system for the National Documentary Archive Fund. Information is collected digitally but not systematically archived, causing delays and inefficiencies.',
                                        'Main Goal' => 'Expand access to public information and increase citizen engagement in monitoring and preserving immovable cultural heritage.',
                                        'Ambition' => 'Complete update and accessibility of cultural heritage information.',
                                        'Relevance to Key Challenges' => 'Provides extended access to information and enhances citizen oversight; improves public services and institutional integrity.',
                                        'Responsible Institution' => 'Ministry of Culture',
                                        'Other Public Institutions Involved' => 'National Institute for Immovable Cultural Heritage',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Updated, complete, and electronically accessible archive; improved information exchange; electronic services for citizens and municipalities to facilitate heritage preservation and control.',
                                        'Timeline' => 'December 2017',
                                    ]
                                )
                            ]
                        ),
                        'Open Cities' => array(
                            [
                                'commitment' => 'The Bulgarian government will cooperate with and encourage local authorities to implement and develop open governance practices at the local level',
                                'arrangements' => array(
                                    [
                                        'Title' => 'Adoption of a local open data program, including a list of databases and a timeline for their release',
                                        'Context' => 'Efforts to publish public information in open, machine-readable formats are mostly focused at the central level, with few examples of proactive publication by municipalities. Meanwhile, there is strong demand for municipal data, which has potential to unlock economic and social benefits.',
                                        'Main Goal' => 'Expand the open data policy and create new opportunities for citizen participation at the local level.',
                                        'Ambition' => 'Gradually involve large cities in the open data initiative and unlock the economic and social potential of public information in open format.',
                                        'Relevance to Key Challenges' => 'Improves access to information and expands open data publication. Aims to provide better local public services, more efficient use of public resources, and increased integrity of local authorities.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers',
                                        'Other Public Institutions Involved' => 'National Association of Municipalities in Bulgaria',
                                        'Other Stakeholders' => 'Sofia Municipality, NGO Links Association',
                                        'Expected Impact' => 'Increased transparency of municipal policies, data-based products and services, and more active citizen involvement in designing municipal public services and decision-making processes at the local level.',
                                        'Timeline' => 'December 2017',
                                    ],
                                    [
                                        'Title' => 'Enhancing transparency of local public finances – pilot implementation of a “citizen budget” in Sofia Municipality',
                                        'Context' => 'Most Bulgarian municipalities actively publish budget information, but it is often too complex, requiring specialized expertise to analyze. This discourages citizen participation in such an important area as municipal finances.',
                                        'Main Goal' => 'Encourage citizen participation by providing understandable information on municipal budgets, also called a “citizen budget.”',
                                        'Ambition' => 'Introduce the practice of preparing a “citizen budget” at the municipal level.',
                                        'Relevance to Key Challenges' => 'Promotes more active and informed citizen participation in municipal budget management and control. Supports more effective management of public resources.',
                                        'Responsible Institution' => 'Sofia Municipality',
                                        'Other Public Institutions Involved' => 'National Association of Municipalities in Bulgaria',
                                        'Other Stakeholders' => 'Municipalities',
                                        'Expected Impact' => 'Better understanding of citizens’ expectations, development of capacity to present complex financial information in an accessible way, improved communication, and more active citizen participation in managing municipal budgets.',
                                        'Timeline' => 'June 2017',
                                    ]
                                )
                            ]
                        ),
                        'Civic Participation' => array(
                            [
                                'commitment' => 'The Bulgarian government will enhance dialogue with civil society through innovative forms of interaction, allowing feedback and co-creation in policy-making',
                                'arrangements' => array(
                                    [
                                        'Title' => 'Improve the quality of public consultations by enhancing the functionalities of the Public Communication Portal; develop unified standards for selecting members of public and advisory councils, ensuring transparency of their activities and clear mechanisms for implementing their decisions; collaborate with civil society to prepare training programs for civil servants on organizing effective public consultations; develop practical guidelines/manuals for citizen engagement and feedback on proposals.',
                                        'Context' => 'Amendments to the Law on Normative Acts introduce higher requirements for the quality of public consultations. Past experience indicates weaknesses in public discussions that need to be addressed to increase stakeholder participation and the quality of consultation outcomes. Civil servants’ skills must be improved, and the portal upgraded to reflect new requirements, especially for feedback, crowdsourcing, and document search.',
                                        'Main Goal' => 'Improve the quality of public consultations and actively engage stakeholders in policy-making and drafting of normative acts.',
                                        'Ambition' => 'Leverage new technologies to broaden participation in public consultations.',
                                        'Relevance to Key Challenges' => 'Enhancing procedures and channels increases stakeholder participation and trust, thereby improving institutional integrity.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers',
                                        'Other Public Institutions Involved' => 'Institute of Public Administration, Council for Administrative Reform',
                                        'Other Stakeholders' => 'Bulgarian Center for Non-Profit Law, Forum “Civic Initiatives”',
                                        'Expected Impact' => 'Increased stakeholder participation, higher quality consultations, improved internal procedures, and enhanced civil servant skills for public discussion facilitation.',
                                        'Timeline' => 'December 2017',
                                    ],
                                    [
                                        'Title' => 'Introduce national e-petition capability for national and local civic initiatives and reduce bureaucracy and personal data collection, including amending the Law on Direct Citizen Participation',
                                        'Context' => 'Currently, the law does not allow e-petitions for national or local initiatives, only for European Citizens’ Initiatives.',
                                        'Main Goal' => 'Activate civic participation by simplifying procedures for organizing national and local civic initiatives.',
                                        'Ambition' => 'Expand opportunities for Bulgarian citizens to influence governance.',
                                        'Relevance to Key Challenges' => 'New technologies facilitate citizen self-organization for more active decision-making participation and improve institutional integrity.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers',
                                        'Other Public Institutions Involved' => 'None',
                                        'Other Stakeholders' => 'Bulgarian Center for Non-Profit Law, Forum “Civic Initiatives”',
                                        'Expected Impact' => 'Promote citizen self-organization and initiatives; reduce bureaucratic barriers to direct participation.',
                                        'Timeline' => 'June 2018',
                                    ],
                                    [
                                        'Title' => 'Create a permanent platform for joint monitoring and evaluation of the implementation of the Open Government Partnership (OGP) plans with stakeholders',
                                        'Context' => 'Stakeholder involvement in monitoring OGP action plan implementation is currently unsystematic and relies on active civil society participation. Due to low awareness and lack of clear mechanisms, few civil society representatives are involved.',
                                        'Main Goal' => 'Stimulate active participation and improve quality of implementation through structured monitoring of national OGP action plans.',
                                        'Ambition' => 'Continuously improve implementation quality and engage all stakeholders in monitoring and evaluation.',
                                        'Relevance to Key Challenges' => 'A permanent monitoring mechanism increases information availability, ensures predictable dialogue, creates sustainable cooperation, and fosters civic participation, improving institutional integrity.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers',
                                        'Other Public Institutions Involved' => 'Relevant ministries responsible for measures in the plans',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Increased transparency, broader stakeholder participation, identification and correction of weaknesses, and strategic approach to implementation and evaluation.',
                                        'Timeline' => 'October 2016',
                                    ],
                                    [
                                        'Title' => 'Pilot a new method for analyzing complex and open issues in policy-making for ESIF management using design-thinking: conduct a seminar with stakeholders focused on environmental and climate policies as cross-cutting policy areas',
                                        'Context' => 'Collaborative approaches (co-design, design-thinking) are still underused in Bulgaria for complex policy formulation. Conventional methods dominate, which are static and limit creativity.',
                                        'Main Goal' => 'Introduce innovative consultation models and improve the quality of policy-making.',
                                        'Ambition' => 'Promote a collaborative culture in policy formulation and implementation.',
                                        'Relevance to Key Challenges' => 'Collaborative methods promote equality and balanced consultation, sharing opinions, and stimulating civic participation, improving institutional integrity and resource management.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers, Central Coordination Unit',
                                        'Other Public Institutions Involved' => 'None',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Developed skills in applying design-thinking for complex policy issues; stimulated stakeholder creativity; promoted innovative consultation approaches.',
                                        'Timeline' => 'December 2016',
                                    ],
                                    [
                                        'Title' => 'Develop and organize forums for drafting a Corporate Social Responsibility (CSR) strategy',
                                        'Context' => 'CSR initiatives exist mainly through company self-organization and are not systematically encouraged by public institutions.',
                                        'Main Goal' => 'Establish clear mechanisms to promote CSR in collaboration with businesses.',
                                        'Ambition' => 'Ensure systematic CSR promotion and leverage business resources for better social services.',
                                        'Relevance to Key Challenges' => 'Encourages collaborative approaches, stakeholder engagement, and transparency in strategic document development, enhancing institutional integrity and social service delivery.',
                                        'Responsible Institution' => 'Ministry of Labour and Social Policy',
                                        'Other Public Institutions Involved' => 'None',
                                        'Other Stakeholders' => 'Business organizations',
                                        'Expected Impact' => 'Facilitate CSR initiatives by businesses; improve cooperation between state and business in social services; provide predictability and systematization of CSR incentives.',
                                        'Timeline' => 'June 2018',
                                    ]
                                )
                            ],
                            [
                                'commitment' => 'The Bulgarian government will improve the environment and take steps to support the development of civil society organizations',
                                'arrangements' => array(
                                    [
                                        'Title' => 'Update the Strategy for Supporting the Development of Civil Society Organizations and adopt a new plan and responsible institution for its implementation',
                                        'Context' => 'The previous strategy has expired and there is currently no institution responsible for updating and implementing it.',
                                        'Main Goal' => 'Create conditions for effective functioning of civil society organizations and their active participation in decision-making, policy formulation, and governance oversight.',
                                        'Ambition' => 'A viable civil sector that actively improves governance, delivers effective services, and increases expertise.',
                                        'Relevance to Key Challenges' => 'Aims to provide conditions for civil society development and strengthen partnerships between civil society and national and local institutions, improving institutional integrity.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers',
                                        'Other Public Institutions Involved' => 'None',
                                        'Other Stakeholders' => 'Bulgarian Center for Non-Profit Law, Forum “Civic Initiatives”',
                                        'Expected Impact' => 'Support for the development of civil society organizations.',
                                        'Timeline' => 'December 2017',
                                    ]
                                )
                            ]
                        ),
                        'Honest Governance (Integrity)' => array(
                            [
                                'commitment' => 'The Bulgarian government will work to increase integrity in governance and improve internal and external control over institutional activities',
                                'arrangements' => array(
                                    [
                                        'Title' => 'Create a public registry for budgetary and project control in e-governance',
                                        'Context' => 'E-governance implementation in Bulgaria is a large-scale priority. Several high-value projects are planned as part of the initiative.',
                                        'Main Goal' => 'Ensure transparency through public access to all project ideas within e-governance.',
                                        'Relevance to Key Challenges' => 'Improves information access and exchange, transparency, and accountability in e-governance projects. Enhances institutional integrity and more effective public resource management.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers',
                                        'Other Public Institutions Involved' => 'Agency for E-Government (to be established)',
                                        'Other Stakeholders' => 'IT sector companies',
                                        'Expected Impact' => 'Improved project traceability; prevention of activity duplication; effective citizen oversight.',
                                        'Timeline' => 'December 2017',
                                    ],
                                    [
                                        'Title' => 'Implement a universal ISAC “Corruption Risk Analysis” system',
                                        'Context' => 'Anti-corruption units across government sectors need tools to analyze potential risks for public office holders. Current processes are fragmented and manually intensive. The system will automate risk analysis using multiple sources and registers, with periodic and ad-hoc checks and public aggregated reports.',
                                        'Main Goal' => 'Improve internal control processes and reduce corruption risk.',
                                        'Ambition' => 'Fully automated control process.',
                                        'Relevance to Key Challenges' => 'The system enables active citizen oversight and informed participation in preventing corruption and conflicts of interest, improving institutional integrity and resource management.',
                                        'Responsible Institution' => 'Ministry of Justice',
                                        'Other Public Institutions Involved' => 'Center for Prevention and Counteraction of Corruption and Organized Crime',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Consolidated and more effective corruption risk analysis; public reports increase citizen pressure.',
                                        'Timeline' => 'September 2017',
                                    ],
                                    [
                                        'Title' => 'Professional and psychological suitability assessment for appointments and promotions in the Customs Agency (draft regulation submitted to Ministry of Finance)',
                                        'Context' => 'Customs employees perform duties critical to national security and public order. Article 10, paragraph 11 of the Customs Law sets high standards, requiring professional and psychological assessment to ensure integrity, impartiality, and proper training. The procedure combines competence tests with psychological evaluation to select candidates capable of maintaining high integrity standards.',
                                        'Main Goal' => 'Effectively prevent unauthorized practices and reduce corruption risk through personnel selection and internal control measures.',
                                        'Ambition' => 'Make the Customs Agency a model for effectively handling corruption pressure.',
                                        'Relevance to Key Challenges' => 'Enhances institutional integrity and more effective management of public resources.',
                                        'Responsible Institution' => 'Customs Agency',
                                        'Other Public Institutions Involved' => 'Ministry of Finance',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Reduced corruption risk; active prevention of corrupt practices; more effective agency performance.',
                                        'Timeline' => 'Ongoing',
                                    ],
                                    [
                                        'Title' => 'Ensure transparency of Customs Agency operations and management through multiple citizen reporting channels ("hotline", National Anti-Corruption Council system, email, written submissions, suggestion boxes) and take appropriate actions on received reports and suggestions',
                                        'Context' => 'Corruption prevention is a key priority for the Customs Agency and essential for effective operation.',
                                        'Main Goal' => 'Engage the public in preventing corruption and expand available communication channels.',
                                        'Responsible Institution' => 'Customs Agency',
                                        'Other Public Institutions Involved' => 'Ministry of Finance',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Improved transparency; increased reporting; better feedback; improved internal procedures.',
                                        'Timeline' => 'June 2018',
                                    ],
                                    [
                                        'Title' => 'Amend Public Procurement Law to require prior verification of candidates for contracts above a threshold and disclosure of the ultimate owner',
                                        'Context' => 'Public procurement, especially for large infrastructure projects, is highly sensitive. Lack of clarity on company ownership undermines trust and fosters corruption.',
                                        'Main Goal' => 'Enhance internal control over public spending and reduce corruption risk in procurement; ensure transparency regarding company ownership.',
                                        'Ambition' => 'Improve business environment and reduce opportunities for non-transparent companies to gain unfair advantage.',
                                        'Relevance to Key Challenges' => 'Increases procurement transparency, accountability, and institutional integrity; ensures more effective public resource management.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers',
                                        'Other Public Institutions Involved' => 'Ministry of Justice',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Prevent public distrust; limit shell companies’ participation; provide a tool against corruption and misuse of public funds; enable authorities and financial institutions to verify real owners.',
                                        'Timeline' => 'June 2018',
                                    ]
                                )
                            ]
                        ),
                        'Open Data' => array(
                            [
                                'commitment' => 'The Bulgarian government will continue efforts to publish public information in open formats by implementing measures to improve data quality and encourage broad usage by stakeholders',
                                'arrangements' => array(
                                    [
                                        'Title' => 'Upgrade and improve the Open Data Portal with new functionalities – organizational hierarchy, improved search, issue tracker for datasets, automated data upload tools, low-quality data alerts, certificates for high-performing institutions, feedback options, etc.',
                                        'Context' => 'The portal is currently in demo version and lacks several key functionalities.',
                                        'Main Goal' => 'Enhance the Open Data Portal and improve data quality through automated processes for publishing public information in machine-readable formats.',
                                        'Ambition' => 'Improved usability of the portal and the published data',
                                        'Relevance to Key Challenges' => 'Enhanced usability, extended functionalities, and better data quality encourage active use by civil society and businesses, supporting informed decision-making and policy formulation. Improves institutional integrity, resource management, and public services.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers',
                                        'Other Public Institutions Involved' => 'None',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Higher quality and usability of datasets; increased user engagement and communication; more data-based services and products.',
                                        'Timeline' => 'December 2017',
                                    ],
                                    [
                                        'Title' => 'Publish data from ISUN2020 on programs and projects, including progress updates',
                                        'Context' => 'Data are already on the portal but require continuous updating and improvement.',
                                        'Main Goal' => 'Increase usability of published information and broaden the user base.',
                                        'Ambition' => 'Enable active public oversight of EU-funded programs and projects.',
                                        'Relevance to Key Challenges' => 'Expands accessible machine-readable information. Improves institutional integrity, resource management, and public services.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers, Central Coordination Unit',
                                        'Other Public Institutions Involved' => 'None',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Improved analysis and visualization quality; better data-driven planning; increased transparency and stakeholder engagement.',
                                        'Timeline' => 'Ongoing',
                                    ],
                                    [
                                        'Title' => 'Conduct public events to promote the benefits of open data and gather examples of economic and social impact',
                                        'Context' => 'Despite progress in publishing public information in open formats, usage remains limited as users are not fully familiar with the portal or data skills.',
                                        'Main Goal' => 'Increase use of open data in policy formulation, services, products, and institutional oversight.',
                                        'Ambition' => 'Generate tangible economic and social benefits from open data publication.',
                                        'Relevance to Key Challenges' => 'Encourages citizen and business engagement in data-driven product and service development. Enhances institutional integrity and resource management.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers',
                                        'Other Public Institutions Involved' => 'Data owners',
                                        'Other Stakeholders' => 'IT specialists, analysts, media',
                                        'Expected Impact' => 'Increased interest in datasets; new data-based products and services; creation of a user ecosystem.',
                                        'Timeline' => 'Ongoing',
                                    ],
                                    [
                                        'Title' => 'Prepare and distribute a manual for working with open data',
                                        'Context' => 'Data skills are relatively new, and few policy decisions currently rely on open data.',
                                        'Main Goal' => 'Encourage public officials to use data in their duties and improve their data processing and analysis skills.',
                                        'Ambition' => 'More active use of data in policy development.',
                                        'Relevance to Key Challenges' => 'Improves user data skills and accessibility of published open data. Supports institutional integrity, resource management, and public services.',
                                        'Responsible Institution' => 'Administration of the Council of Ministers',
                                        'Other Public Institutions Involved' => 'Institute of Public Administration',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Improved data analysis and processing skills among public officials.',
                                        'Timeline' => 'June 2017',
                                    ],
                                    [
                                        'Title' => 'Update, maintain, and develop GIS applications for the register of protected areas in Bulgaria',
                                        'Context' => 'GIS applications are critical for environmental management, but currently only one application exists for protected areas.',
                                        'Main Goal' => 'Improve decision-making and targeting of conservation measures. Engage citizens in protection and management.',
                                        'Ambition' => 'Provide high-quality information services for internal and external users.',
                                        'Relevance to Key Challenges' => 'Increases available information and mapping, enhances transparency, and allows civil society oversight of environmental decision-making.',
                                        'Responsible Institution' => 'Ministry of Environment and Waters, Directorate "National Nature Protection Service"',
                                        'Other Public Institutions Involved' => 'None',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'More timely and effective conservation actions; engagement of environmental organizations and citizens; creation of visualizations and scenario tracking.',
                                        'Timeline' => 'May 2018',
                                    ],
                                    [
                                        'Title' => 'Publish a macroeconomic forecast table twice a year',
                                        'Context' => 'Currently published in PDF, not machine-readable format.',
                                        'Main Goal' => 'Increase financial transparency and accountability.',
                                        'Ambition' => 'Expand the scope of data published in the Open Data Portal.',
                                        'Relevance to Key Challenges' => 'Enhances volume, quality, and usability of financial information. Supports more effective resource management.',
                                        'Responsible Institution' => 'Ministry of Finance',
                                        'Other Public Institutions Involved' => 'None',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Simplifies data processing; increases transparency and accountability; improves accuracy of analyses.',
                                        'Timeline' => 'Annually, semi-annually in April and October',
                                    ],
                                    [
                                        'Title' => 'Publish open data on migration processes',
                                        'Context' => 'Data are not in open, machine-readable formats.',
                                        'Main Goal' => 'Facilitate data processing and activate citizen participation on migration issues.',
                                        'Ambition' => 'Develop applications to address societal concerns.',
                                        'Relevance to Key Challenges' => 'Enables analysis and informed policy participation. Supports institutional integrity and resource management.',
                                        'Responsible Institution' => 'Ministry of Interior',
                                        'Other Public Institutions Involved' => 'None',
                                        'Other Stakeholders' => 'Institute for Public Environment Development',
                                        'Expected Impact' => 'Active stakeholder engagement; increased awareness of migration processes; data-driven policy formulation.',
                                        'Timeline' => 'June 2017',
                                    ],
                                    [
                                        'Title' => 'Further develop the EISPP and provide public access to core system data in line with Open Data initiatives and KAO provision',
                                        'Context' => 'Judicial system data are valuable for analysts, media, and citizens but are not published in machine-readable formats.',
                                        'Main Goal' => 'Increase transparency and effectiveness of the judicial system.',
                                        'Ambition' => 'Gradually build citizen trust in judicial authorities.',
                                        'Relevance to Key Challenges' => 'Expands available public information, enhances usability and quality, and improves public services and institutional integrity.',
                                        'Responsible Institution' => 'Supreme Judicial Council',
                                        'Other Public Institutions Involved' => 'Ministry of Justice',
                                        'Other Stakeholders' => 'None',
                                        'Expected Impact' => 'Data-driven decision-making; identification of systemic weaknesses; stakeholder engagement in judicial reform.',
                                        'Timeline' => 'June 2018',
                                    ],
                                )
                            ],
                        )

                    ),
                )
            ),

        );

        if ($id) {
            return array(
                'files' => $data[$id]['files'][$lang] ?? [],
                'evaluations' => $data[$id]['evaluations'][$lang] ?? [],
                'content' => $data[$id]['content'][$lang] ?? [],
                'ogDescription' => $data[$id]['ogDescription'][$lang] ?? [],
                'arrangements' => $data[$id]['arrangements'][$lang] ?? [],
            );
        } else {
            return $data;
        }
    }
}
