@extends('layouts.site')

@section('pageTitle', 'Стратегически документи - вътрешна страница')

@section('content')
<section class="public-constultation">

    <div class="container">
        <div class="row mb-3">
            <div class="col-md-12">
                <h2 class="mb-2">Информация</h2>
                <p>
                    С проекта на наредба се предлагат:

                    I. Промени, свързани с въвеждането в националното законодателство на Делегирана директива (ЕС) 2022/2407 на Комисията от 20 септември 2022 година за изменение на приложенията към Директива 2008/68/ЕО на Европейския парламент и на Съвета с оглед на адаптирането към научно-техническия прогрес (ОВ L 317, 09/12/2022) (Делегирана директива (ЕС) 2022/2407).

                    Директива 2008/68/ЕО относно вътрешния превоз на опасни товари (2008/68/ЕО) е въведена в националното законодателство с Наредба № 46 от 30.11.2001 г. за железопътен превоз на опасни товари. Съгласно чл. 8, параграф 1 от Директива 2008/68/ЕО, Европейската комисия приема делегирани актове за изменение на приложенията на директивата с цел отчитане на измененията на ADR, RID и ADN, по-специално свързаните с научния и техническия прогрес, включително използването на технологии за локализиране и проследяване. Приетите въз основа на цитирания текст актове, въвеждащи изменения на приложенията към Директива 2008/68/ЕО, са въведени в Наредба № 46, с изключение на Делегирана директива (ЕС) 2022/2407. Текстът, който следва да се транспонира от посочената делегирана директива се съдържа в чл. 1, т. 2 от нея и гласи: „в приложение II раздел II.1 се заменя със следното:

                    „II.1. RID
                </p>

                <p>
                    <strong>Приложението към RID, приложимо от 1 януари 2023 г., като се разбира, че където е уместно „RID договаряща държава" се заменя с „държава членка“.</strong>
                </p>

                <p>
                    Подобен текст вече е транспониран и се съдържа в чл. 2, ал. 1 от Наредба № 46. За да се транспонира Делегирана директива (ЕС) 2022/2407 е необходимо да се добави заглавието й в края на § 2 от Заключителните разпоредби на действащата Наредба № 46, което се предлага в параграф единствен от проекта на наредба.

                    Предложеният проект на Наредба за изменение и допълнение на Наредба № 46 не оказва пряко/или косвено въздействие върху държавния бюджет. Не са необходими финансови и други средства за прилагането на новата уредба.

                    На основание чл. 26, ал. 2-4 от Закона за нормативните актове проектът на наредба, заедно с доклада към него, е публикуван за обществено обсъждане на страницата на Министерството на транспорта, информационните технологии и съобщенията и на Портала за обществени консултации на Министерски съвет. На заинтересованите лица е предоставена възможност да се запознаят с проекта на Наредба за изменение и допълнение на Наредба № 46 и да представят писмени предложения или становища в 14-дневен срок от публикуването им.
                </p>


                <p>
                    <strong>
                        Решението за определяне на по-кратък срок за обществено обсъждане на проекта на акт е взето в съответствие с изискванията на чл. 26, ал. 4, изречение второ от Закона за нормативните актове, като е съобразено, че публикуваният за обществено обсъждане проект на наредба включва разпоредби, които имат технически характер и чрез тях се въвежда изискването на чл. 1, параграф 2 от Делегирана директива (ЕС) 2022/2407, който регламентира актуалната редакция на правилата към RID – приложима от 1 януари 2023 г., която вече е в сила за Република България.
                    </strong>
                </p>

                <p>
                    В изпълнение на изискванията на чл. 3, ал. 4, т. 1 от Постановление № 85 на Министерския съвет от 2007 г. за координация по въпросите на Европейския съюз (обн., ДВ, бр. 35 от 2007 г., изм., бр. 53 и 64 от 2008 г., бр. 34, 71, 78 и 83 от 2009 г., бр. 4, 5, 19 и 65 от 2010 г., попр., бр. 66 от 2010 г., изм., бр. 2 и 105 от 2011 г., доп., бр. 68 от 2012 г., изм., бр. 62, 65 и 80 от 2013 г., изм. и доп., бр. 53 от 2014 г., изм., бр. 76 от 2014 г., изм. и доп., бр. 94 от 2014 г., изм., бр. 101 от 2014 г., изм. и доп., бр. 6 от 2015 г., изм., бр. 36 от 2016 г., изм. и доп., бр. 79 от 2016 г., изм., бр. 7 и 12 от 2017 г., изм. и доп., бр. 39 от 2017 г., бр. 3 от 2019 г., изм., бр. 41 от 2021 г.) е изготвена таблица за съответствие с Делегирана директива (ЕС) 2022/2407. Проектът на наредба е съгласуван в рамките на Работна група 9 „Транспортна политика“, за което е приложено становище на работната група.
                </p>

                <p>
                    <strong>
                        Лице за контакт:
                    </strong>
                </p>
                <p>
                    Мария Стефанова <br>
                    Главен секретар <br>
                    ИА „Железопътна администрация" <br>
                    Тел.:  <a href="tel:359884 101 581" class="main-color">02/9409 378</a>, Мобилен:  <a href="tel:359884 101 581" class="main-color">+359 884 101 581</a><br>
                    Е-mail: <a href="mailto:mstefanova@iaja.bg " class="main-color">mstefanova@iaja.bg </a><br>
                </p>
            </div>
        </div>

        <div class="row mb-4">
            <div class="col-md-12">
                <div class="table-responsive">
                    <table class="table align-middle ">
                        <thead class="table-light">
                        <tr>
                            <td>
                                <strong>Дата на откриване:</strong>
                            </td>
                            <td>
                                <strong>Целева група:</strong>
                            </td>
                            <td>
                                <strong>Сфера на действие:</strong>
                            </td>
                            <td>
                                <strong>Дата на приключване:</strong>
                            </td>
                        </tr>
                        </thead>
                        <tbody>
                        <tr>
                            <td>
                                13.7.2023 г.

                            </td>
                            <td>
                                Всички заинтересовани
                            </td>
                            <td>
                                Транспорт
                            </td>
                            <td>
                                27.7.2023 г.
                            </td>
                        </tr>

                        </tbody>
                    </table>
                </div>
            </div>
        </div>

        <div class="row">
            <div class="col-md-12 mb-4">

                <div class="file-wrap d-flex w-100 ">
                    <a href="#" class="ok-file main-color"><i class="bi bi-file-earmark-word main-color"></i>Проект на Наредба за изменение и допълнение на Наредба № 46 от 30.11.2001 г. за железопътен превоз на опасни товари </a>

                    <a href="#" class="ok-file main-color"><i class="bi bi-file-earmark-word main-color"></i>Мотиви към Проекта на Наредба за изменение и допълнение на Наредба № 46 от 30.11.2001 г. за железопътен превоз на опасни товари  </a>

                    <a href="#" class="ok-file main-color"><i class="bi bi-file-earmark-word main-color"></i> Таблица за съответствие с правото на Европейския съюз към Проекта на Наредба за изменение и допълнение на Наредба № 46 от 30.11.2001 г. за железопътен превоз на опасни товари  </a>
                </div>

            </div>
        </div>

        <div class="row mb-3">
            <div class="col-md-12">
                <div class="mb-4">
                    <h4 class="mb-3">Коментари</h4>
                    <textarea class="form-control mb-3" id="exampleFormControlTextarea1" rows="3" ></textarea>

                    <button class=" cstm-btn btn btn-primary login m-0">Добавяне на коментар</button>
                </div>
            </div>
        </div>


        <div class="row mb-3">
            <div class="col-md-12">
                <div class="">
                    <h4 class="mb-3">Досие на актовете на Министерски съвет</h4>
                    <div class="timeline">


                        <div class="hori-timeline" dir="ltr">

                            <ul class="timeline events">
                                <li class="timeline-item mb-5">
                                    <h5 class="fw-bold">Включване на проекта на акт в законодателната или оперативната програма на Министерския съвет</h5>
                                    <p class="text-muted mb-2 fw-bold">12.05.2023</p>
                                    <p class="text-muted">
                                        Tова събитие описва запис на акт в ЗП или ОП (вж. предишните секции) с линк към тях. Ако актът е закон, той е в ЗП, ако е подзаконов акт на МС, е в ОП. Ако е друг, това събитие е неприложимо.
                                    </p>
                                </li>

                                <li class="timeline-item mb-5">
                                    <h5 class="fw-bold">Начало на обществената консултация</h5>
                                    <p class="text-muted mb-2 fw-bold">20.05.2023</p>
                                    <p class="text-muted">
                                        Визуализира се „Начало на консултацията“. Това събитие е задължително при създаването на всяка консултация (вж. 8.2.1.1.3.3. за обществените консултации). То е еднократно и в Timeline-а се показва дата и час на неговото създаване.
                                    </p>
                                </li>

                                <li class="timeline-item mb-5">
                                    <h5 class="fw-bold">Промяна на файл (само на файл) от обществената консултация – възможно е да има няколко такива събития.</h5>
                                    <p class="text-muted mb-2 fw-bold">25.05.2023</p>
                                    <p class="text-muted">
                                        Визуализира се „Промяна на файл от консултацията“ с дата, час и списък от променените или добавени файлове. Това събитие не е задължително, тъй като промени в записите от консултацията по правило не е редно да се случват.
                                    </p>
                                </li>

                                <li class="timeline-item mb-5">
                                    <h5 class="fw-bold">Приключване на консултацията</h5>
                                    <p class="text-muted mb-2 fw-bold">01.06.2023</p>
                                    <p class="text-muted">
                                        Визуализира се „Край на консултацията“. Това е еднократно и необратимо събитие. Срокът е съобразно зададения при създаването на консултацията срок (вж. 8.2.1.1.3.3). или неговото удължаване.
                                    </p>
                                </li>

                                <li class="timeline-item mb-5">
                                    <h5 class="fw-bold">Публикуване на справка за получените предложения или на съобщение за неполучени предложения</h5>
                                    <p class="text-muted mb-2 fw-bold">15.06.2023</p>
                                    <p class="text-muted">
                                        Според това дали има постъпили или не становища в рамките на консултацията, се публикува справка или съобщение. Коя от двете опции се визуализира зависи от записа, който е избрал модераторът в административната част.
                                    </p>
                                </li>

                                <li class="timeline-item mb-5">
                                    <h5 class="fw-bold">Приемане на акта от Министерския съвет</h5>
                                    <p class="text-muted mb-2 fw-bold">18.06.2023</p>
                                    <p class="text-muted">
                                        Визуализира се „Окончателен акт“. Събитието следва да се появи автоматично в Timeline-а след като е създаден запис в раздел „Правна информация на Министерския съвет“.
                                    </p>
                                </li>

                                <li class="timeline-item">
                                    <h5 class="fw-bold">   Представяне на законопроекта в страницата на Народното събрание</h5>
                                    <p class="text-muted mb-2 fw-bold">25.06.2023</p>
                                    <p class="text-muted">
                                        Това събитие ще бъде развито в обхвата на текущата поръчка, само ако Възложителят потвърди, че е организирана съответната координация със системата на Народното събрание.
                                    </p>
                                </li>



                            </ul>
                        </div>
                    </div>
                </div>
            </div>
        </div>


    </div>
    </div>
</section>
@endsection
